Repository: openstack/openstack-helm
Catalog: doc/source/locale/*/LC_MESSAGES/doc-devref.po
Languages: de, id, ko_kr

source: Script in :code:`neutron/templates/bin/_neutron-openvswitch-agent-init.sh.tpl` is responsible for determining the tunnel interface and its IP for later usage by :code:`neutron-ovs-agent`. The IP is set in init container and shared between init container and main container with :code:`neutron-ovs-agent` via file :code:`/tmp/pod-shared/ml2-local-ip.ini`.
de: Das Skript in :code:`neutron/templates/bin/_neutron-openvswitch-agent-init.sh.tpl` ist verantwortlich für die Bestimmung der Tunnelschnittstelle und ihrer IP für die spätere Verwendung durch :code:`neutron-ovs-agent`. Die IP wird im init-Container gesetzt und zwischen dem init-Container und dem Haupt-Container mit folgendem Code geteilt :code:`neutron-ovs-agent` via Datei :code:`/tmp/pod-shared/ml2-local-ip.ini`.
id: Skrip dalam :code:`neutron/templates/bin/_neutron-openvswitch-agent-init.sh.tpl` bertanggung jawab untuk menentukan antarmuka terowongan (tunnel interface) dan IP-nya untuk digunakan nanti oleh :code:`neutron-ovs-agent`. IP diatur dalam init container dan dibagi antara init container dan container utama dengan :code:`neutron-ovs-agent` melalui file :code:`/tmp/pod-shared/ml2-local-ip.ini`.
ko_kr: :code:`neutron/templates/bin/_neutron-openvswitch-agent-init.sh.tpl`의 스크립트는 :code:`neutron-ovs-agent`에 의한 나중의 사용을 위한 터널 인터페이스와 IP를 결정할 책임이 있습니다. IP는 init 컨테이너에 설정되고 init 컨테이너와 main 컨테이너 사이에서 :code:`/tmp/pod-shared/ml2-local-ip.ini`을 통한 :code:`neutron-ovs-agent`로 공유됩니다.

source: Specify if new SDN would like to use existing services from Neutron: L3, DHCP, metadata.
de: Geben Sie an, ob ein neues SDN vorhandene Dienste von Neutron verwenden möchte: L3, DHCP, Metadaten.
id: Tentukan apakah SDN baru ingin menggunakan layanan yang ada dari Neutron: L3, DHCP, metadata.
ko_kr: 새로운 SDN이 Neutron의 기존 서비스들을 사용할지 명시하십시오: L3, DHCP, 메타데이터.

source: The Neutron reference architecture provides mechanism_drivers :code:`OpenVSwitch` (OVS) and :code:`linuxbridge` (LB) with ML2 :code:`core_plugin` framework.
de: Die Neutron-Referenzarchitektur liefert mechanism_drivers :code:`OpenVSwitch` (OVS) und :code:`linuxbridge` (LB) mit ML2 :code:`core_plugin` framework.
id: Arsitektur referensi Neutron menyediakan mechanism_drivers :code:`OpenVSwitch` (OVS) dan :code:`linuxbridge` (LB) with ML2 :code:`core_plugin` framework.
ko_kr: Neutron 참조 구조는 ML2 :code:`core_plugin` 프레임워크와 함께 :code:`OpenVSwitch` (OVS) 와 :code:`linuxbridge` (LB) mechanism_drivers를 제공합니다.

source: The OpenStack-Helm project also implements annotations across all chart configmaps so that changing resources inside containers, such as configuration files, triggers a Kubernetes rolling update. This means that those resources can be updated without deleting and redeploying the service and can be treated like any other upgrade, such as a container image change.
de: Das OpenStack-Helm-Projekt implementiert auch Anmerkungen über alle Chartkonfigurationen hinweg, sodass das Ändern von Ressourcen in Containern, z.B. Konfigurationsdateien, ein aktualisierendes Kubernetes-Rollup-Update auslöst. Dies bedeutet, dass diese Ressourcen aktualisiert werden können, ohne dass der Service gelöscht und erneut bereitgestellt werden muss. Sie können wie jedes andere Upgrade behandelt werden, z.B. eine Container-Image-Änderung.
id: Proyek OpenStack-Helm juga mengimplementasikan anotasi di semua chart configmaps sehingga mengubah sumber daya di dalam kontainer, seperti file konfigurasi, memicu pembaruan bergulir Kubernetes. Ini berarti bahwa sumber daya tersebut dapat diperbarui tanpa menghapus dan menerapkan ulang layanan dan dapat diperlakukan seperti peningkatan lainnya, seperti perubahan container image.
ko_kr: OpenStack-Helm 프로젝트는 또한 모든 차트 configmap에 annotations를 구현하여 구성 파일과 같은 컨테이너 내부의 변경 리소스가 Kubernetes 롤링 업데이트를 촉발합니다. 이는 서비스를 삭제하거나 재배포하지 않고 해당 리소스들에 대한 업데이트를 할 수 있으며 컨테이너 이미비 변경과 같은 다른 업그레이드와 같이 처리 할 수 있음을 의미합니다.

source: The OpenStack-Helm project assumes all upgrades will be done through Helm. This includes handling several different resource types. First, changes to the Helm chart templates themselves are handled. Second, all of the resources layered on top of the container image, such as ``ConfigMaps`` which includes both scripts and configuration files, are updated during an upgrade. Finally, any image references will result in rolling updates of containers, replacing them with the updating image.
de: Das OpenStack-Helm-Projekt geht davon aus, dass alle Upgrades über Helm erfolgen. Dies umfasst die Behandlung mehrerer verschiedener Ressourcentypen. Zuerst werden Änderungen an den Helmchartvorlagen selbst vorgenommen. Zweitens werden alle Ressourcen, die über dem Container-Image liegen, wie z.B. ``ConfigMaps``, die sowohl Skripts als auch Konfigurationsdateien enthalten, während eines Upgrades aktualisiert. Abschließend führen alle Abbildreferenzen dazu, dass Aktualisierungen von Containern aktualisiert und durch das Update-Image ersetzt werden.
id: Proyek OpenStack-Helm mengasumsikan semua upgrade akan dilakukan melalui Helm. Ini termasuk menangani beberapa jenis sumber daya yang berbeda. Pertama, perubahan pada bagan Helm templates itu sendiri ditangani. Kedua, semua sumber daya yang berlapis di atas container image, seperti ``ConfigMaps`` yang mencakup file skrip dan konfigurasi, diperbarui selama upgrade. Akhirnya, setiap referensi image akan menghasilkan pembaruan bergulir kontainer, menggantikannya dengan image yang diperbarui.
ko_kr: OpenStack-Helm 프로젝트는 모든 업그레이드가 Helm을 통해 수행된다고 가정합니다. 이는 몇몇 다른 리소스 타입의 처리를 포함합니다. 첫째, Helm 차트 템플릿 자체의 변경이 처리됩니다. 둘째, ``ConfigMaps`` 와 같이 컨테이너 이미지 위에 계층화된 모든 리소스가 업그레이드 중에 업데이트 됩니다. 마지막으로, 모든 이미지 참조는 컨테이너의 롤링 업데이트를 가져오고, 업데이트한 이미지로 대체합니다.

source: The OpenStack-Helm project today uses a mix of Docker images from Stackanetes and Kolla, but will likely standardize on a default set of images for all charts without any reliance on image-specific utilities.
de: Das OpenStack-Helm-Projekt verwendet heute eine Mischung aus Docker-Images von Stackanetes und Kolla, standardisiert aber wahrscheinlich einen Standardsatz von Abbildern für alle Charts, ohne auf abbildspezifische Utilities angewiesen zu sein.
id: Proyek OpenStack-Helm saat ini menggunakan campuran image Docker dari Stackanetes dan Kolla, tetapi kemungkinan akan distandardisasi pada sekumpulan image default untuk semua chart tanpa bergantung pada image-specific utilities.
ko_kr: OpenStack-Helm 프로젝트는 현재 Stackanetes와 Kolla의 Docker 이미지를 혼합하여 사용하지만, 이미지 특정 유틸리티에 의존하지 않고 모든 차트를 위한 기본 이미지 세트를 표준화할 것입니다.

source: The ``hash`` function defined in the ``helm-toolkit`` chart ensures that any change to any file referenced by configmap-bin.yaml or configmap-etc.yaml results in a new hash, which will then trigger a rolling update.
de: Die im ``helm-toolkit``-Chart definierte ``hash``-Funktion stellt sicher, dass jede Änderung an einer beliebigen Datei, auf die configmap-bin.yaml oder configmap-etc.yaml verweist, zu einem neuen Hash führt, der dann ein Rolling auslöst aktualisieren.
id: Fungsi ``hash`` yang ditentukan dalam chart ``helm-toolkit`` memastikan bahwa perubahan apa pun ke file apa pun yang direferensikan oleh configmap-bin.yaml atau configmap-etc.yaml menghasilkan hash baru, yang kemudian akan memicu pemutaran memperbarui.
ko_kr: ``helm-toolkit`` 차트에서 정의된 ``hash`` 함수는 configmap-bin.yaml 또는 configmap-etc.yaml에서 참조되는 모든 파일에 대한 변화가 롤링 업데이트를 촉발할 새로운 hash를 생성하는 것을 보장합니다.

source: The above configuration options are handled by `neutron/values.yaml`:
de: Die obigen Konfigurationsoptionen werden von `neutron/values.yaml` gehandhabt:
id: Opsi konfigurasi di atas ditangani oleh `neutron/values.yaml`:
ko_kr: 위의 구성 옵션은 'neutrol/values.yaml` 에 의해 조절됩니다:

source: The farther down the list the label appears, the greater precedence it has. e.g., "another-label" overrides will apply to a node containing both labels.
de: Je weiter unten in der Liste das Label erscheint, desto größer ist die Priorität. z.B. ``another-label`` Überschreibungen gelten für einen Knoten, der beide Labels enthält.
id: Semakin jauh ke bawah daftar label muncul, semakin prioritas yang lebih besar itu. misalnya, penggantian "another-label" akan menerapkan ke nodus yang berisi kedua label.
ko_kr: 라벨이 표시된 목록이 낮을수록, 우선순위가 높아집니다. 예를 들어, \"another-label\" 의 오버라이드는 두 라벨 모두를 포함한 노드에 적용될 것입니다.

source: The following standards are in use today, in addition to any components defined by the service itself:
de: Die folgenden Standards werden heute zusätzlich zu den Komponenten verwendet, die vom Dienst selbst definiert werden:
id: Standar berikut sedang digunakan saat ini, selain komponen yang ditentukan oleh layanan itu sendiri:
ko_kr: 서비스 자체로 정의된 구성요소 외에도, 다음의 표준들이 현재 사용되고 있습니다.

source: The macros that help translate these into the actual URLs necessary are defined in the ``helm-toolkit`` chart. For instance, the cinder chart defines a ``glance_api_servers`` definition in the ``cinder.conf`` template:
de: Die Makros, die dabei helfen, diese in die tatsächlich benötigten URLs zu übersetzen, sind im ``helm-toolkit`` Chart definiert. Zum Beispiel definiert das Cinder-Chart eine ``glance_api_servers`` Definition in der `` cinder.conf`` Vorlage:
id: Makro yang membantu menerjemahkan ini ke URL yang sebenarnya diperlukan didefinisikan dalam chart ``helm-toolkit``. Sebagai contoh, chart cinder mendefinisikan definisi ``glance_api_servers`` dalam template ``cinder.conf``:
ko_kr: 이들을 실제 필요한 URL로 변환하는 데 도움이 되는 매크로는 ``helm-toolkit`` 차트에 정의되어 있습니다. 예를 들어, cinder 차트는 ``glance_api_servers`` 정의를 ``cinder.conf`` 템플릿에 정의합니다:

source: The ovs set of daemonsets are running on the node labeled `openvswitch=enabled`. This includes the compute and controller/network nodes. For more flexibility, OpenVSwitch as a tool was split out of Neutron chart, and put in separate chart dedicated OpenVSwitch. Neutron OVS agent remains in Neutron chart. Splitting out the OpenVSwitch creates possibilities to use it with different SDNs, adjusting the configuration accordingly.
de: Die ovs Daemonsets laufen auf dem Knoten `openvswitch = enabled`. Dies umfasst die Rechner- und Controller-/Netzwerkknoten. Für mehr Flexibilität wurde OpenVSwitch als ein Tool aus dem Neutron-Chart herausgenommen und in einen separaten Chart-dedizierten OpenVSwitch gesetzt. Neutron OVS Agent bleibt inm Neutron-Chart. Wenn Sie den OpenVSwitch aufteilen, können Sie ihn mit verschiedenen SDNs verwenden und die Konfiguration entsprechend anpassen.
id: Set ovs daemon berjalan di node berlabel `openvswitch = enabled`. Ini termasuk node komputasi dan controller/network. Untuk fleksibilitas lebih, OpenVSwitch sebagai alat dibagi dari chart Neutron, dan dimasukkan ke dalam chart terpisah yang didedikasikan OpenVSwitch. Agen OVS Neutron tetap dalam chart Neutron. Memisahkan OpenVSwitch menciptakan kemungkinan untuk menggunakannya dengan SDN berbeda, menyesuaikan konfigurasi yang sesuai.
ko_kr: 데몬세트의 ovs 세트는 `openvswitch=enabled`로 라벨된 노드에서 실행 중입니다. 이는 compute와 controller/network 노드를 포함합니다. 유연성을 높이기 위해서, OpenVSwitch를 도구로 사용하여 Neutron 차트를 분리하고 OpenVSwitch 전용의 별도 차트를 넣었습니다. Neutron OVS 에이전트는 Neutron 차트에 남아있습니다. OpenVSwitch를 분할하면 다른 SDN과 함께 사용할 수 있는 가능성이 생기기 때문에, 적절하게 구성을 조정합니다.

source: The project's core philosophy regarding images is that the toolsets required to enable the OpenStack services should be applied by Kubernetes itself. This requires OpenStack-Helm to develop common and simple scripts with minimal dependencies that can be overlaid on any image that meets the OpenStack core library requirements. The advantage of this is that the project can be image agnostic, allowing operators to use Stackanetes, Kolla, LOCI, or any image flavor and format they choose and they will all function the same.
de: Die Kernphilosophie des Projekts in Bezug auf Abbilder besteht darin, dass die für die Aktivierung der OpenStack-Services erforderlichen Toolsets von Kubernetes selbst angewendet werden sollten. Dies erfordert, dass OpenStack-Helm allgemeine und einfache Skripte mit minimalen Abhängigkeiten entwickelt, die jedem Abbild überlagert werden können, das die Anforderungen der OpenStack-Kernbibliothek erfüllt. Der Vorteil davon ist, dass das Projekt abbbildunabhängig sein kann und es den Betreibern ermöglicht, Stackanetes, Kolla, LOCI oder jedes andere Bildformat und -format zu verwenden, das sie wählen, und sie werden alle gleich funktionieren.
id: Filosofi inti proyek mengenai images adalah bahwa alat yang diperlukan untuk mengaktifkan layanan OpenStack harus diterapkan oleh Kubernetes itu sendiri. Hal ini membutuhkan OpenStack-Helm untuk mengembangkan skrip umum dan sederhana dengan dependensi minimal yang dapat dihamparkan (overlaid) pada images apa pun yang memenuhi persyaratan perpustakaan inti OpenStack. Keuntungan dari ini adalah bahwa proyek dapat menjadi agnostik image, yang memungkinkan operator untuk menggunakan Stackanetes, Kolla, LOCI, atau berbagai flavor dan format image yang mereka pilih dan semuanya akan berfungsi sama.
ko_kr: 이미지에 관한 프로젝트의 핵심 철학은 OpenStack 서비스를 활성화하는 데 필요한 도구모음이 Kubernetes 자체에서 적용되어야 한다는 것입니다. 이는 OpenStack-Helm에 OpenStack 핵심 라이브러리의 요구사항을 충족하는 이미지들에 중첩될 수 있는 최소한의 의존성으로 일반적이고 단순한 스크립트를 개발할 것을 요구합니다. 이것의 장점은 운영자들이 Stackanetes, Kolla, LOCI, 또는 그들이 선택하고 동일하게 기능할 이미지 flavor와 포맷을 사용하는 것을 허락하여 프로젝트가 이미지에서 자유로워지는 것입니다.

source: The project's goal is to provide a consistent mechanism for endpoints. OpenStack is a highly interconnected application, with various components requiring connectivity details to numerous services, including other OpenStack components and infrastructure elements such as databases, queues, and memcached infrastructure. The project's goal is to ensure that it can provide a consistent mechanism for defining these "endpoints" across all charts and provide the macros necessary to convert those definitions into usable endpoints. The charts should consistently default to building endpoints that assume the operator is leveraging all charts to build their OpenStack cloud. Endpoints should be configurable if an operator would like a chart to work with their existing infrastructure or run elements in different namespaces.
de: Ziel des Projekts ist es, einen konsistenten Mechanismus für Endpunkte bereitzustellen. OpenStack ist eine stark miteinander verbundene Anwendung, bei der verschiedene Komponenten Konnektivitätsdetails für zahlreiche Dienste benötigen, einschließlich anderer OpenStack-Komponenten und Infrastrukturelemente wie Datenbanken, Warteschlangen und Memcached-Infrastruktur. Ziel des Projekts ist es, sicherzustellen, dass es einen konsistenten Mechanismus für die Definition dieser "Endpunkte" in allen Charts bereitstellt und die erforderlichen Makros bereitstellt, um diese Definitionen in nutzbare Endpunkte umzuwandeln. Die Charts sollten konsistent standardmäßig Build-Endpunkte erstellen, die davon ausgehen, dass der Benutzer alle Charts nutzt, um seine OpenStack-Cloud zu erstellen. Endpunkte sollten konfigurierbar sein, wenn ein Operator ein Chart mit der vorhandenen Infrastruktur arbeiten oder Elemente in verschiedenen Namespaces ausführen möchte.
id: Tujuan proyek adalah menyediakan mekanisme yang konsisten untuk endpoints. OpenStack adalah aplikasi yang sangat saling berhubungan, dengan berbagai komponen yang membutuhkan rincian konektivitas ke berbagai layanan, termasuk komponen OpenStack dan elemen infrastruktur lainnya seperti database, antrian (queues), dan infrastruktur memcache. Tujuan proyek adalah untuk memastikan bahwa ia dapat memberikan mekanisme yang konsisten untuk mendefinisikan "endpoints" ini di semua charts dan menyediakan makro yang diperlukan untuk mengubah definisi tersebut menjadi endpoints yang dapat digunakan. Charts tersebut harus secara konsisten menjadi standar untuk membangun endpoints yang mengasumsikan operator memanfaatkan semua charts untuk membangun cloud OpenStack mereka. Endpoints harus dapat dikonfigurasi jika operator ingin bagan bekerja dengan infrastruktur yang ada atau menjalankan elemen di namespaces yang berbeda.
ko_kr: 프로젝트의 목표는 endpoints에 대한 일관된 매커니즘을 제공하는 것입니다. OpenStack은 다른 OpenStack 구성요소 와 데이터베이스, 큐, 그리고 memcached 인프라와 같은 인프라 요소를 포함하여 다양한 서비스에 대한 연결 세부 사항을 필요로 하는 다양한 구성요소와 고도로 상호 연결된 응용 프로그램입니다. 프로젝트의 목표는 모든 차트에서 이러한 "endpoints"를 정의하는 일관된 메커니즘을 제공하고 이러한 정의를 유용한 endpoints로 변환하는 데 필요한 매크로를 제공하는 것입니다. 차트는 운영자가 그들의 OpenStack 클라우드를 구축하기 위하여 모든 차트를 활용하고 있다고 가정하고 endpoints 구축을 일관되게 기본값으로 설정해야 합니다. 운영자가 차트를 그들의 기존 인프라와 함께 사용하기를 원하거나 다른 네임스페이스의 요소를 실행하려면 Endpoints를 구성 할 수 있어야 합니다.

source: The resulting logs can then be queried directly through Elasticsearch, or they can be viewed via Kibana. Kibana offers a dashboard that can create custom views on logged events, and Kibana integrates well with Elasticsearch by default.
de: Die resultierenden Protokolle können dann direkt über Elasticsearch abgefragt werden oder über Kibana eingesehen werden. Kibana bietet ein Dashboard, das benutzerdefinierte Ansichten für protokollierte Ereignisse erstellen kann, und Kibana integriert sich standardmäßig gut in Elasticsearch.
id: Log yang dihasilkan kemudian dapat ditanyakan secara langsung melalui Elasticsearch, atau mereka dapat dilihat melalui Kibana. Kibana menawarkan dasbor yang dapat membuat tampilan khusus pada acara yang dicatat, dan Kibana terintegrasi dengan baik dengan Elasticsearch secara default.
ko_kr: 로그의 결과는 Elasticsearch를 통해 직접 쿼리하거나 Kibana를 통해 볼 수 있습니다. Kibana는 기록된 이벤트에 대한 사용자 정의 뷰를 만들 수 있는 대시보드를 제공하며 Kibana는 기본적으로 Elasticsearch와 잘 통합됩니다.

source: There are situations where we need to define configuration differently for different nodes in the environment. For example, we may require that some nodes have a different vcpu_pin_set or other hardware specific deltas in nova.conf.
de: Es gibt Situationen, in denen wir die Konfiguration für verschiedene Knoten in der Umgebung unterschiedlich definieren müssen. Zum Beispiel können wir verlangen, dass einige Knoten ein anderes vcpu_pin_set oder andere hardwarespezifische Deltas in nova.conf haben.
id: Ada situasi di mana kita perlu mendefinisikan konfigurasi secara berbeda untuk berbagai node di lingkungan. Sebagai contoh, kami mungkin mengharuskan beberapa node memiliki vcpu_pin_set yang berbeda atau delta spesifik perangkat keras lainnya di nova.conf.
ko_kr: 환경의 각각의 노드들에 대해 구성을 다르게 정의해야 하는 상황이 있습니다. 예를 들어, 어떤 노드가 nova.conf 에서 다른 vcpu_pi_set 또는 다른 하드웨어 특정 delta를 갖도록 요구할 수 있습니다.

source: There is also a need for DHCP agent to pass ovs agent config file (in :code:`neutron/templates/bin/_neutron-dhcp-agent.sh.tpl`):
de: Es ist auch notwendig, dass der DHCP-Agent die Konfigurationsdatei des Agenten übergibt (in :code:`neutron/templates/bin/_neutron-dhcp-agent.sh.tpl`):
id: Ada juga kebutuhan untuk agen DHCP untuk melewati file konfigurasi agen ovs (in :code:`neutron/templates/bin/_neutron-dhcp-agent.sh.tpl`):
ko_kr: 또한 DHCP 에이전트가 ovs 에이전트 구성 파일을 전달할 필요가 있습니다(:code:`neutron/templates/bin/_neutron-dhcp-agent.sh.tpl` 내):

source: These quotas are configurable by modifying the ``minAvailable`` field within each PodDistruptionBudget manifest, which is conveniently mapped to a templated variable inside the ``values.yaml`` file. The ``min_available`` within each service's ``values.yaml`` file can be represented by either a whole number, such as ``1``, or a percentage, such as ``80%``. For example, when deploying 5 replicas of a pod (such as keystone-api), using ``min_available: 3`` would enforce policy to ensure at least 3 replicas were running, whereas using ``min_available: 80%`` would ensure that 4 replicas of that pod are running.
de: Diese Kontingente können konfiguriert werden, indem das Feld ``minAvailable`` in jedem PodDistrutionBudget-Manifest geändert wird. Dieses Manifest wird einer Tabellenvariablen in der ``values.yaml``-Datei zugeordnet. Die Datei ``min_available`` in der ``values.yaml``-Datei jedes Dienstes kann entweder durch eine ganze Zahl wie ``1`` oder einen Prozentsatz wie ``80%`` dargestellt werden. Wenn Sie zum Beispiel 5 Replikate eines Pods (z.B. Keystone-API) bereitstellen, würde die Verwendung von ``min_available: 3``` die Richtlinie erzwingen, um sicherzustellen, dass mindestens 3 Replikate ausgeführt werden, während die Verwendung von `min_available: 80%` sicherstellen würde dass 4 Replikate dieses Pods ausgeführt werden.
id: Kuota ini dapat dikonfigurasi dengan memodifikasi field ``minAvailable`` dalam setiap manifes PodDistruptionBudget, yang dengan mudah dipetakan ke variabel templated di dalam file ``values.yaml``. ``Min_available`` dalam file ``values.yaml`` masing-masing layanan dapat direpresentasikan dengan salah satu bilangan bulat, seperti ``1``, atau persentase, seperti ``80%``. Misalnya, ketika menerapkan 5 replika pod (seperti keystone-api), menggunakan ``min_available: 3`` akan menegakkan kebijakan untuk memastikan setidaknya 3 replika berjalan, sedangkan menggunakan ``min_available: 80%`` akan memastikan bahwa 4 replika pod tersebut sedang berjalan.
ko_kr: 이러한 할당량은 ``values.yaml`` 파일 내부의 템플릿 변수에 편리하게 매핑된 각 PodDistruptionBudget 매니페스트 내의 ``minAvailable`` 필드를 수정하여 구성할 수 있습니다. 각 서비스의 ``values.yaml`` 파일 내 ``min_available`` 는 ``1`` 과 같은 정수나 ``80%`` 와 같은 퍼센트로 표현될 수 있습니다. 예를 들어, 5개의 pod 복제본(keystone-api)을 배포할 때, ``mun_available: 3``을 사용하면 적어도 3개의 복제본의 실행을 보장하도록 정책을 강제하는 반면, ``min_available: 80%`` 을 사용하면 4개의 복제본의 실행을 보장할 수 있습니다.

source: These values define all the endpoints that the Neutron chart may need in order to build full URL compatible endpoints to various services. Long-term, these will also include database, memcached, and rabbitmq elements in one place. Essentially, all external connectivity can be defined centrally.
de: Diese Werte definieren alle Endpunkte, die das Neutron-Chart möglicherweise benötigt, um vollständige URL-kompatible Endpunkte für verschiedene Dienste zu erstellen. Langfristig werden diese auch Datenbank-, Memcached- und Rabbitmq-Elemente an einem Ort umfassen. Im Wesentlichen kann die gesamte externe Konnektivität zentral definiert werden.
ko_kr: 이 값들은 Neutron 차트가 다양한 서비스에 URL과 완전 호환되는 endpoints를 구축하는데 필요할 수 있는 모든 endpoints를 정의합니다. 장기적으로, 이들은 또한 데이터베이스, memcached, 그리고 rabbitmq 요소들을 한 곳에 포함할 것입니다. 근본적으로, 모든 외부 연결을 중앙에서 정의할 수 있습니다.

source: This daemonset includes the linuxbridge Neutron agent with bridge-utils and ebtables utilities installed. This is all that is needed, since linuxbridge uses native kernel libraries.
de: Dieses Daemonset enthält den Neutron-Agent linuxbridge mit den installierten Dienstprogrammen bridge-utils und ebtables. Dies ist alles was benötigt wird, da linuxbridge native Kernel-Bibliotheken verwendet.
id: Daemonset ini termasuk linuxbridge Neutron agent dengan utilitas bridge-utils dan ebtables yang diinstal. Ini semua yang diperlukan, karena linuxbridge menggunakan pustaka kernel native.
ko_kr: 이 daemonset은 bridge-utils와 ebtables 유틸리티가 설치된 linuxbridge Neutron 에이전트를 포함합니다.linuxbridge가 네이티브 커널 라이브러리를 사용하기 때문에 이 모든 것이 필요합니다.

source: This is accomplished with the following annotation:
de: Dies wird mit der folgenden Anmerkung erreicht:
id: Ini dilakukan dengan anotasi berikut:
ko_kr: 이는 다음 annotation으로 수행됩니다:

source: This option will allow to configure the Neutron services in proper way, by checking what is the actual backed set in :code:`neutron/values.yaml`.
de: Mit dieser Option können Sie die Neutron-Dienste auf die richtige Weise konfigurieren, indem Sie überprüfen, was das tatsächlich hinterlegte Set ist :code:`neutron/values.yaml`.
id: Pilihan ini akan memungkinkan untuk mengkonfigurasi layanan Neutron dengan cara yang tepat, dengan memeriksa apa yang sebenarnya didukung di set dalam :code:`neutron/values.yaml`.
ko_kr: 이 옵션은 :code:`neutron/values.yaml`의 실제 backend set이 무엇인지 확인하여, Neuron 서비스를 적절한 방법으로 구성할 수 있도록 허락할 것입니다.
