Repository: openstack/openstack-helm
Catalog: doc/source/locale/*/LC_MESSAGES/doc-install.po
Languages: id

source: **First**, edit the ``values.yaml`` for Neutron, Glance, Horizon, Keystone, and Nova.
id: **First**, edit ``values.yaml`` untuk Neutron, Glance, Horizon, Keystone, dan Nova.

source: **Second** option would be as ``--set`` flags when calling ``helm install``
id: Pilihan **Second** akan menjadi ``--set`` flags saat memanggil ``helm install``

source: **TaaS Agent, TaaS OVS Driver and TaaS SR-IOV Driver**: This forms the back-end of TaaS which runs as a ML2 agent extension on compute nodes. It handles the RPC calls made by TaaS Plugin and configures the mechanism driver, i.e. OpenVSwitch or SR-IOV Nic Switch.
id: **TaaS Agent, TaaS OVS Driver and TaaS SR-IOV Driver**: Ini membentuk back-end TaaS yang berjalan sebagai ekstensi agen ML2 pada node komputasi. Ini menangani panggilan RPC yang dibuat oleh TaaS Plugin dan mengkonfigurasi driver mekanisme, misal OpenVSwitch atau SR-IOV Nic Switch.

source: **TaaS Dashboard Plugin**: Horizon Plugin which adds GUI panels for TaaS resources in the Horizon Dashboard.
id: **TaaS Dashboard Plugin**: Horizon Plugin yang menambahkan panel GUI untuk sumber daya TaaS di Horizon Dashboard.

source: **TaaS Plugin**: This is the front-end of TaaS which runs on controller node (Neutron server). This serves TaaS APIs and stores/retrieves TaaS configuration state to/from Neutron TaaS DB.
id: **TaaS Plugin**: Ini adalah front-end dari TaaS yang berjalan pada node pengontrol (server Neutron). Ini melayani TaaS API dan menyimpan/mengambil status konfigurasi TaaS ke/dari Neutron TaaS DB.

source: 16GB of RAM
id: RAM 16GB

source: 8GB of RAM
id: RAM 8GB

source: A correct DPDK configuration depends heavily on the specific hardware resources and its configuration. Before deploying Openvswitch with DPDK, check the amount and type of available hugepages on the host OS.
id: Konfigurasi DPDK yang benar sangat bergantung pada sumber daya perangkat keras spesifik dan konfigurasinya. Sebelum menggunakan Openvswitch dengan DPDK, periksa jumlah dan jenis hugepage yang tersedia di OS host.

source: Activate the OpenStack namespace to be able to use Ceph
id: Aktifkan namespace OpenStack untuk dapat menggunakan Ceph

source: Activate the openstack namespace to be able to use Ceph
id: Aktifkan namespace openstack untuk dapat menggunakan Ceph

source: Add TaaS Dashboard dependency in ``requirements.txt`` file in ``openstack/horizon`` repo, i.e. https://opendev.org/openstack/horizon
id: Tambahkan dependensi TaaS Dashboard dalam file ``requirement.txt`` di ``repo openstack/horizon``, yaitu https://opendev.org/openstack/horizon

source: Add TaaS and TaaS dashboard dependencies in :code:`upper-constraints.txt` file in :code:`openstack/requirements` repo, i.e. https://opendev.org/openstack/requirements
id: Tambahkan TaaS dan dependensi dashboard TaaS dalam file :code:`upper-constraints.txt` dalam :code:`openstack/requirements` repo, i.e. https://opendev.org/openstack/requirements

source: Add TaaS dependency in ``requirements.txt`` file in ``openstack/neutron`` repo, i.e. https://opendev.org/openstack/neutron
id: Tambahkan dependensi TaaS dalam file ``requirement.txt`` di repo ``openstack/neutron``, yaitu https://opendev.org/openstack/neutron

source: Add TaaS panel to Horizon Dashboard:
id: Tambahkan panel TaaS ke Horizon Dashboard:

source: Add the address of the Kubernetes API, ``172.17.0.1``, and ``.svc.cluster.local`` to your ``no_proxy`` and ``NO_PROXY`` environment variables.
id: Tambahkan alamat API Kubernetes, ``172,17,0,1``, dan ``.svc.cluster.local`` ke variabel lingkungan ``no_proxy`` dan ``NO_PROXY`` Anda.

source: Add to the Install steps these flags - also adding a shell environment variable to save on repeat code.
id: Tambahkan ke langkah Instal flags ini - juga menambahkan variabel lingkungan shell untuk menghemat kode ulang.

source: Adding a DPDK port to Openvswitch fails
id: Menambahkan port DPDK ke Openvswitch gagal

source: Additional configuration variables can be found `here <https://github.com/openstack/openstack-helm-infra/blob/master/roles/deploy-kubeadm-aio-common/defaults/main.yml>`_. In particular, ``kubernetes_cluster_pod_subnet`` can be used to override the pod subnet set up by Calico (the default container SDN), if you have a preexisting network that conflicts with the default pod subnet of 192.168.0.0/16.
id: Variabel konfigurasi tambahan dapat ditemukan `here <https://github.com/openstack/openstack-helm-infra/blob/master/roles/deploy-kubeadm-aio-common/defaults/main.yml>`_. Khususnya, ``kubernetes_cluster_pod_subnet`` dapat digunakan untuk mengganti subnet pod yang diatur oleh Calico (kontainer default SDN), jika Anda memiliki jaringan yang sudah ada sebelumnya yang bertentangan (conflict) dengan subnet pod default 192.168.0.0/16.

source: Additional information on Kubernetes Ceph-based integration can be found in the documentation for the `CephFS <https://github.com/kubernetes-incubator/external-storage/blob/master/ceph/cephfs/README.md>`_ and `RBD <https://github.com/kubernetes-incubator/external-storage/blob/master/ceph/rbd/README.md>`_ storage provisioners, as well as for the alternative `NFS <https://github.com/kubernetes-incubator/external-storage/blob/master/nfs/README.md>`_ provisioner.
id: Additional information on Kubernetes Ceph-based integration can be found in the documentation for the `CephFS <https://github.com/kubernetes-incubator/external-storage/blob/master/ceph/cephfs/README.md>`_ dan `RBD <https://github.com/kubernetes-incubator/external-storage/blob/master/ceph/rbd/README.md>` _ storage provisioners, serta untuk alternatif `NFS <https: // github.com/kubernetes-incubator/external-storage/blob/master/nfs/README.md>`_ provisioner.

source: Additionally, the default configuration of the neutron chart must be adapted according to the underlying hardware. The corresponding configuration parameter is labeled with "CHANGE-ME" in the script "values_overrides/dpdk.yaml". Specifically, the "ovs_dpdk" configuration section should list all NICs which should be bound to DPDK with their corresponding PCI-IDs. Moreover, the name of each NIC needs to be unique, e.g., dpdk0, dpdk1, etc.
id: Selain itu, konfigurasi default grafik neutron harus disesuaikan sesuai dengan perangkat keras yang mendasarinya. Parameter konfigurasi yang sesuai diberi label dengan "CHANGE-ME" dalam skrip "values_overrides/dpdk.yaml". Khususnya, bagian konfigurasi "ovs_dpdk" harus mencantumkan semua NIC yang harus terikat ke DPDK dengan PCI-ID yang sesuai. Selain itu, nama setiap NIC harus unik, mis., dpdk0, dpdk1, dll.

source: After making the configuration changes, run a ``make`` and then install as you would from AIO or MultiNode instructions.
id: Setelah membuat perubahan konfigurasi, jalankan ``make`` dan kemudian instal seperti yang Anda lakukan dari instruksi AIO atau MultiNode.

source: All commands below should be run as a normal user, not as root. Appropriate versions of Docker, Kubernetes, and Helm will be installed by the playbooks used below, so there's no need to install them ahead of time.
id: Semua perintah di bawah ini harus dijalankan sebagai pengguna biasa, bukan sebagai root. Versi Docker, Kubernetes, dan Helm yang sesuai akan dipasang oleh playbook yang digunakan di bawah ini, jadi tidak perlu menginstalnya terlebih dahulu.

source: Alternatively, these steps can be performed by running the script directly::
id: Atau, langkah-langkah ini dapat dilakukan dengan menjalankan skrip secara langsung ::

source: Alternatively, this step can be performed by running the script directly:
id: Alternatifnya, langkah ini dapat dilakukan dengan menjalankan skrip secara langsung:

source: An Ingress is a collection of rules that allow inbound connections to reach the cluster services.
id: Ingress adalah kumpulan aturan yang memungkinkan koneksi masuk untuk menjangkau layanan kluster.

source: Apart from the variables above with gerrit refspec values, additionally export following environment variables with values as applicable:
id: Terlepas dari variabel di atas dengan nilai gerrit refspec, ekspor tambahan variabel lingkungan berikut dengan nilai yang berlaku:

source: As a final validation step, re-run the **openstack helm stack list** and **openstack helm keypair list** commands and confirm the returned results are shown as empty.::
id: Sebagai langkah validasi terakhir, jalankan kembali **openstack helm stack list** dan **openstack helm keypair list** perintah dan konfirmasi hasil yang dikembalikan ditampilkan sebagai kosong.::

source: As any other Neutron plugin, TaaS neutron plugin functionality consists of following modules:
id: Seperti plugin Neutron lainnya, fungsionalitas plugin neutron TaaS terdiri dari modul berikut:

source: Before deploying TaaS and/or TaaS Dashboard, it needs to be added in Neutron and/or Horizon LOCI images.
id: Sebelum menggunakan TaaS dan/atau TaaS Dashboard, perlu ditambahkan dalam image Neutron dan/atau Horizon LOCI.

source: Below are some instructions and suggestions to help you get started with a Kubeadm All-in-One environment on Ubuntu 18.04. Other supported versions of Linux can also be used, with the appropriate changes to package installation.
id: Di bawah ini adalah beberapa petunjuk dan saran untuk membantu Anda memulai dengan lingkungan Kubeadm All-in-One di Ubuntu 18.04. Versi Linux yang didukung lainnya juga dapat digunakan, dengan perubahan yang sesuai untuk instalasi paket.

source: Build the requirements LOCI image using above commit
id: Buat persyaratan image LOCI menggunakan komit di atas

source: By default OSH will use Google DNS Server IPs (8.8.8.8, 8.8.4.4) and will update resolv.conf as a result. If those IPs are blocked by your proxy, running the OSH scripts will result in the inability to connect to anything on the network. These DNS nameserver entries can be changed by updating the external_dns_nameservers entry in the file ``openstack-helm-infra/tools/images/kubeadm-aio/assets/opt/playbooks/vars.yaml``.
id: Secara default, OSH akan menggunakan IP Server DNS Google (8.8.8.8, 8.8.4.4) dan sebagai hasilnya akan memperbarui resolv.conf. Jika IP tersebut diblokir oleh proxy Anda, menjalankan skrip OSH akan mengakibatkan ketidakmampuan untuk terhubung ke apa pun di jaringan. Entri nameserver DNS ini dapat diubah dengan memperbarui entri external_dns_nameservers dalam file ``openstack-helm-infra/tools/images/kubeadm-aio/assets/opt/playbooks/vars.yaml``.

source: By default the Calico CNI will use ``192.168.0.0/16`` and Kubernetes services will use ``10.96.0.0/16`` as the CIDR for services. Check that these CIDRs are not in use on the development node before proceeding, or adjust as required.
id: Secara default, Calico CNI akan menggunakan layanan ``192.168.0.0/16`` dan Kubernetes akan menggunakan ``10.96.0.0/16`` sebagai CIDR untuk layanan. Periksa apakah CIDR ini tidak digunakan pada node pengembangan sebelum melanjutkan, atau sesuaikan sesuai kebutuhan.

source: By default, this installation will use Google DNS Server IPs (8.8.8.8, 8.8.4.4) and will update resolv.conf as a result. If those IPs are blocked by the proxy, this will overwrite the original DNS entries and result in the inability to connect to anything on the network behind the proxy. These DNS nameserver entries can be changed by updating the ``external_dns_nameservers`` entry in this file:
id: Secara default, instalasi ini akan menggunakan IP Server DNS Google (8.8.8.8, 8.8.4.4) dan sebagai hasilnya akan memperbarui resolv.conf. Jika IP tersebut diblokir oleh proxy, ini akan menimpa entri DNS asli dan mengakibatkan ketidakmampuan untuk terhubung ke apa pun di jaringan di belakang proxy. Entri nameserver DNS ini dapat diubah dengan memperbarui entri ``external_dns_nameservers`` dalam file ini:

source: Cinder deployment is not tested in the OSH development environment community gates
id: Cinder deployment tidak diuji di gate komunitas lingkungan pengembangan OSH

source: Cleaning the Deployment
id: Membersihkan Deployment

source: Clone the OpenStack-Helm Repos
id: Mengkloning OpenStack-Helm Repos

source: Code examples below.
id: Contoh kode di bawah ini.

source: Common Deployment Requirements
id: Persyaratan Penerapan Umum

source: Configure OpenStack
id: Konfigurasikan OpenStack

source: Configure TaaS in Neutron chart
id: Konfigurasikan TaaS dalam chart Neutron

source: Configuring OpenStack for a particular production use-case is beyond the scope of this guide. Please refer to the OpenStack `Configuration <https://docs.openstack.org/latest/configuration/>`_ documentation for your selected version of OpenStack to determine what additional values overrides should be provided to the OpenStack-Helm charts to ensure appropriate networking, security, etc. is in place.
id: Mengonfigurasi OpenStack untuk kasus penggunaan produksi tertentu berada di luar ruang lingkup panduan ini. Silakan merujuk ke OpenStack `Configuration <https://docs.openstack.org/latest/configuration/>`_ dokumentasi untuk versi OpenStack pilihan Anda untuk menentukan apa penggantian nilai tambahan harus diberikan ke chart OpenStack-Helm untuk memastikan jaringan yang sesuai, keamanan, dll. sudah ada.

source: Contents:
id: Isi:

source: Copy the key: ``sudo cp ~/.ssh/id_rsa /etc/openstack-helm/deploy-key.pem``
id: Salin kunci: ``sudo cp ~/.ssh/id_rsa /etc/openstack-helm/deploy-key.pem``

source: Create a patchset for ``openstack/horizon`` repo
id: Buat patchset untuk repo ``openstack/horizon``

source: Create a patchset for ``openstack/neutron`` repo
id: Buat patchset untuk repo ``openstack/neutron``

source: Create a patchset for ``openstack/requirements`` repo
id: Buat patchset untuk repo ``openstack/requirements``

source: Create an environment file
id: Buat file lingkungan

source: Create an inventory file
id: Buat file inventaris

source: Create an ssh-key on the master node, and add the public key to each node that you intend to join the cluster.
id: Buat ssh-key pada node master, dan tambahkan kunci publik ke setiap node yang Anda inginkan untuk bergabung dengan cluster.

source: Create loopback devices for CEPH
id: Buat perangkat loopback untuk CEPH

source: Create two loopback devices for ceph as one disk for OSD data and other disk for block DB and block WAL. If loop0 and loop1 devices are busy in your case , feel free to change them in parameters by using --ceph-osd-data and --ceph-osd-dbwal options.
id: Buat dua perangkat loopback untuk ceph sebagai satu disk untuk data OSD dan disk lain untuk blok DB dan blok WAL. Jika perangkat loop0 dan loop1 sibuk dalam kasus Anda, jangan ragu untuk mengubahnya dalam parameter dengan menggunakan opsi --ceph-osd-data dan --ceph-osd-dbwal.

source: Default log level for Neutron TaaS is :code:`INFO`. For changing it, override following parameter:
id: Tingkat log default untuk Neutron TaaS adalah :code:`INFO`. Untuk mengubahnya, ganti parameter berikut:

source: Delete the keypair(s) returned from the list command above::
id: Hapus keypair(s) yang dikembalikan dari perintah daftar di atas::

source: Delete the stacks returned from the *openstack helm stack list* command above::
id: Hapus stacks yang dikembalikan dari *openstack helm stack list* perintah di atas ::

source: Depending on your specific proxy, https_proxy may be the same as http_proxy. Refer to your specific proxy documentation.
id: Bergantung pada proksi spesifik Anda, https_proxy mungkin sama dengan http_proxy. Rujuk ke dokumentasi proxy spesifik Anda.

source: Deploy Barbican
id: Terapkan Barbican

source: Deploy Ceph
id: Terapkan Ceph

source: Deploy Cinder
id: Terapkan Cinder

source: Deploy Compute Kit (Nova and Neutron)
id: Menyebarkan Compute Kit (Nova dan Neutron)

source: Deploy Glance
id: Terapkan Glance

source: Deploy Heat
id: Terapkan Heat

source: Deploy Horizon
id: Terapkan Horizon

source: Deploy Keystone
id: Terapkan Keystone

source: Deploy Kubernetes & Helm
id: Menyebarkan Kubernetes & Helm

source: Deploy Libvirt
id: Terapkan Libvirt

source: Deploy MariaDB
id: Terapkan MariaDB

source: Deploy Memcached
id: Terapkan Memcached

source: Deploy NFS Provisioner
id: Menerapkan NFS Provisioner

source: Deploy OVS-DPDK
id: Menyebarkan OVS-DPDK

source: Deploy OpenStack-Helm
id: Gunakan OpenStack-Helm

source: Deploy OpenvSwitch
id: Terapkan OpenvSwitch

source: Deploy RabbitMQ
id: Terapkan RabbitMQ

source: Deploy Rados Gateway for object store
id: Menerapkan Rados Gateway untuk menyimpan objek

source: Deploy tap-as-a-service (TaaS) Neutron / Dashboard plugin
id: Penyebaran plugin Tap-as-a-service (TaaS) Neutron/Dashboard

source: Deploy the ingress controller
id: Pasang ingress controller

source: Deployment
id: Penyebaran

source: Deployment With Ceph
id: Deployment Dengan Ceph

source: Deployment With NFS
id: Deployment Dengan NFS

source: Deployment with Tungsten Fabric
id: Penerapan dengan Tungsten Fabric

source: Development
id: Pengembangan

source: Environment tear-down
id: Environment tear-down (lingkungan meruntuhkan)

source: Essentially the use of Ingress for OpenStack-Helm is an Nginx proxy service. Ingress (Nginx) is accessible by your cluster public IP - e.g. the IP associated with ``kubectl get pods -o wide --all-namespaces | grep ingress-api`` Ingress/Nginx will be listening for server name requests of "keystone" or "keystone.openstack" and will route those requests to the proper internal K8s Services. These public listeners in Ingress must match the external DNS that you will set up to access your OpenStack deployment. Note each rule also has a Service that directs Ingress Controllers allow access to the endpoints from within the cluster.
id: Pada dasarnya penggunaan Ingress for OpenStack-Helm adalah layanan proxy Nginx. Ingress (Nginx) dapat diakses oleh IP publik kluster Anda - mis. IP yang terkait dengan ``kubectl get pods -o wide --all-namespaces | grep ingress-api`` Ingress/Nginx akan mendengarkan permintaan nama server "keystone" atau "keystone.openstack" dan akan mengarahkan permintaan tersebut ke K8s Services internal yang tepat. Pendengar publik di Ingress harus sesuai dengan DNS eksternal yang akan Anda siapkan untuk mengakses penyebaran OpenStack Anda. Perhatikan setiap aturan (rule) juga memiliki Service yang mengarahkan Ingress Controllers memungkinkan akses ke endpoints dari dalam kluster.

source: Examples
id: Contoh

source: Execution of the **900-use-it.sh** script results in the creation of 4 heat stacks and a unique keypair enabling access to a newly created VM. Subsequent runs of the **900-use-it.sh** script requires deletion of the stacks, a keypair, and key files, generated during the initial script execution.
id: Eksekusi skrip ** 900-use-it.sh ** menghasilkan penciptaan 4 heat stacks dan keypair unik yang memungkinkan akses ke VM yang baru dibuat. Proses selanjutnya dari skrip **900-use-it.sh ** memerlukan penghapusan stacks, keypair, dan key files, yang dihasilkan selama eksekusi skrip awal.

source: Exercise the Cloud
id: Latihlah Cloud

source: External DNS and FQDN
id: External DNS dan FQDN

source: External DNS to FQDN/Ingress
id: External DNS ke FQDN/Ingress

source: First you have to set up OpenStack and Linux versions and install needed packages
id: Pertama, Anda harus mengatur versi OpenStack dan Linux dan menginstal paket yang diperlukan

source: For ``identity`` and ``dashboard`` at ``host_fdqn_override.public`` replace ``null`` with the value as ``keystone.os.foo.org`` and ``horizon.os.foo.org``
id: Untuk ``identity`` dan ``dashboard`` pada ``host_fdqn_override.public`` menggantikan ``null`` dengan nilai sebagai ``keystone.os.foo.org`` dan ``horizon.os.foo.org``

source: For a deployment without cinder and horizon the system requirements are:
id: Untuk penyebaran tanpa cinder dan horizon, persyaratan sistem adalah:

source: For a lab or proof-of-concept environment, the OpenStack-Helm gate scripts can be used to quickly deploy a multinode Kubernetes cluster using KubeADM and Ansible. Please refer to the deployment guide `here <./kubernetes-gate.html>`__.
id: Untuk lingkungan lab atau proof-of-concept, skrip gerbang OpenStack-Helm dapat digunakan untuk dengan cepat menyebarkan kluster Kombetes multinode menggunakan KubeADM dan Ansible. Silakan lihat panduan penerapan `here <./kubernetes-gate.html>`__.

source: For example if gerrit refspec for this commit is "refs/changes/xx/xxxxxx/x", so export the :code:`REQUIREMENTS_REF_SPEC` variable as follows:
id: Misalnya jika gerrit refspec untuk commit ini adalah "refs/changes/xx/xxxxxx/x", jadi ekspor variabel :code:`REQUIREMENTS_REF_SPEC` sebagai berikut:

source: For example if gerrit refspec for this commit is "refs/changes/xx/xxxxxx/x"; so export the :code:`HORIZON_REF_SPEC` variable as follows:
id: Sebagai contoh jika gerrit refspec untuk komit ini adalah "refs/changes/xx/xxxxxx/x"; jadi ekspor variabel :code:`HORIZON_REF_SPEC` sebagai berikut:

source: For example if gerrit refspec for this commit is "refs/changes/xx/xxxxxx/x"; so export the :code:`NEUTRON_REF_SPEC` variable as follows:
id: Sebagai contoh jika gerrit refspec untuk komit ini adalah "ref / perubahan / xx / xxxxxx / x"; jadi ekspor variabel :code:`NEUTRON_REF_SPEC` sebagai berikut:

source: For more details, refer to TaaS specification: Tap-as-a-service_.
id: Untuk lebih jelasnya, lihat spesifikasi TaaS: Tap-as-a-service_.

source: For other deployment options, select appropriate ``Deployment with ...`` option from `Index <../developer/index.html>`__ page.
id: Untuk opsi penerapan lainnya, pilih opsi ``Deployment with ...`` dari halaman `Index <../developer/index.html>`__ .

source: Get the Nginx configuration from the Ingress Pod:
id: Dapatkan konfigurasi Nginx dari Ingress Pod:

source: Get the ``helm status`` of your chart.
id: Dapatkan ``helm status`` dari chart Anda.

source: Helm Chart Installation
id: Pemasangan Helm Chart

source: Horizon deployment is not tested in the OSH development environment community gates
id: Penyebaran Horizon tidak diuji di gate komunitas lingkungan pengembangan OSH

source: Host Configuration
id: Konfigurasi Host

source: Host Proxy & DNS Configuration
id: Host Proxy dan Konfigurasi DNS

source: If OVS fails to start up because of no hugepages are available, check the configuration of the OVS daemonset. Older versions of helm-toolkit were not able to render hugepage configuration into the Kubernetes manifest and just removed the hugepage attributes. If no hugepage configuration is defined for the OVS daemonset, consider using a newer version of helm-toolkit.
id: Jika OVS gagal untuk memulai karena tidak ada hugepage yang tersedia, periksa konfigurasi daemonset OVS. Versi helm-toolkit yang lebih lama tidak dapat merender konfigurasi hugepage ke manifes Kubernetes dan hanya menghapus atribut hugepage. Jika tidak ada konfigurasi hugepage yang ditentukan untuk daemonset OVS, pertimbangkan untuk menggunakan versi helm-toolkit yang lebih baru.

source: If doing an `AIO install <https://docs.openstack.org/openstack-helm/latest/install/developer/index.html>`__, all the ``--set`` flags
id: Jika melakukan suatu `AIO install <https://docs.openstack.org/openstack-helm/latest/install/developer/index.html>`__, semua flags ``--set``

source: If you are not deploying OSH behind a proxy, skip this step and continue with "Deploy Kubernetes & Helm".
id: Jika Anda tidak menggunakan OSH di belakang proxy, lewati langkah ini dan lanjutkan dengan "Deploy Kubernetes & Helm".

source: If you are not deploying OSH behind a proxy, skip this step.
id: Jika Anda tidak menggunakan OSH di belakang proxy, lewati langkah ini.
