Repository: openstack/openstack-helm
Catalog: doc/source/locale/*/LC_MESSAGES/doc-devref.po
Languages: de, id, ko_kr

source: This requirement is OVS specific, the `ovsdb_connection` string is defined in `openvswitch_agent.ini` file, specifying how DHCP agent can connect to ovs. When using other SDNs, running the DHCP agent may not be required. When the SDN solution is addressing the IP assignments in another way, neutron's DHCP agent should be disabled.
de: Diese Anforderung ist OVS-spezifisch, die Zeichenfolge ``ovsdb_connection`` ist in der Datei ``openvswitch_agent.ini`` definiert und gibt an, wie der DHCP-Agent eine Verbindung zu ovs herstellen kann. Bei Verwendung anderer SDNs ist die Ausführung des DHCP-Agenten möglicherweise nicht erforderlich. Wenn die SDN-Lösung die IP-Zuweisungen auf andere Weise anspricht, sollte der DHCP-Agent von Neutron deaktiviert werden.
id: Persyaratan ini khusus OVS, string `ovsdb_connection` didefinisikan dalam file `openvswitch_agent.ini`, menentukan bagaimana agen DHCP dapat terhubung ke ov. Saat menggunakan SDN lain, menjalankan agen DHCP mungkin tidak diperlukan. Ketika solusi SDN menangani IP assignments dengan cara lain, agen DHCP neutron harus dinonaktifkan.
ko_kr: 이 요구사항은 OVS 특정이며, `ovsdb_connection` 문자열은 DHCP 에이전트가 어떻게 ovs에 연결할 수 있는지 명세하는 `openvswitch_agent.ini` 파일에 정의됩니다. 다른 SDN을 사용할 때, DHCP 에이전트 실행은 요구되지 않을 것입니다. SDN 솔루션이 다른 방식으로 IP 할당을 지정할 때, neutron의 DHCP 에이전트를 비활성화해야 합니다.

source: This runs the OVS tool and database. OpenVSwitch chart is not Neutron specific, it may be used with other technologies that are leveraging the OVS technology, such as OVN or ODL.
de: Dies führt das OVS-Tool und die Datenbank aus. OpenVSwitch-Chart ist nicht Neutron-spezifisch, es kann mit anderen Technologien verwendet werden, die die OVS-Technologie nutzen, wie OVN oder ODL.
id: Ini menjalankan OVS tool dan database. Chart OpenVSwitch tidak spesifik Neutron, ia dapat digunakan dengan teknologi lain yang memanfaatkan teknologi OVS, seperti OVN atau ODL.
ko_kr: 이것은 OVS 툴과 데이터베이스를 실행합니다. OpenVSwitch 차트는 특정 Neutron이 아니라, OVN이나 ODL과 같은 OVS 기술을 활용하는 다른 기술들에 사용될 것입니다.

source: This will be consumed by the templated ``configmap-etc.yaml`` manifest to produce the following config file:
de: Dies wird vom Manifest ``configmap-etc.yaml`` konsumiert, um die folgende Konfigurationsdatei zu erzeugen:
id: Ini akan digunakan oleh manifasi ``configmap-etc.yaml`` manifes untuk menghasilkan file konfigurasi berikut:
ko_kr: 이것은 템플릿화 된 ``configmap-etc.yaml`` 매니페스트에 의해 다음의 구성 파일을 생산하기 위해 소비될 것입니다:

source: To be able to configure multiple networking plugins inside of OpenStack-Helm, a new configuration option is added:
de: Um mehrere Netzwerk-Plugins innerhalb von OpenStack-Helm konfigurieren zu können, wurde eine neue Konfigurationsoption hinzugefügt:
id: Untuk dapat mengkonfigurasi beberapa plugin jaringan di dalam OpenStack-Helm, opsi konfigurasi baru ditambahkan:
ko_kr: OpenStack-Helm 내 다중 네트워킹 플러그인을 구성하는 것을 가능하게 하기 위해서, 새로운 구성 옵션이 추가되었습니다:

source: To do this, we can specify overrides in the values fed to the chart. Ex:
de: Um dies zu tun, können wir Überschreibungen in den Werten angeben, die dem Chart zugeführt werden. Ex:
id: Untuk melakukan ini, kita dapat spesifik menimpa nilai yang diumpankan ke chart. Ex:
ko_kr: 이를 위해, 차트에 입력된 값의 오버라이드를 명시할 수 있습니다. 예시:

source: To enable new SDN solution, there should be separate chart created, which would handle the deployment of service, setting up the database and any related networking functionality that SDN is providing.
de: Um die neue SDN-Lösung zu aktivieren, sollte ein separates Chart erstellt werden, das die Bereitstellung des Dienstes, die Einrichtung der Datenbank und alle zugehörigen Netzwerkfunktionen, die SDN bereitstellt, übernimmt.
id: Untuk mengaktifkan solusi SDN baru, harus ada bagan terpisah yang dibuat, yang akan menangani penyebaran layanan, pengaturan database dan fungsi jaringan terkait yang disediakan SDN.
ko_kr: 새로운 SDN 솔루션을 가능하게 하기 위해 서비스 배포, 데이터베이스 설정, 그리고 SDN이 제공하고 있는 관련된 모든 네트워크 기능을 처리하는 별도의 차트가 생성되어 있어야 합니다.

source: To that end, all charts provide an ``images:`` section that allows operators to override images. Also, all default image references should be fully spelled out, even those hosted by Docker or Quay. Further, no default image reference should use ``:latest`` but rather should be pinned to a specific version to ensure consistent behavior for deployments over time.
de: Zu diesem Zweck enthalten alle Charts einen Abschnitt ``images:``, mit dem Operatoren Abbilder überschreiben können. Außerdem sollten alle Standard-Abbildreferenzen vollständig angegeben werden, selbst wenn sie von Docker oder Quay gehostet werden. Darüber hinaus sollte keine Standardabbildreferenz ``:latest`` verwenden, sondern sollte an eine bestimmte Version angeheftet werden, um ein konsistentes Verhalten für Bereitstellungen im Zeitverlauf sicherzustellen.
id: Untuk itu, semua charts menyediakan bagian ``images:``yang memungkinkan operator untuk mengganti image. Juga, semua referensi image default harus sepenuhnya tereja (spelled out), bahkan yang dihosting oleh Docker atau Quay. Lebih lanjut, tidak ada referensi image default yang harus menggunakan ``:latest`` tetapi sebaiknya disematkan (pinned) ke versi tertentu untuk memastikan perilaku yang konsisten untuk penerapan dari waktu ke waktu.
ko_kr: 이를 위해, 모든 차트는 운영자들이 이미지를 오버라이드할 수 있는 ``images`` 섹션을 제공합니다. 또한, 모든 기본 이미지 참조는 Docker 또는 Quay에 의해 호스팅되었더라도 완전히 작성되어야 합니다. 나아가, 어떤 기본 이미지 참조도 ``:latest` 를 사용하면 안되지만, 대신에 배포 후에 일관된 동작을 보장하는 특정 버전으로 고정되어야 합니다.

source: To use other Neutron reference architecture types of SDN, these options should be configured in :code:`neutron.conf`:
de: Um andere Neutron-Referenzarchitekturtypen von SDN zu verwenden, sollten diese Optionen in folgendem Code konfiguriert werden :code:`neutron.conf`:
id: Untuk menggunakan jenis arsitektur referensi Neutron lainnya dari SDN, opsi ini harus dikonfigurasi :code:`neutron.conf`:
ko_kr: 다른 Neutron 참조 구조 타입의 SDN을 사용하려면, 이러한 옵션을 neutron.conf에서 구성해야 합니다:

source: Today, the ``images:`` section has several common conventions. Most OpenStack services require a database initialization function, a database synchronization function, and a series of steps for Keystone registration and integration. Each component may also have a specific image that composes an OpenStack service. The images may or may not differ, but regardless, should all be defined in ``images``.
de: Heute hat der Abschnitt ``images:`` einige allgemeine Konventionen. Die meisten OpenStack-Dienste erfordern eine Datenbankinitialisierungsfunktion, eine Datenbanksynchronisierungsfunktion und eine Reihe von Schritten für die Keystone-Registrierung und -Integration. Jede Komponente kann auch ein bestimmtes Abbild haben, aus dem ein OpenStack-Service besteht. Die Abbilder können sich unterscheiden oder nicht, aber unabhängig davon sollten alle in ``images`` definiert sein.
id: Hari ini, bagian ``images:`` memiliki beberapa konvensi umum. Sebagian besar layanan OpenStack memerlukan fungsi inisialisasi basis data, fungsi sinkronisasi basis data, dan serangkaian langkah untuk pendaftaran dan integrasi Keystone. Setiap komponen juga dapat memiliki image khusus yang membentuk layanan OpenStack. Images mungkin atau mungkin tidak berbeda, tetapi bagaimanapun, semua harus didefinisikan dalam ``images``.
ko_kr: 현재, ``images:`` 섹션에는 몇가지 규칙이 있습니다. 대부분의 OpenStack 서비스는 데이터베이스 초기화 기능, 데이터베이스 동기화 기능, 그리고 Keystone 등록과 통합을 위한 단계를 요구합니다. 각 구성요소에는 OpenStack 서비스를 구성하는 특정 이미지가 있을 수도 있습니다. 이미지는 다를 수 있지만, 이에 관계없이 모두 ``images``에 정의되어야 합니다.

source: Typical networking API request is an operation of create/update/delete:
de: Eine typische Netzwerk-API-Anfrage ist eine Operation von create / update / delete:
id: Permintaan API jaringan tipikal adalah operasi dari create/update/delete:
ko_kr: 일반적인 네트워킹 API 요청은 생성/갱신/삭제 작업입니다:

source: Upgrades and Reconfiguration
de: Upgrades und Neukonfigurationen
id: Upgrades dan Konfigurasi Ulang
ko_kr: 업그레이드 및 재구성

source: Whenever we change the L2 agent, it should be reflected in `nova/values.yaml` in dependency resolution for nova-compute.
de: Immer wenn wir den L2-Agenten ändern, sollte er in der `nova/values.yaml` in der Abhängigkeitsauflösung für nova-compute widergespiegelt werden.
id: Setiap kali kita mengubah agen L2, itu harus tercermin dalam `nova/values.yaml` dalam resolusi ketergantungan untuk nova-compute.
ko_kr: L2 에이전트를 변경할 때마다, nova-compute를 위한 의존성 결정을 `nova/values.yaml` 에 반영해야 합니다.

source: ``host1.fqdn`` with labels ``compute-type: dpdk, sriov`` and ``another-label: another-value``:
de: ``host1.fqdn`` mit den Labels ``compute-type: dpdk, sriov`` und ``another-label: another-value``:
id: ``host1.fqdn`` dengan label ``compute-type: dpdk, sriov`` dan ``another-label: another-value``:
ko_kr: ``compute-type: dpdk, sriov`` 와 ``another-label: another-value`` 라벨의 ``host1.fqdn`` :

source: ``host2.fqdn`` with labels ``compute-type: dpdk, sriov`` and ``another-label: another-value``:
de: ``host2.fqdn`` mit den Labels ``compute-type: dpdk, sriov`` und ``another-label: another-value``:
id: ``host2.fqdn`` dengan label ``compute-type: dpdk, sriov`` dan ``another-label: another-value``:
ko_kr: ``compute-type: dpdk, sriov`` 와 ``another-label: another-value`` 라벨의 ``host2.fqdn`` :

source: ``host3.fqdn`` with labels ``compute-type: dpdk, sriov`` and ``another-label: another-value``:
de: ``host3.fqdn`` mit den Labels ``compute-type: dpdk, sriov`` und ``another-label: another-value``:
id: ``host3.fqdn`` dengan label ``compute-type: dpdk, sriov`` dan ``another-label: another-value``:
ko_kr: ``compute-type: dpdk, sriov`` 와 ``another-label: another-value`` 라벨의 ``host3.fqdn`` :

source: ``host4.fqdn`` with labels ``compute-type: dpdk, sriov``:
de: ``host4.fqdn`` mit Label ``compute-type: dpdk, sriov``:
id: ``host4.fqdn`` dengan label ``compute-type: dpdk, sriov``:
ko_kr: ``compute-type: dpdk, sriov`` 라벨의 ``host4.fqdn`` :

source: ``host5.fqdn`` with no labels:
de: ``host5.fqdn`` ohne Label:
id: ``host5.fqdn`` tanpa label:
ko_kr: 라벨이 없는 ``host5.fqdn`` :

source: api: This is the port to map to for the service. Some components, such as glance, provide an ``api`` port and a ``registry`` port, for example.
de: api: Dies ist der Port, dem der Dienst zugeordnet werden soll. Einige Komponenten, wie zum Beispiel glance, stellen beispielsweise einen ``api``-Port und einen ``registry``-Port zur Verfügung.
id: api: Ini adalah port untuk dipetakan ke layanan. Beberapa komponen, seperti glance, menyediakan port ``api`` dan port ``registry``, misalnya.
ko_kr: api : 이것은 서비스에 매핑할 포트입니다. 예를 들어 glance와 같은 어떤 구성요소들은 ``api`` 포트와 ``registry`` 포트를 제공합니다.

source: db\_drop: The image that will perform database deletion operations for the OpenStack service.
de: db \ _drop: Das Abbild, das Datenbanklöschvorgänge für den OpenStack-Service ausführt.
id: db\_drop: Image yang akan melakukan operasi penghapusan basis data untuk layanan OpenStack.
ko_kr: db\_drop: OpenStack 서비스를 위한 데이터베이스 삭제를 수행할 이미지

source: db\_init: The image that will perform database creation operations for the OpenStack service.
de: db \ _init: Das Abbild, das Datenbankerstellungsvorgänge für den OpenStack-Service ausführt.
id: db\_init: Image yang akan melakukan operasi pembuatan basis data untuk layanan OpenStack.
ko_kr: db\_init: OpenStack 서비스를 위한 데이터베이스 생성 작업을 수행할 이미지

source: db\_sync: The image that will perform database sync (schema initialization and migration) for the OpenStack service.
de: db \ _sync: Das Abbild, das die Datenbanksynchronisierung (Schemainitialisierung und -migration) für den OpenStack-Service durchführt.
id: db\_sync: Image yang akan melakukan sinkronisasi database (skema inisialisasi dan migrasi) untuk layanan OpenStack.
ko_kr: db\_sync: OpenStack 서비스를 위한 데이터베이스 동기화(초기화와 이동 스키마)를 수행할 이미지

source: dep\_check: The image that will perform dependency checking in an init-container.
de: dep \ _check: Das Abbild, das die Abhängigkeitsprüfung in einem init-Container durchführt.
id: dep\_check: Image yang akan melakukan pemeriksaan dependensi dalam init-container.
ko_kr: dep\_check: init-container에서 의존성 검사를 수행할 이미지.

source: image: This is the OpenStack service that the endpoint is being built for. This will be mapped to ``glance`` which is the image service for OpenStack.
de: image: Dies ist der OpenStack-Dienst, für den der Endpunkt erstellt wird. Dies wird auf ``glance`` abgebildet, was der Abbild-Dienst für OpenStack ist.
id: image: Ini adalah layanan OpenStack yang endpoint sedang dibangun. Ini akan dipetakan ke ``glance`` yang merupakan layanan image untuk OpenStack.
ko_kr: image : 이것은 endpoint가 구축하고 있는 OpenStack 서비스입니다. 이것은 OpenStack을 위한 이미지 서비스인 ``glance``로 매핑될 것입니다.

source: internal: This is the OpenStack endpoint type we are looking for - valid values would be ``internal``, ``admin``, and ``public``
de: internal: Dies ist der OpenStack-Endpunkttyp, nach dem wir suchen - gültige Werte wären ``internal``, `admin`` und` public``
id: internal: Ini adalah tipe endpoint OpenStack yang kami cari - nilai yang valid adalah ``internal``, ``admin``, dan ``public``
ko_kr: internal : 이것은 우리가 찾고 있는 OpenStack endpoint 타입입니다. - 유효한 값은 ``internal``, ``admin``, 그리고 ``public`` 입니다.

source: ks\_endpoints: The image that will perform keystone endpoint registration for the service.
de: ks \ _endpoints: Das Abbild, das die Keystone-Endpunktregistrierung für den Service durchführt.
id: ks\_endpoints: Image yang akan melakukan pendaftaran endpoint keystone untuk layanan.
ko_kr: ks\_endpoints: 서비스를 위한 키스톤 endpoint 등록을 수행할 이미지

source: ks\_service: The image that will perform keystone service registration for the service.
de: ks \ _service: Das Abbild, das die Registrierung des Keystone-Service für den Service durchführt.
id: ks\_service: Image yang akan melakukan pendaftaran layanan keystone untuk layanan.
ko_kr: ks\_service: 서비스를 위한 키스톤 사용자 등록을 수행할 이미지

source: ks\_user: The image that will perform keystone user creation for the service.
de: ks \ _user: Das Abbild, das die Keystone-Nutzererstellung für den Service durchführt.
id: ks\_user: Image yang akan melakukan pembuatan pengguna keystone untuk layanan ini.
ko_kr: ks\_user : 서비스를 위한 키스톤 사용자 생성을 수행할 이미지

source: network
de: Netzwerk
ko_kr: 네트워크

source: neutron-dhcp-agent service is scheduled to run on nodes with the label `openstack-control-plane=enabled`.
de: Der Neutron-dhcp-Agent-Dienst wird auf Knoten mit der Bezeichnung openstack-control-plane = enabled ausgeführt.
id: layanan neutron-dhcp-agent dijadwalkan untuk berjalan di node dengan label `openstack-control-plane=enabled`.
ko_kr: neutron-dhcp-agent 서비스는 `openstack-control-plane=enabled` 라벨로 노드에서 실행되도록 스케줄됩니다.

source: neutron-l3-agent
de: Neutron-I3-agent

source: neutron-l3-agent service is scheduled to run on nodes with the label `openstack-control-plane=enabled`.
de: Der Dienst von neutron-l3-agent soll auf Knoten mit der Bezeichnung openstack-control-plane = enabled ausgeführt werden.
id: layanan neutron-l3-agent dijadwalkan untuk berjalan di node dengan label `openstack-control-plane=enabled`.
ko_kr: neutron-l3-agent 서비스는 `openstack-control-plane=enabled` 라벨로 노드에서 실행되도록 스케줄됩니다.

source: neutron-metadata-agent service is scheduled to run on nodes with the label `openstack-control-plane=enabled`.
de: Der Neutron-Metadaten-Agent-Dienst soll auf Knoten mit der Bezeichnung openstack-control-plane = enabled ausgeführt werden.
id: layanan neutron-metadata-agent dijadwalkan untuk berjalan di node dengan label `openstack-control-plane=enabled`.
ko_kr: neutron-metadata-agent 서비스는 `openstack-control-plane=enabled` 라벨로 노드에서 실행되도록 스케줄됩니다.

source: neutron-server is serving the networking REST API for operator and other OpenStack services usage. The internals of Neutron are highly flexible, providing plugin mechanisms for all networking services exposed. The consistent API is exposed to the user, but the internal implementation is up to the chosen SDN.
de: Neutron-Server bedient die Netzwerk-REST-API für die Nutzung von Betreibern und anderen OpenStack-Diensten. Die Interna von Neutron sind sehr flexibel und bieten Plug-in-Mechanismen für alle verfügbaren Netzwerkdienste. Die konsistente API wird dem Benutzer zur Verfügung gestellt, die interne Implementierung unterliegt jedoch dem ausgewählten SDN.
id: neutron-server melayani API REST jaringan untuk operator dan penggunaan layanan OpenStack lainnya. Internal Neutron sangat fleksibel, menyediakan mekanisme plugin untuk semua layanan jaringan yang terbuka. API yang konsisten terpapar kepada pengguna, tetapi implementasi internal terserah pada SDN yang dipilih.
ko_kr: neutron-server는 운영자와 다른 OpenStack 서비스 사용을 위한 네트워킹 REST API를 제공합니다. Neutron 내부 구조는 유연성이 뛰어나, 노출된 모든 네트워킹 서비스를 위한 플러그인 매커니즘을 제공합니다. 일관된 API는 사용자에게 노출되지만, 내부 구현은 선택된 SDN가 결정합니다.

source: openvswitch-db and openvswitch-vswitchd
de: openvswitch-db und openvswitch-vswitchd
id: openvswitch-db dan openvswitch-vswitchd
ko_kr: openvswitch-db와 openvswitch-vswitchd

source: pull\_policy: The image pull policy, one of "Always", "IfNotPresent", and "Never" which will be used by all containers in the chart.
de: pull \ _policy: Die Image-Pull-Richtlinie, eine der Optionen ``Always``, ``IfNotPresent`` und ``Never``, die von allen Containern im Chart verwendet wird.
id: pull\_policy: Kebijakan pengambilan image, salah satu "Always", "IfNotPresent", dan "Never" yang akan digunakan oleh semua kontainer dalam chart.
ko_kr: pull\_policy: 차트 내 모든 컨테이너가 사용할 "Always", "IfNotPresent", 그리고 "Never" 중 하나의 이미지 pull 정책

source: subnet
de: Teilnetz
ko_kr: 서브넷

source: Pod Disruption Budgets
ko_kr: Pod 중단 비용

source: port
ko_kr: 포트
