Repository: openstack/openstack-helm
Catalog: doc/source/locale/*/LC_MESSAGES/doc-install.po
Languages: id

source: This command will deploy a single node KubeADM administered cluster. This will use the parameters in ``${OSH_INFRA_PATH}/playbooks/vars.yaml`` to control the deployment, which can be over-ridden by adding entries to ``${OSH_INFRA_PATH}/tools/gate/devel/local-vars.yaml``.
id: Perintah ini akan menyebarkan satu node yang dikelola KubeADM cluster. Ini akan menggunakan parameter dalam ``${OSH_INFRA_PATH}/playbooks/vars.yaml`` untuk mengontrol penyebaran, yang dapat ditimpa berlebihan (over-ridden) dengan menambahkan entri ke ``${OSH_INFRA_PATH}/tools/gate/devel/local-vars.yaml``.

source: This guide assumes that users wishing to deploy behind a proxy have already defined the conventional proxy environment variables ``http_proxy``, ``https_proxy``, and ``no_proxy``.
id: Panduan ini mengasumsikan bahwa pengguna yang ingin menyebarkan di belakang proxy telah mendefinisikan variabel lingkungan proksi konvensional ``http_proxy``, ``https_proxy``, dan ``no_proxy``.

source: This guide covers the minimum number of requirements to get started.
id: Panduan ini mencakup jumlah minimum persyaratan untuk memulai.

source: This guide explains how to deploy tap-as-a-service (TaaS) Neutron plugin and TaaS Dashboard plugin in Neutron and Horizon charts respectively.
id: Panduan ini menjelaskan cara menggunakan plugin Tap-as-a-service (TaaS) Neutron dan plugin TaaS Dashboard di masing-masing chart Neutron dan Horizon.

source: This installation, by default will use Google DNS servers, 8.8.8.8 or 8.8.4.4 and updates resolv.conf. These DNS nameserver entries can be changed by updating file ``/opt/openstack-helm-infra/tools/images/kubeadm-aio/assets/opt/playbooks/vars.yaml`` under section ``external_dns_nameservers``. This change must be done on each node in your cluster.
id: Instalasi ini, secara default akan menggunakan server DNS Google, 8.8.8.8 atau 8.8.4.4 dan memperbarui resolv.conf. Entri server nama DNS ini dapat diubah dengan memperbarui file ``/opt/openstack-helm-infra/tools/images/kubeadm-aio/assets/opt/playbooks/vars.yaml`` di bawah bagian ``external_dns_nameservers``. Perubahan ini harus dilakukan pada setiap node di kluster Anda.

source: This is a two step process, i.e.
id: Ini adalah proses dua langkah, misal

source: This script will create two loopback devices for Ceph as one disk for OSD data and other disk for block DB and block WAL. If default devices (loop0 and loop1) are busy in your case, feel free to change them by exporting environment variables(CEPH_OSD_DATA_DEVICE and CEPH_OSD_DB_WAL_DEVICE).
id: Script ini akan membuat dua perangkat loopback untuk Ceph sebagai satu disk untuk data OSD dan disk lain untuk memblokir DB dan memblokir WAL. Jika perangkat default (loop0 dan loop1) sibuk dalam kasus Anda, jangan ragu untuk mengubahnya dengan mengekspor variabel lingkungan (CEPH_OSD_DATA_DEVICE dan CEPH_OSD_DB_WAL_DEVICE).

source: This will delete all Kubernetes resources generated when the chart was instantiated. However for OpenStack charts, by default, this will not delete the database and database users that were created when the chart was installed. All OpenStack projects can be configured such that upon deletion, their database will also be removed. To delete the database when the chart is deleted the database drop job must be enabled before installing the chart. There are two ways to enable the job, set the job_db_drop value to true in the chart's ``values.yaml`` file, or override the value using the helm install command as follows:
id: Ini akan menghapus semua sumber daya Kubernetes yang dihasilkan saat chart dibuat. Namun untuk chart OpenStack, secara default, ini tidak akan menghapus database dan pengguna database yang dibuat ketika chart dipasang. Semua proyek OpenStack dapat dikonfigurasi sedemikian rupa sehingga pada saat penghapusan, database mereka juga akan dihapus. Untuk menghapus database ketika chart dihapus, pekerjaan drop database harus diaktifkan sebelum menginstal chart. Ada dua cara untuk mengaktifkan pekerjaan, mengatur nilai job_db_drop menjadi true dalam file ``values.yaml`` pada chart, atau mengganti nilai menggunakan perintah penginstalan helm seperti berikut:

source: Throughout this guide the assumption is that the user is: ``ubuntu``. Because this user has to execute root level commands remotely to other nodes, it is advised to add the following lines to ``/etc/sudoers`` for each node:
id: Sepanjang panduan ini, asumsinya adalah bahwa pengguna adalah: ``ubuntu``. Karena pengguna ini harus mengeksekusi perintah level root dari jarak jauh ke node lain, disarankan untuk menambahkan baris berikut ke ``/etc/sudoers`` untuk setiap node:

source: To allocate PMD threads to NUMA sockets in OVS, ensure that the ``pmd_cpu_mask`` attribute in values.yaml includes CPU sockets on the corresponding NUMA socket. In the example below, the mask of 0xf covers the first 4 CPU cores which are dsitributed across NUMA sockets 0 and 1.
id: Untuk mengalokasikan threads PMD ke soket NUMA di OVS, pastikan bahwa atribut ``pmd_cpu_mask`` dalam values.yaml termasuk soket CPU pada soket NUMA yang sesuai. Pada contoh di bawah ini, mask 0xf mencakup 4 core CPU pertama yang didistribusikan di seluruh soket NUMA 0 dan 1.

source: To allocate hugepages to NUMA sockets in OVS, ensure that the ``socket_memory`` attribute in values.yaml specifies a value for the corresponding NUMA socket. In the following example, OVS will use one 1G hugepage for NUMA socket 0 and socket 1.
id: Untuk mengalokasikan hugepage ke soket NUMA di OVS, pastikan bahwa atribut ``socket_memory`` dalam values.yaml menentukan nilai untuk soket NUMA yang sesuai. Dalam contoh berikut, OVS akan menggunakan satu hugepage 1G untuk NUMA socket 0 dan socket 1.

source: To continue to deploy OpenStack on Kubernetes via OSH, see :doc:`Deploy NFS<./deploy-with-nfs>` or :doc:`Deploy Ceph<./deploy-with-ceph>`.
id: Untuk terus menggunakan OpenStack di Kubernetes melalui OSH, lihat :doc:`Deploy NFS<./deploy-with-nfs>` or :doc:`Deploy Ceph<./deploy-with-ceph>`.

source: To copy the ssh key to each node, this can be accomplished with the ``ssh-copy-id`` command, for example: *ssh-copy-id ubuntu@192.168.122.178*
id: Untuk menyalin kunci ssh ke setiap node, ini dapat diselesaikan dengan perintah ``ssh-copy-id``, misalnya: *ssh-copy-id ubuntu@192.168.122.178*

source: To delete an installed helm chart, use the following command:
id: Untuk menghapus helm chart yang terpasang, gunakan perintah berikut:

source: To generate the key you can use ``ssh-keygen -t rsa``
id: Untuk menghasilkan kunci yang dapat Anda gunakan ``ssh-keygen -t rsa``

source: To get started with OSH, we will need both ``git`` and ``curl``.
id: Untuk memulai dengan OSH, kita membutuhkan ``git`` dan ``curl``.

source: To run further commands from the CLI manually, execute the following to set up authentication credentials::
id: Untuk menjalankan perintah lebih lanjut dari CLI secara manual, jalankan perintah berikut untuk menyiapkan kredensial otentikasi ::

source: To tear-down, the development environment charts should be removed first from the 'openstack' namespace and then the 'ceph' namespace using the commands from the `Removing Helm Charts` section. Additionally charts should be removed from the 'nfs' and 'libvirt' namespaces if deploying with NFS backing or bare metal development support. You can run the following commands to loop through and delete the charts, then stop the kubelet systemd unit and remove all the containers before removing the directories used on the host by pods.
id: Untuk meruntuhkan (tear-down), chart lingkungan pengembangan harus dihapus pertama dari namespace 'openstack' dan kemudian namespace 'ceph' menggunakan perintah dari bagian `Removing Helm Charts`. Selain itu, chart harus dihapus dari namespace 'nfs' dan 'libvirt' jika digunakan dengan dukungan dukungan NFS atau bare metal. Anda dapat menjalankan perintah berikut untuk mengulang dan menghapus chart, kemudian menghentikan unit kubelet systemd dan menghapus semua kontainer sebelum menghapus direktori yang digunakan pada host oleh pod.

source: Troubleshooting
id: Penyelesaian masalah

source: Tungsten Fabric is the multicloud and multistack network solution which you can use for your OpenStack as a network plugin. This document decribes how you can deploy a single node Open Stack based on Tungsten Fabric using openstack helm for development purpose.
id: Tungsten Fabric adalah solusi jaringan multicloud dan multistack yang dapat Anda gunakan untuk OpenStack Anda sebagai plugin jaringan. Dokumen ini menjelaskan bagaimana Anda bisa menggunakan Open Stack node tunggal berdasarkan Tungsten Fabric menggunakan OpenStack helm untuk tujuan pengembangan.

source: Two similar options exist to set the FQDN overrides for External DNS mapping.
id: Dua opsi serupa ada untuk mengatur FQDN menimpa untuk pemetaan DNS Eksternal.

source: Until the Ubuntu kernel shipped with 16.04 supports CephFS subvolume mounts by default the `HWE Kernel <../troubleshooting/ubuntu-hwe-kernel.html>`__ is required to use CephFS.
id: Sampai kernel Ubuntu yang dikirim dengan 16.04 mendukung CephFS subvolume mount secara default `HWE Kernel <../troubleshooting/ubuntu-hwe-kernel.html>`__ diperlukan untuk menggunakan CephFS.

source: Update your lab/environment DNS server with your appropriate host values creating A Records for the edge node IP's and various FQDN's. Alternatively you can test these settings locally by editing your ``/etc/hosts``. Below is an example with a dummy domain ``os.foo.org`` and dummy Ingress IP ``1.2.3.4``.
id: Perbarui server DNS lab/environment Anda dengan nilai host yang sesuai Anda membuat A Records untuk node edge IP dan berbagai FQDN. Atau Anda dapat menguji pengaturan ini secara lokal dengan mengedit ``/etc/hosts`` Anda. Di bawah ini adalah contoh dengan dummy domain ``os.foo.org`` dan dummy Ingress IP ``1.2.3.4``.

source: Use above gerrit commits to prepare the LOCI images using following script:
id: Gunakan komit gerrit di atas untuk menyiapkan image LOCI menggunakan skrip berikut:

source: Use it as ``docker build --build-arg PROJECT_REF=${REQUIREMENTS_REF_SPEC}`` command argument to build the requirements LOCI image.
id: Gunakan sebagai argumen perintah ``docker build --build-arg PROJECT_REF=${REQUIREMENTS_REF_SPEC}`` untuk membangun image LOCI persyaratan.

source: Using Horizon as an example, find the ``endpoints`` config.
id: Dengan menggunakan Horizon sebagai contoh, cari konfigurasi ``endpoints``.

source: Using the Helm packages previously pushed to the local Helm repository, run the following commands to instruct tiller to create an instance of the given chart. During installation, the helm client will print useful information about resources created, the state of the Helm releases, and whether any additional configuration steps are necessary.
id: Dengan menggunakan paket Helm yang sebelumnya didorong ke repositori Helm setempat, jalankan perintah berikut untuk menginstruksikan tiller untuk membuat instance dari chart yang diberikan. Selama instalasi, klien helm akan mencetak informasi yang berguna tentang sumber daya yang dibuat, keadaan rilis Helm, dan berbagai langkah konfigurasi tambahan diperlukan.

source: Verify the *v1beta1/Ingress* resource has a Host with your FQDN value
id: Verifikasi sumber daya *v1beta1/Ingress* memiliki Host dengan nilai FQDN Anda

source: We are also going to seperate Ceph metadata and data onto a different devices to replicate the ideal scenario of fast disks for metadata and slow disks to store data. You can change this as per your design by referring to the documentation explained in ../openstack-helm-infra/ceph-osd/values.yaml
id: Kami juga akan memisahkan meta data Ceph dan data ke perangkat yang berbeda untuk mereplikasi skenario ideal disk cepat untuk metadata dan memperlambat disk untuk menyimpan data. Anda dapat mengubah ini sesuai desain Anda dengan merujuk pada dokumentasi yang dijelaskan dalam ../openstack-helm-infra/ceph-osd/values.yaml

source: We are going to install Ceph OSDs backed by loopback devices as this will help us not to attach extra disks, in case if you have enough disks on the node then feel free to skip creating loopback devices by exporting CREATE_LOOPBACK_DEVICES_FOR_CEPH to false and export the block devices names as environment variables(CEPH_OSD_DATA_DEVICE and CEPH_OSD_DB_WAL_DEVICE).
id: Kami akan menginstal OSD Ceph yang didukung oleh perangkat loopback karena ini akan membantu kami untuk tidak memasang disk tambahan, jika Anda memiliki cukup disk pada node, silakan lewati pembuatan perangkat loopback dengan mengekspor CREATE_LOOPBACK_DEVICES_FOR_CEPH ke false dan mengekspor perangkat blok nama sebagai variabel lingkungan (CEPH_OSD_DATA_DEVICE dan CEPH_OSD_DB_WAL_DEVICE).

source: We want to change the **public** configurations to match our DNS layouts above. In each Chart ``values.yaml`` is a ``endpoints`` configuration that has ``host_fqdn_override``'s for each API that the Chart either produces or is dependent on. `Read more about how Endpoints are developed <https://docs.openstack.org/openstack-helm/latest/devref/endpoints.html>`__. Note while Glance Registry is listening on a Ingress http endpoint, you will not need to expose the registry for external services.
id: Kami ingin mengubah konfigurasi ***public*** agar sesuai dengan tata letak DNS kami di atas. Di setiap Chart ``values.yaml`` adalah konfigurasi ``endpoints`` yang memiliki ``host_fqdn_override`` untuk setiap API yang dihasilkan oleh Chart atau tergantung pada. `Read more about how Endpoints are developed <https://docs.openstack.org/openstack-helm/latest/devref/endpoints.html>`__. Catatan sementara Glance Registry sedang mendengarkan pada endpoint http Ingress, Anda tidak perlu mengekspos registri untuk layanan eksternal.

source: When adding a DPDK port (a NIC bound to DPDK) to OVS fails, one source of error is related to an incorrect configuration with regards to the NUMA topology of the underlying hardware. Every NIC is connected to one specific NUMA socket. In order to use a NIC as DPDK port in OVS, the OVS configuration regarding hugepages and PMD threas needs to match the NUMA topology.
id: Ketika menambahkan port DPDK (NIC terikat ke DPDK) ke OVS gagal, satu sumber kesalahan terkait dengan konfigurasi yang salah berkaitan dengan topologi NUMA dari perangkat keras yang mendasarinya. Setiap NIC terhubung ke satu soket NUMA tertentu. Untuk menggunakan NIC sebagai port DPDK di OVS, konfigurasi OVS tentang hugepage dan PMD threas harus sesuai dengan topologi NUMA.

source: While deploying neutron-server and L2 agents, TaaS should be enabled in ``conf: neutron`` section to add TaaS as a service plugin; in ``conf: plugins`` section to add TaaS as a L2 agent extension; in ``conf: taas_plugin`` section to configure the ``service_provider`` endpoint used by Neutron TaaS plugin:
id: Saat menggunakan neutron-server dan agen L2, TaaS harus diaktifkan di bagian ``conf: neutron`` untuk menambahkan TaaS sebagai plugin layanan; di bagian `` conf: plugins`` untuk menambahkan TaaS sebagai ekstensi agen L2; di bagian ``conf: taas_plugin`` untuk mengkonfigurasi endpoint ``service_provider`` yang digunakan oleh plugin Neutron TaaS:

source: You can use any Kubernetes deployment tool to bring up a working Kubernetes cluster for use with OpenStack-Helm. For production deployments, please choose (and tune appropriately) a highly-resilient Kubernetes distribution, e.g.:
id: Anda dapat menggunakan alat penyebaran Kubernetes untuk memunculkan kluster Kubernetes yang berfungsi untuk digunakan dengan OpenStack-Helm. Untuk penyebaran produksi, pilih (dan selaraskan dengan tepat) distribusi Kubernetes yang sangat tangguh (highly-resilient), misalnya:

source: You can use any Kubernetes deployment tool to bring up a working Kubernetes cluster for use with OpenStack-Helm. This guide describes how to simply stand up a multinode Kubernetes cluster via the OpenStack-Helm gate scripts, which use KubeADM and Ansible. Although this cluster won't be production-grade, it will serve as a quick starting point in a lab or proof-of-concept environment.
id: Anda dapat menggunakan alat penyebaran Kubernetes untuk memunculkan klaster Kubernetes yang berfungsi untuk digunakan dengan OpenStack-Helm. Panduan ini menjelaskan cara untuk hanya berdiri multinode Kubernetes klaster melalui skrip gate OpenStack-Helm, yang menggunakan KubeADM dan Ansible. Meskipun klaster ini tidak akan menjadi kelas produksi (production-grade), ini akan berfungsi sebagai titik awal yang cepat di laboratorium atau lingkungan proof-of-concept.

source: You may now deploy kubernetes, and helm onto your machine, first move into the ``openstack-helm`` directory and then run the following:
id: Anda sekarang dapat menyebarkan kubernetes, dan helm ke komputer Anda, pertama-tama masuk ke direktori ``openstack-helm`` dan kemudian jalankan yang berikut:

source: Your changes to `/etc/environment` will not be applied until you source them:
id: Perubahan Anda ke `/etc/environment` tidak akan diterapkan sampai Anda sumbernya:

source: `Airship <https://airshipit.org/>`_, a declarative open cloud infrastructure platform
id: `Airship <https://airshipit.org/>`_, platform infrastruktur cloud terbuka deklaratif

source: `KubeADM <https://kubernetes.io/docs/setup/independent/high-availability/>`_, the foundation of a number of Kubernetes installation solutions
id: `KubeADM <https://kubernetes.io/docs/setup/independent/high-availability/>`_, fondasi sejumlah solusi instalasi Kubernetes

source: hugepages have been allocated on NUMA socket 1 by OVS, and
id: hugepage telah dialokasikan pada NUMA socket 1 oleh OVS, dan

source: if you are rerunning the below script then make sure to skip the loopback device creation by exporting CREATE_LOOPBACK_DEVICES_FOR_CEPH to false.
id: jika Anda menjalankan ulang skrip di bawah ini, pastikan untuk melewati pembuatan perangkat loopback dengan mengekspor CREATE_LOOPBACK_DEVICES_FOR_CEPH ke false.

source: node_one, node_two and node_three below are all worker nodes, children of the master node that the commands below are executed on.
id: node_one, node_two dan node_three di bawah ini adalah semua node pekerja (worker node), anak-anak (children) dari node master dimana perintah di bawah ini dieksekusi.
