Repository: openstack/openstack-helm
Catalog: doc/source/locale/*/LC_MESSAGES/doc-devref.po
Languages: de, id, ko_kr

source: Fluent-bit, Fluentd meet OpenStack-Helm's logging requirements for gathering, aggregating, and delivering of logged events. Fluent-bit runs as a daemonset on each node and mounts the `/var/lib/docker/containers` directory. The Docker container runtime engine directs events posted to stdout and stderr to this directory on the host. Fluent-bit then forward the contents of that directory to Fluentd. Fluentd runs as deployment at the designated nodes and expose service for Fluent-bit to forward logs. Fluentd should then apply the Logstash format to the logs. Fluentd can also write kubernetes and OpenStack metadata to the logs. Fluentd will then forward the results to Elasticsearch and to optionally Kafka. Elasticsearch indexes the logs in a logstash-* index by default. Kafka stores the logs in a ``logs`` topic by default. Any external tool can then consume the ``logs`` topic.
de: Fluent-Bit, Fluentd erfüllt die Protokollierungsanforderungen von OpenStack-Helm zum Sammeln, Aggregieren und Liefern protokollierter Ereignisse. Fluent-Bit wird auf jedem Knoten als Daemonset ausgeführt und lädt das Verzeichnis /var/lib/docker/containers. Die Docker-Container-Laufzeit-Engine leitet Ereignisse, die an stdout und stderr gesendet wurden, in dieses Verzeichnis auf dem Host. Fluent-Bit leitet dann den Inhalt dieses Verzeichnisses an Fluentd weiter. Fluentd wird als Bereitstellung an den angegebenen Knoten ausgeführt und stellt den Dienst für Fluent-Bit für die Weiterleitung von Protokollen bereit. Fluentd sollte dann das Logstash-Format auf die Protokolle anwenden. Fluentd kann auch Kubernetes und OpenStack-Metadaten in die Protokolle schreiben. Fluentd wird die Ergebnisse dann an Elasticsearch und optional an Kafka weiterleiten. Elasticsearch indexiert standardmäßig die Logs in einem logstash-Index*. Kafka speichert die Logs standardmäßig in einem ``logs``-Thema. Jedes externe Tool kann dann das ``logs``-Thema konsumieren.
id: Fluent-bit, Fluentd memenuhi persyaratan logging OpenStack-Helm untuk gathering, aggregating, dan delivering peristiwa yang tercatat. Fluent-bit berjalan sebagai daemonset pada setiap node dan me-mount direktori `/var/lib/docker/containers`. Engine runtime kontainer Docker mengarahkan events yang diposting ke stdout dan stderr ke direktori ini pada host. Fluent-bit kemudian meneruskan isi direktori itu ke Fluentd. Fluentd berfungsi sebagai penyebaran (deployment) di node yang ditunjuk dan mengekspos layanan untuk Fluent-bit ke forward logs. Fluentd kemudian harus menerapkan format Logstash ke log. Fluentd juga dapat menulis metadata kubernetes dan OpenStack ke log. Fluentd kemudian akan meneruskan hasil ke Elasticsearch dan ke opsional Kafka. Elasticsearch mengindeks log dalam logstash-* index secara default. Kafka menyimpan log dalam topik ``log`` secara default. Setiap alat eksternal kemudian dapat mengkonsumsi topik ``log``.
ko_kr: Fluent-bit, Fluentd는 기록된 이벤트의 수집, 집계, 그리고 전달을 위한 로깅 요구사항을 충족합니다. Fluent-bit는 각 노드에서 daemonset으로 실행하고 `/var/lib/docker/containers` 디렉터리를 마운트합니다. Docker 컨테이너 런타임 엔진은 stdout과 stderr에 게시된 이벤트를 호스트의 상기 디렉터리로 보냅니다. 그런 다음 Fluent-bit는 해당 디렉터리의 내용을 Fluentd로 전달합니다. Fluentd는 지정된 노드에서 배포로 동작하고 Fluent-bit의 전달 로그로 서비스를 표시합니다. 그런 다음 Fluentd는 Logstash 포맷을 로그에 적용해야 합니다. Fluentd는 또한 kubernetes와 OpenStack의 메타데이터를 로그에 작성합니다. Fluentd는 그 결과를 Elasticsearch와 선택적으로 Kafka에 전달합니다. Elasticsearch는 기본적으로 로그를 logstash-*로 색인합니다. Kafka는 기본적으로 로그를 ``logs`` 주제로 보관합니다. 그러면 외부 도구가 ``logs`` 주제를 사용할 수 있습니다.

source: For instance, in the Neutron chart ``values.yaml`` the following endpoints are defined:
de: Zum Beispiel sind im Neutron-Chart ``values.yaml`` die folgenden Endpunkte definiert:
id: Sebagai contoh, dalam Neutron chart ``values.yaml``, endpoint berikut didefinisikan:
ko_kr: 예를 들어, Neutron 차트 ``values.yaml`` 에서 다음과 같은 endpoints가 정의됩니다:

source: Host overrides supercede label overrides
de: Der Host überschreibt Supercede-Label-Overrides
id: Host mengesampingkan penggantian label supercede
ko_kr: 호스트가 대체 라벨의 오버라이드를 오버라이드합니다.

source: If :code:`.Values.manifests.daemonset_ovs_agent` will be set to false, neutron ovs agent would not be launched. In that matter, other type of L2 or L3 agent on compute node can be run.
de: Wenn :code:`.Values.manifests.daemonset_ovs_agent auf false gesetzt wird, wird der neutron ovs-Agent nicht gestartet. In diesem Fall kann ein anderer Typ von L2- oder L3-Agenten auf dem Rechenknoten ausgeführt werden.
id: Jika :code:`.Values.manifests.daemonset_ovs_agent` akan disetel ke false, agen neutron ovs tidak akan diluncurkan. Dalam hal ini, jenis lain dari agen L2 atau L3 pada node komputasi dapat dijalankan.
ko_kr: :code:`.Values.manifests.daemonset_ovs_agent` 가 false로 설정된다면, neutron ovs 에이전트는 시작되지 않을 것입니다. 그 때, 컴퓨트 노드의 다른 타입의 L2나 L3 에이전트가 실행됩니다.

source: If required, add new networking agent label type.
de: Fügen Sie bei Bedarf einen neuen Label-Typ für den Netzwerkagenten hinzu.
id: Jika diperlukan, tambahkan jenis label agen jaringan baru.
ko_kr: 필요하다면, 새로운 네트워킹 에이전트 라벨 타입을 추가하십시오.

source: If the SDN implements its own version of L3 networking, neutron-l3-agent should not be started.
de: Wenn das SDN eine eigene Version des L3-Netzwerkes implementiert, sollte neutron-l3-agent nicht gestartet werden.
id: Jika SDN mengimplementasikan versi jaringan L3nya sendiri, neutron-l3-agent tidak boleh dimulai.
ko_kr: SDN이 L3 네트워킹의 한 버전을 구현한다면, neutron-l3-agent는 시작되어서는 안됩니다.

source: If the SDN of your choice is using the ML2 core plugin, then the extra options in `neutron/ml2/plugins/ml2_conf.ini` should be configured:
de: Wenn das SDN Ihrer Wahl das ML2 Core-Plugin verwendet, sollten die zusätzlichen Optionen in `neutron/ml2/plugins/ml2_conf.ini` konfiguriert werden:
id: Jika SDN pilihan Anda menggunakan plugin ML2 core, maka opsi tambahan di `neutron/ml2/plugins/ml2_conf.ini` harus dikonfigurasi:
ko_kr: 선택한 SDN이 ML2 코어 플러그인을 사용하고 있다면, `neutron/ml2/plugins/ml2_conf.ini` 의 추가 옵션이 구성되어야 합니다:

source: Images
de: Abbilder
ko_kr: 이미지

source: In ``values.yaml`` in each chart, the same defaults are supplied in every chart, which allows the operator to override at upgrade or deployment time.
de: In ``values.yaml`` in jedem Chart werden die gleichen Standardwerte in jedem Chart bereitgestellt, wodurch der Bediener beim Upgrade oder bei der Bereitstellung überschreiben kann.
id: Dalam ``values.yaml`` di setiap chart, default yang sama disediakan dalam setiap chart, yang memungkinkan operator untuk meng-override saat upgrade atau waktu deployment.
ko_kr: 각 차트의 ``values.yaml`` 에는, 업그레이드나 배포 시기에 운영자의 오버라이드가 허용되는 동일한 기본값이 모든 차트에 제공됩니다.

source: In order to add support for more SDNs, these steps need to be performed:
de: Um weitere SDNs zu unterstützen, müssen diese Schritte ausgeführt werden:
id: Untuk menambahkan dukungan untuk lebih banyak SDN, langkah-langkah ini perlu dilakukan:
ko_kr: 더 많은 SDN들을 추가하기 위해서, 이 과정들을 수행할 필요가 있습니다:

source: In order to meet modularity criteria of Neutron chart, section `manifests` in :code:`neutron/values.yaml` contains boolean values describing which Neutron's Kubernetes resources should be deployed:
de: Um die Modularitätskriterien des Neutron-Chart zu erfüllen, enthält der Abschnitt ``manifests`` in :code:`neutron/values.yaml` boolesche Werte, die beschreiben, welche Kubernetes-Ressourcen von Neutron eingesetzt werden sollten:
id: Untuk memenuhi kriteria modularitas chart Neutron, bagian `manifes` dalam :code:`neutron/values.yaml` berisi nilai boolean yang menjelaskan sumber Kubernetes Neutron mana yang harus digunakan:
ko_kr: Neutron 차트의 모듈성 기준을 충족하기 위해서, :code:`neutron/values.yaml`의 섹션 매니페스트는 어떤 Neutron의 Kubernetes 리소스가 배포되어야 하는지 서술하는 boolean 값들을 포함하고 있습니다:

source: In order to use linuxbridge in your OpenStack-Helm deployment, you need to label the compute and controller/network nodes with `linuxbridge=enabled` and use this `neutron/values.yaml` override:
de: Um linuxbridge in Ihrer OpenStack-Helm-Implementierung zu verwenden, müssen Sie die Knoten compute und controller/network mit linuxbridge = enabled kennzeichnen und diese `neutron/values.yaml`-Überschreibung verwenden:
id: Untuk menggunakan linuxbridge dalam penyebaran OpenStack-Helm Anda, Anda perlu memberi label node komputasi dan controller/network dengan `linuxbridge=enabled` dan menggunakan pengalih (override) `neutron/values.yaml` ini:
ko_kr: OpenStack-Helm 배치에서 linuxbridge를 사용하기 위해, compute와 controller/network 노드를 `linuxbridge=enabled`로 라벨할 필요가 있고 이것을 `neutron/values.yaml`에 오버라이드하여 사용합니다.

source: Introducing a new SDN solution should consider how the above services are provided. It maybe required to disable built-in Neutron functionality.
de: Die Einführung einer neuen SDN-Lösung sollte überlegen, wie die oben genannten Dienste bereitgestellt werden. Es ist möglicherweise erforderlich, die eingebaute Neutronenfunktionalität zu deaktivieren.
id: Memperkenalkan solusi SDN baru harus mempertimbangkan bagaimana layanan di atas disediakan. Mungkin diperlukan untuk menonaktifkan fungsi Neutron bawaan.
ko_kr: 새로운 SDN 솔루션 도입은 위의 서비스가 어떻게 제공되는지를 고려해야합니다. Neutron 내장 함수를 비활성화가 필요할 수도 있습니다.

source: L3 agent is serving the routing capabilities for Neutron networks. It is also dependent on the L2 agent wiring the tap interface for the routers.
de: Der L3-Agent bedient die Routing-Funktionen für Neutron-Netzwerke. Es hängt auch davon ab, dass der L2-Agent die Abgriffschnittstelle für die Router verkabelt.
id: Agen L3 melayani kemampuan routing untuk jaringan Neutron. Hal ini juga tergantung pada agen L2 yang memasang antarmuka keran (tap interface) untuk router.
ko_kr: L3 에이전트는 Neutron 네트워크를 위한 라우팅 능력을 제공하고 있습니다. 또한 라우터를 위한 탭 인터페이스를 연결하는 L2 에이전트에 의존합니다.

source: L3 routing - creation of routers
de: L3 Routing - Erstellung von Routern
id: L3 routing - pembuatan router
ko_kr: L3 라우팅 - 라우터 생성

source: Linuxbridge is the second type of Neutron reference architecture L2 agent. It is running on nodes labeled `linuxbridge=enabled`. As mentioned before, all nodes that are requiring the L2 services need to be labeled with linuxbridge. This includes both the compute and controller/network nodes. It is not possible to label the same node with both openvswitch and linuxbridge (or any other network virtualization technology) at the same time.
de: Linuxbridge ist der zweite Typ des Neutronen-Referenzarchitektur-L2-Agenten. Es läuft auf Knoten mit der Bezeichnung `linuxbridge = enabled`. Wie bereits erwähnt, müssen alle Knoten, die L2-Dienste benötigen, mit linuxbridge gekennzeichnet werden. Dies umfasst sowohl die Rechner- als auch die Controller-/Netzwerkknoten. Es ist nicht möglich, denselben Knoten gleichzeitig mit openvswitch und linuxbridge (oder einer anderen Netzwerkvirtualisierungstechnologie) zu beschriften.
id: Linuxbridge adalah tipe kedua dari arsitektur referensi Neutron, agen L2. Ini berjalan pada node berlabel `linuxbridge=enabled`. Seperti disebutkan sebelumnya, semua node yang membutuhkan layanan L2 perlu diberi label dengan linuxbridge. Ini termasuk node komputasi dan controller/network. Tidaklah mungkin untuk melabeli node yang sama dengan baik openvswitch dan linuxbridge (atau teknologi virtualisasi jaringan lainnya) pada saat yang bersamaan.
ko_kr: Linuxbridge는 Neutron 참조 구조 L2 에이전트의 두 번째 타입입니다. 그것은 `linuxbridge=enabled`로 라벨된 노드에서 실행 중입니다. 앞서 언급했듯이, L2 서비스를 요구하는 모든 노드는 linuxbridge로 라벨될 필요가 있습니다. 이는 compute와 controller/network 노드 모두를 포함합니다. 같은 노드에 openvswitch와 linuxbridge (또는 다른 네트워크 가상화 기술)를 동시에 라벨하는 것은 불가능합니다.

source: Logging Mechanism
de: Protokollierungsmechanismus
id: Logging Mechanism (mekanisme logging)
ko_kr: 로깅 매커니즘

source: Logging Requirements
de: Protokollierungsanforderungen
id: Logging Requirements (persyaratan logging)
ko_kr: 로깅 요구사항

source: Metadata - Provide proxy for Nova metadata service
de: Metadaten - Stellt einen Proxy für den Nova-Metadaten-Service bereit
id: Metadata - Menyediakan proxy untuk layanan metadata Nova
ko_kr: 메타데이터 - Nova 메타데이터 서비스를 위한 프록시 제공

source: Metadata-agent is a proxy to nova-metadata service. This one provides information about public IP, hostname, ssh keys, and any tenant specific information. The same dependencies apply for metadata as it is for DHCP and L3 agents. Other SDNs may require to force the config driver in nova, since the metadata service is not exposed by it.
de: Der Metadata-Agent ist ein Proxy für den Nova-Metadata-Service. Dieser enthält Informationen zu öffentlichen IP-Adressen, Hostnamen, SSH-Schlüsseln und mandantenspezifischen Informationen. Für Metadaten gelten die gleichen Abhängigkeiten wie für DHCP- und L3-Agenten. Bei anderen SDNs kann es erforderlich sein, den Konfigurationstreiber in Nova zu erzwingen, da der Metadatendienst dadurch nicht verfügbar gemacht wird.
id: Metadata-agent adalah proxy untuk layanan nova-metadata. Yang satu ini memberikan informasi tentang IP publik, nama host, kunci ssh, dan informasi khusus penyewa apa pun. Ketergantungan yang sama berlaku untuk metadata seperti halnya untuk DHCP dan agen L3. SDN lain mungkin perlu memaksa driver konfigurasi di nova, karena layanan metadata tidak terkena olehnya.
ko_kr: Metadata-agent는 nova-metadata 서비스에 대한 프록시입니다. 이것은 공용 IP, 호스트명, ssh 키, 그리고 tenant 특정 정보에 대한 정보를 제공합니다. DHCP와 L3 에이전트와 마찬가지로 메타데이터에도 동일한 의존성을 적용합니다. 다른 SDN은 메타데이터 서비스가 노출되어 있지 않으므로 nova에서 드라이버 구성을 강제할 것을 요구할지도 모릅니다.

source: Networking
de: Vernetzung
id: Networking (jaringan)
ko_kr: 네트워킹

source: Neutron architecture
de: Neutron-Architektur
id: Arsitektur Neutron
ko_kr: Neutron 구조

source: Neutron chart includes the following services:
de: Neutronendiagramm beinhaltet folgende Dienste:
id: Chart Neutron mencakup layanan berikut:
ko_kr: Neutron 차트는 다음의 서비스들을 포함합니다:

source: Neutron-server service is scheduled on nodes with `openstack-control-plane=enabled` label.
de: Der Neutron-Server-Dienst wird auf Knoten mit der Markierung ``openstack-control-plane = enabled`` geplant.
id: Layanan Neutron-server dijadwalkan pada node dengan label `openstack-control-plane=enabled`.
ko_kr: Neutron-server 서비스는 `openstack-control-plane=enabled` 라벨로 노드에 스케줄됩니다.

source: Node and label specific configurations
de: Knoten- und labelspezifische Konfigurationen
id: Node dan label konfigurasi tertentu
ko_kr: 노드와 라벨 특정 구성

source: Note that only one set of overrides is applied per node, such that:
de: Beachten Sie, dass nur ein Satz von Überschreibungen pro Knoten angewendet wird, so dass:
id: Perhatikan bahwa hanya satu set penggantian diterapkan per node, sehingga:
ko_kr: 노드마다 다음과 같이 단 하나의 오버라이드 세트만 적용되는 점을 참고하십시오:

source: Note that some additional values have been injected into the config file, this is performed via statements in the configmap template, which also calls the ``helm-toolkit.utils.to_oslo_conf`` to convert the yaml to the required layout:
de: Beachten Sie, dass einige zusätzliche Werte in die Konfigurationsdatei eingefügt wurden. Dies geschieht über Anweisungen in der Vorlage configmap, die auch ``helm-toolkit.utils.to_oslo_conf`` aufrufen, um das yaml in das gewünschte Layout zu konvertieren:
id: Perhatikan bahwa beberapa nilai tambahan telah disuntikkan ke file konfigurasi, ini dilakukan melalui pernyataan dalam template configmap, yang juga memanggil ``helm-toolkit.utils.to_oslo_conf`` untuk mengonversi yaml ke tata letak yang diperlukan:
ko_kr: 구성 파일에 몇 가지 추가 값들이 주입되었음을 참고하십시오, 이는 configmap 템플릿의 문장을 통해 수행되며, 또한 yaml을 필요한 레이아웃으로 변환하기 위해 ``helm-toolkit.utils.to_oslo_conf`` 를 호출합니다:

source: Note: Rolling update values can conflict with values defined in each service's PodDisruptionBudget. See `here <https://docs.openstack.org/openstack-helm/latest/devref/pod-disruption-budgets.html>`_ for more information.
de: Hinweis: Rollende Aktualisierungswerte können zu Konflikten mit Werten führen, die im PodDisruptionBudget jedes Service definiert sind. Siehe `hier <https://docs.openstack.org/openstack-helm/latest/devref/pod-disruption-budgets.html>`_ für weitere Informationen.
id: Catatan: Nilai pembaruan bergulir dapat bertentangan dengan nilai yang ditentukan dalam PodDisruptionBudget layanan masing-masing. Lihat `here <https://docs.openstack.org/openstack-helm/latest/devref/pod-disruption-budgets.html>`_ untuk informasi lebih lanjut.
ko_kr: 참고: 롤링 업데이트 값은 각 서비스의 PodDisruptionBudget에 정의된 값들과 충돌할 수 있습니다. 자세한 정보는 `여기 <https://docs.openstack.org/openstack-helm/latest/devref/pod-disruption-budgets.html>`_ 를 참조하십시오.

source: Nova config dependency
de: Nova-Konfigurationsabhängigkeit
ko_kr: Nova config 의존성

source: OSLO-Config Values
de: OSLO-Config Werte
ko_kr: OSLO-Config 값

source: OpenStack-Helm defines a centralized logging mechanism to provide insight into the state of the OpenStack services and infrastructure components as well as underlying Kubernetes platform. Among the requirements for a logging platform, where log data can come from and where log data need to be delivered are very variable. To support various logging scenarios, OpenStack-Helm should provide a flexible mechanism to meet with certain operation needs.
de: OpenStack-Helm definiert einen zentralen Protokollierungsmechanismus, der Einblick in den Status der OpenStack-Services und der Infrastrukturkomponenten sowie der zugrunde liegenden Kubernetes-Plattform gibt. Zu den Anforderungen für eine Protokollierungsplattform, von der Protokolldaten kommen und wo Protokolldaten geliefert werden müssen, gehören sehr unterschiedliche. Um verschiedene Protokollierungsszenarien zu unterstützen, sollte OpenStack-Helm einen flexiblen Mechanismus bereitstellen, um bestimmte Betriebsanforderungen zu erfüllen.
id: OpenStack-Helm mendefinisikan mekanisme logging terpusat untuk memberikan wawasan tentang keadaan layanan OpenStack dan komponen infrastruktur serta platform Kubernetes yang mendasari. Di antara persyaratan untuk platform logging, di mana data log dapat berasal dari dan di mana data log harus dikirimkan sangat bervariasi. Untuk mendukung berbagai skenario logging, OpenStack-Helm harus menyediakan mekanisme yang fleksibel untuk memenuhi kebutuhan operasi tertentu.
ko_kr: OpenStack-Helm은 OpenStack 서비스와 인프라 구성요소의 상태 뿐만 아니라 기본 Kubernetes 플랫폼에 대한 통찰력을 제공하는 중앙 집중식 로깅 메커니즘을 정의합니다. 로깅 플랫폼에 대한 요구사항 중 로그 데이터를 가져올 곳과 로그 데이터를 전달되어야 할 곳은 매우 다양합니다. 다양한 로깅 시나리오를 지원하기 위해서, OpenStack-Helm은 특정 작업 요구를 충족할 수 있는 유연한 메커니즘을 제공해야 합니다.

source: OpenStack-Helm generates oslo-config compatible formatted configuration files for services dynamically from values specified in a yaml tree. This allows operators to control any and all aspects of an OpenStack services configuration. An example snippet for an imaginary Keystone configuration is described here:
de: OpenStack-Helm generiert oslo-config-kompatible formatierte Konfigurationsdateien für Dienste dynamisch aus Werten, die in einer Yaml-Struktur angegeben sind. Dies ermöglicht Betreibern, alle Aspekte einer OpenStack-Dienstkonfiguration zu steuern. Ein Beispiel-Snippet für eine imaginäre Keystone-Konfiguration wird hier beschrieben:
id: OpenStack-Helm menghasilkan file konfigurasi yang diformat oslo-config kompatibel untuk layanan secara dinamis dari nilai yang ditentukan dalam pohon yaml (yaml tree). Ini memungkinkan operator untuk mengontrol setiap dan semua aspek dari konfigurasi layanan OpenStack. Contoh cuplikan untuk konfigurasi Keystone imajiner dijelaskan di sini:
ko_kr: OpenStack-Helm은 yaml 트리에 지정된 값에서 동적으로 서비스를 위한 oslo-config 호환 형식의 구성 파일을 생성합니다. 이는 운영자가 OpenStack 서비스 구성 전반을 제어할 수 있도록 합니다. 가상의 키스톤 구성에 대한 짧은 예시가 여기 있습니다:

source: OpenStack-Helm leverages PodDistruptionBudgets to enforce quotas that ensure that a certain number of replicas of a pod are available at any given time. This is particularly important in the case when a Kubernetes node needs to be drained.
de: OpenStack-Helm nutzt PodDistrusionBudgets, um Kontingente zu erzwingen, die sicherstellen, dass zu einem bestimmten Zeitpunkt eine bestimmte Anzahl von Replikaten eines Pods verfügbar ist. Dies ist besonders wichtig in dem Fall, wenn ein Kubernetes-Knoten entleert werden muss.
id: OpenStack-Helm memanfaatkan PodDistruptionBudgets untuk menegakkan kuota yang memastikan bahwa sejumlah replika pod tertentu tersedia pada waktu tertentu. Ini sangat penting dalam kasus ketika node Kubernetes perlu dikuras.
ko_kr: OpenStack-Helm은 주어진 시간에 특정 수의 pod 복제본의 가용성을 보장하도록 할당량을 강제하기 위해 PodDistruptionBudget을 활용합니다. 이는 Kubernetes 노드가 빠져야 될 필요가 있는 경우에 특히 중요합니다.

source: OpenStack-Helm provides fast and lightweight log forwarder and full featured log aggregator complementing each other providing a flexible and reliable solution. Especially, Fluent-bit is used as a log forwarder and Fluentd is used as a main log aggregator and processor.
de: OpenStack-Helm bietet einen schnellen und leichten Log Forwarder und einen voll funktionsfähigen Log Aggregator, die sich gegenseitig ergänzen und eine flexible und zuverlässige Lösung bieten. Insbesondere wird Fluent-Bit als Protokollweiterleitung und Fluentd als Hauptprotokollaggregator und -prozessor verwendet.
id: OpenStack-Helm menyediakan log forwarder yang cepat dan ringan dan agregator log fitur lengkap yang saling melengkapi menyediakan solusi yang fleksibel dan dapat diandalkan. Terutama, Fluent-bit digunakan sebagai log forwarder dan Fluentd digunakan sebagai aggregator dan prosesor log utama.
ko_kr: OpenStack-Helm은 신속하고 가벼운 로그 전달자와 완전한 기능을 갖춘 로그 수집기를 제공하여 서로 보완하여 유연하고 신뢰할 수 있는 솔루션을 제공합니다. 특히, Fluent-bit는 로그 전달자로 사용되고 Fluentd는 주 로그 수집기와 프로세서로 사용됩니다.

source: Other SDNs
de: Andere SDNs
id: SDN lainnya
ko_kr: 다른 SDN들

source: Other networking services provided by Neutron are:
de: Andere Netzwerkdienste von Neutron sind:
id: Layanan jaringan lain yang disediakan oleh Neutron adalah:
ko_kr: Neutron에 의해 제공되는 다른 네트워킹 서비스:

source: SDNs implementing ML2 driver can add extra/plugin-specific configuration options in `neutron/ml2/plugins/ml2_conf.ini`. Or define its own `ml2_conf_<name>.ini` file where configs specific to the SDN would be placed.
de: SDNs, die ML2-Treiber implementieren, können zusätzliche/pluginspezifische Konfigurationsoptionen in `neutron/ml2/plugins/ml2_conf.ini` hinzufügen. Oder definieren Sie eine eigene `ml2_conf_ <name> .ini` Datei, in der Configs, die für das SDN spezifisch sind, platziert werden.
id: Mengimplementasikan driver MLN SDN dapat menambahkan opsi konfigurasi extra/plugin-specific di `neutron/ml2/plugins/ml2_conf.ini`. Atau tentukan sendiri file `ml2_conf_<name>.ini` di mana konfigurasi khusus untuk SDN akan ditempatkan.
ko_kr: ML2 드라이버를 구현하는 SDN은 extra/plugin-specific 구성 옵션을 `neutron/ml2/plugins/ml2_conf.ini`에 추가할 수 있습니다. 또는 SDN의 고유 구성이 배치될 자체 `ml2_conf_<name>.ini` 파일을 정의하십시오.
