Repository: openstack/openstack-helm
Catalog: doc/source/locale/*/LC_MESSAGES/doc-install.po
Languages: id

source: Implementing the FQDN overrides **must** be done at install time. If you run these as helm upgrades, Ingress will notice the updates though none of the endpoint build-out jobs will run again, unless they are cleaned up manually or using a tool like Armada.
id: Menerapkan FQDN mengesampingkan **must** dilakukan pada waktu instalasi. Jika Anda menjalankan ini sebagai peningkatan helm, Ingress akan melihat pembaruan meskipun tidak ada tugas build-out endpoint yang akan berjalan lagi, kecuali mereka dibersihkan secara manual atau menggunakan alat seperti Armada.

source: In order to access your OpenStack deployment on Kubernetes we can use the Ingress Controller or NodePorts to provide a pathway in. A background on Ingress, OpenStack-Helm fully qualified domain name (FQDN) overrides, installation, examples, and troubleshooting will be discussed here.
id: Untuk mengakses penyebaran OpenStack Anda di Kubernetes kita dapat menggunakan Ingress Controller atau NodePorts untuk menyediakan jalur masuk (pathway in). Latar belakang tentang Ingress, OpenStack-Helm yang memenuhi syarat nama domain lengkap (FQDN) menimpa, pemasangan, contoh, dan pemecahan masalah akan dibahas di sini .

source: In order to allow OVS inside a pod to make use of hugepages, the corresponding type and amount of hugepages must be specified in the resource section of the OVS chart's values.yaml:
id: Untuk memungkinkan OVS di dalam pod menggunakan hugepage, jenis dan jumlah hugepage yang sesuai harus ditentukan di bagian sumber daya dari OVS chart's values.yaml:

source: In order to deploy OSH behind a proxy, add the following entries to ``openstack-helm-infra/tools/gate/devel/local-vars.yaml``:
id: Untuk menggunakan OSH di belakang proxy, tambahkan entri berikut ke ``openstack-helm-infra/tools/gate/devel/local-vars.yaml``:

source: In order to deploy OpenStack-Helm behind corporate proxy servers, add the following entries to ``openstack-helm-infra/tools/gate/devel/local-vars.yaml``.
id: Untuk menyebarkan OpenStack-Helm di belakang server proxy perusahaan, tambahkan entri berikut ini ``openstack-helm-infra/tools/gate/devel/local-vars.yaml``.

source: In order to drive towards a production-ready OpenStack solution, our goal is to provide containerized, yet stable `persistent volumes <https://kubernetes.io/docs/concepts/storage/persistent-volumes/>`_ that Kubernetes can use to schedule applications that require state, such as MariaDB (Galera). Although we assume that the project should provide a "batteries included" approach towards persistent storage, we want to allow operators to define their own solution as well. Examples of this work will be documented in another section, however evidence of this is found throughout the project. If you find any issues or gaps, please create a `story <https://storyboard.openstack.org/#!/project/886>`_ to track what can be done to improve our documentation.
id: Untuk menuju solusi OpenStack yang siap produksi, tujuan kami adalah menyediakan paket kemas (containerized), namun stabil `persistent volumes <https://kubernetes.io/docs/concepts/storage/persistent-volumes/>`_ yang dapat Kubernetes gunakan untuk menjadwalkan aplikasi yang membutuhkan status, seperti MariaDB (Galera). Meskipun kami menganggap bahwa proyek harus memberikan pendekatan "batteries included" terhadap penyimpanan persisten, kami ingin mengizinkan operator untuk menentukan solusi mereka sendiri juga. Contoh pekerjaan ini akan didokumentasikan di bagian lain, namun bukti ini ditemukan di seluruh proyek. Jika Anda menemukan masalah atau celah, silakan buat `story <https://storyboard.openstack.org/#!/project/886>`_ untuk melacak apa yang dapat dilakukan untuk meningkatkan dokumentasi kami.

source: In the example above, bonding isn't used and hence an empty list is passed in the "bonds" section.
id: Dalam contoh di atas, ikatan tidak digunakan dan karenanya daftar kosong dilewatkan di bagian "bonds".

source: In this example, 8 hugepages of 1G size have been allocated. 2 of those are being used and 6 are still available.
id: Dalam contoh ini, 8 hugepage ukuran 1G telah dialokasikan. 2 dari mereka sedang digunakan dan 6 masih tersedia.

source: In this example, the NIC with PCI-ID 0000:00:04.0 is connected to NUMA socket 1. As a result, this NIC can only be used by OVS if
id: Dalam contoh ini, NIC dengan PCI-ID 0000:00:04.0 terhubung ke soket NUMA 1. Akibatnya, NIC ini hanya dapat digunakan oleh OVS jika

source: Install OpenStack packages
id: Instal paket OpenStack

source: Install OpenStack-Helm
id: Memasang OpenStack-Helm

source: Install k8s Minikube
id: Instal k8s Minikube

source: Installation
id: Instalasi

source: It can be configured to give services externally-reachable URLs, load balance traffic, terminate SSL, offer name based virtual hosting, and more.
id: Ini dapat dikonfigurasi untuk memberikan layanan URL yang dapat dijangkau secara eksternal, memuat keseimbangan lalu lintas (load balance traffic), mengakhiri SSL, menawarkan virtual hosting berbasis nama, dan banyak lagi.

source: It is recommended to add your own existing DNS nameserver entries to avoid losing connection.
id: Disarankan untuk menambahkan entri server nama DNS Anda sendiri yang ada untuk menghindari kehilangan koneksi.

source: Kubernetes Preparation
id: Persiapan Kubernetes

source: Kubernetes and Common Setup
id: Kubernetes dan Pengaturan Umum

source: Latest Version Installs
id: Pemasangan Versi Terbaru

source: List the keypair(s) generated during the script execution::
id: Daftar keypair(s) yang dihasilkan selama eksekusi skrip::

source: List the stacks created during script execution which will need to be deleted::
id: Daftar stacks yang dibuat selama eksekusi skrip yang perlu dihapus ::

source: Look for *server* configuration with a *server_name* matching your desired FQDN
id: Carilah konfigurasi *server* dengan *server_name* sesuai dengan FQDN yang Anda inginkan

source: Managing and configuring a Kubernetes cluster is beyond the scope of OpenStack-Helm and this guide.
id: Mengelola dan mengkonfigurasi kluster Kubernetes berada di luar lingkup OpenStack-Helm dan panduan ini.

source: Manually remove the keypair directories created from the script in the ~/.ssh directory::
id: Hapus secara manual direktori keypair yang dibuat dari skrip di ~/.ssh directory::

source: Many of the default container images that are referenced across OpenStack-Helm charts are not intended for production use; for example, while LOCI and Kolla can be used to produce production-grade images, their public reference images are not prod-grade. In addition, some of the default images use ``latest`` or ``master`` tags, which are moving targets and can lead to unpredictable behavior. For production-like deployments, we recommend building custom images, or at minimum caching a set of known images, and incorporating them into OpenStack-Helm via values overrides.
id: Banyak image kontainer default yang direferensikan di chart OpenStack-Helm tidak dimaksudkan untuk penggunaan produksi; misalnya, sementara LOCI dan Kolla dapat digunakan untuk menghasilkan image tingkat produksi, image referensi publik mereka tidak bermutu (not prod-grade). Selain itu, beberapa image default menggunakan tag ``latest`` atau ``master``, yang merupakan target bergerak dan dapat menyebabkan perilaku yang tidak dapat diprediksi. Untuk penyebaran seperti produksi, kami menyarankan Anda untuk membuat image khusus, atau minimal cache satu set image yang dikenal, dan menggabungkannya ke OpenStack-Helm melalui penggantian nilai.

source: More information can be found in the `Openvswitch documentation <http://docs.openvswitch.org/en/latest/intro/install/dpdk/>`_.
id: Informasi lebih lanjut dapat ditemukan di `Openvswitch documentation <http://docs.openvswitch.org/en/latest/intro/install/dpdk/>`_.

source: More information on how to allocate and configure hugepages on the host OS can be found in the `Openvswitch documentation <http://docs.openvswitch.org/en/latest/intro/install/dpdk/>`_.
id: Informasi lebih lanjut tentang cara mengalokasikan dan mengonfigurasi hugepage pada OS host dapat ditemukan di `Openvswitch documentation <http://docs.openvswitch.org/en/latest/intro/install/dpdk/>`_.

source: Neutron TaaS support in Openstack-Helm commits:
id: Dukungan Neutron TaaS di komit Openstack-Helm:

source: Neutron and Horizon LOCI images
id: image Neutron dan Horizon LOCI

source: Note if you need to make a DNS change, you will have to do uninstall (``helm delete <chart>``) and install again.
id: Catatan jika Anda perlu membuat perubahan DNS, Anda harus melakukan uninstall (``helm delete <chart>``) dan instal lagi.

source: Note that OVS-DPDK deployment has been tested with Openstack Rocky release and Ubuntu Bionic container distributions. If the above variables aren't set, the defaults (currently Openstack Ocata and Ubuntu Xenial) will be used.
id: Perhatikan bahwa penyebaran OVS-DPDK telah diuji dengan rilis Openstack Rocky dan distribusi kontainer Ubuntu Bionic. Jika variabel di atas tidak disetel, defaultnya (saat ini Openstack Ocata dan Ubuntu Xenial) akan digunakan.

source: Note that this command will only enable you to auth successfully using the ``python-openstackclient`` CLI. To use legacy clients like the ``python-novaclient`` from the CLI, reference the auth values in ``/etc/openstack/clouds.yaml`` and run::
id: Perhatikan bahwa perintah ini hanya akan memungkinkan Anda untuk auth berhasil menggunakan ``python-openstackclient`` CLI. Untuk menggunakan klien legacy seperti ``python-novaclient`` dari CLI, referensi nilai auth di ``/etc/openstack/clouds.yaml`` dan jalankan ::

source: OSH Proxy & DNS Configuration
id: Konfigurasi Proxy & DNS OSH

source: OSH runs updates for local apt packages, so we will need to set the proxy for apt as well by adding these lines to `/etc/apt/apt.conf`:
id: OSH menjalankan pembaruan untuk paket apt lokal, jadi kami juga perlu mengatur proxy untuk apt dengan menambahkan baris-baris ini ke `/etc/apt/apt.conf`:

source: OVS startup failure
id: Kegagalan startup OVS

source: On the host or master node, install the latest versions of Git, CA Certs & Make if necessary
id: Pada host atau node master, instal versi terbaru Git, CA Certs & Make jika perlu

source: On the master node create an environment file for the cluster:
id: Pada node master buat file lingkungan untuk kluster:

source: On the master node create an inventory file for the cluster:
id: Pada node master buat file inventaris untuk kluster:

source: On the master node run the playbooks:
id: Pada node master jalankan playbook:

source: On the worker nodes:
id: Di worker nodes:

source: Once OpenStack-Helm has been deployed, the cloud can be exercised either with the OpenStack client, or the same heat templates that are used in the validation gates.
id: Setelah OpenStack-Helm dikerahkan, cloud dapat dijalankan baik dengan klien OpenStack, atau heat template yang sama yang digunakan di gate validasi.

source: Once installed, access the API's or Dashboard at `http://horizon.os.foo.org`
id: Setelah dipasang, akses API atau Dasbor di `http://horizon.os.foo.org`

source: Once the above requirements are met, start deploying Openstack Helm using the deployment scripts under the dpdk directory in an increasing order
id: Setelah persyaratan di atas terpenuhi, mulailah menggunakan Openstack Helm menggunakan skrip deployment di bawah direktori dpdk dalam urutan yang meningkat

source: Once the host has been configured the repos containing the OpenStack-Helm charts should be cloned onto each node in the cluster:
id: Setelah host dikonfigurasi, repositori yang berisi chart OpenStack-Helm harus dikloning ke setiap node dalam kluster:

source: Once the host has been configured the repos containing the OpenStack-Helm charts should be cloned:
id: Setelah host dikonfigurasi, repositori yang berisi chart OpenStack-Helm harus dikloning:

source: One can also specify the name of Openstack release and container OS distribution as overrides before running the deployment scripts, for instance,
id: Seseorang juga dapat menentukan nama rilis Openstack dan distribusi OS kontainer sebagai penggantian sebelum menjalankan skrip penyebaran, misalnya,

source: OpenStack-Helm uses the hosts networking namespace for many pods including, Ceph, Neutron and Nova components. For this, to function, as expected pods need to be able to resolve DNS requests correctly. Ubuntu Desktop and some other distributions make use of ``mdns4_minimal`` which does not operate as Kubernetes expects with its default TLD of ``.local``. To operate at expected either change the ``hosts`` line in the ``/etc/nsswitch.conf``, or confirm that it matches:
id: OpenStack-Helm menggunakan namespace jaringan host untuk banyak pod termasuk, Ceph, Neutron dan Nova komponen. Untuk ini, berfungsi, seperti yang diharapkan pod harus dapat menyelesaikan permintaan DNS dengan benar. Desktop Ubuntu dan beberapa distro lain memanfaatkan ``mdns4_minimal`` yang tidak beroperasi karena Kubernetes mengharapkan dengan TLD defaultnya ``.local``. Untuk beroperasi pada diharapkan baik mengubah baris ``host`` di ``/etc/nsswitch.conf``, atau konfirmasi bahwa itu cocok:

source: OpenStack-Helm utilizes the `Kubernetes Ingress Controller <https://kubernetes.io/docs/concepts/services-networking/ingress/>`__
id: OpenStack-Helm memanfaatkan `Kubernetes Ingress Controller <https://kubernetes.io/docs/concepts/services-networking/ingress/>`__

source: Other versions and considerations (such as other CNI SDN providers), config map data, and value overrides will be included in other documentation as we explore these options further.
id: Versi dan pertimbangan lain (seperti penyedia CNI SDN lainnya), data peta konfigurasi, dan penggantian nilai akan dimasukkan dalam dokumentasi lain saat kami mengeksplorasi opsi ini lebih lanjut.

source: Override images in Neutron chart
id: Override image dalam chart Neutron

source: Override the :code:`images` section parameters for Neutron chart with the custom LOCI image's tag, prepared as explained in above sections.
id: Override parameter bagian :code:`images` untuk chart Neutron dengan tag image LOCI kustom, disiapkan seperti dijelaskan di bagian di atas.

source: Overview
id: Ikhtisar

source: PMD threads have been assigned to NUMA socket 1.
id: Threads PMD telah ditetapkan ke soket NUMA 1.

source: Please see the supported application versions outlined in the `source variable file <https://github.com/openstack/openstack-helm-infra/blob/master/roles/build-images/defaults/main.yml>`_.
id: Silakan lihat versi aplikasi yang didukung yang diuraikan dalam `source variable file <https://github.com/openstack/openstack-helm-infra/blob/master/roles/build-images/defaults/main.yml>`_.

source: Prepare LOCI images
id: Mempersiapkan image LOCI

source: Prepare Neutron or Horizon LOCI image using this requirements image as :code:`docker build --build-arg WHEELS` command argument.
id: Mempersiapkan image Neutron atau Horizon LOCI menggunakan image persyaratan ini sebagai argumen perintah :code:`docker build --build-arg WHEELS`.

source: Prepare a requirements LOCI image with Neutron TaaS and TaaS Dashboard code installed.
id: Mempersiapkan persyaratan image LOCI dengan Neutron TaaS dan TaaS Dashboard code yang diinstal.

source: Prepare ahead of time your FQDN and DNS layouts. There are a handful of OpenStack endpoints you will want to expose for API and Dashboard access.
id: Persiapkan sebelumnya tata letak FQDN dan DNS Anda. Ada beberapa endpoint OpenStack yang ingin Anda buka untuk akses API dan Dashboard.

source: Prepare host
id: Siapkan host

source: Prepare host and openstack helm for tf
id: Siapkan host dan openstack helm untuk tf

source: Proxy Configuration
id: Konfigurasi Proxy

source: Putting it all together
id: Menyatukan semuanya

source: References
id: Referensi

source: Removing Helm Charts
id: Menghapus Helm Chart

source: Requirements
id: Persyaratan

source: Requirements LOCI image
id: Persyaratan image LOCI

source: Requirements and Host Configuration
id: Persyaratan dan Konfigurasi Host

source: Run the playbooks
id: Jalankan playbook

source: SSH-Key preparation
id: Persiapan SSH-Key

source: Set correct ownership: ``sudo chown ubuntu /etc/openstack-helm/deploy-key.pem``
id: Setel kepemilikan yang benar: ``sudo chown ubuntu /etc/openstack-helm/deploy-key.pem``

source: Set log level for TaaS
id: Setel tingkat log untuk TaaS

source: Set your local environment variables to use the proxy information. This involves adding or setting the following values in ``/etc/environment``:
id: Setel variabel lingkungan lokal Anda untuk menggunakan informasi proxy. Ini melibatkan penambahan atau pengaturan nilai berikut di ``/etc/environment``:

source: Setup Clients on the host and assemble the charts
id: Siapkan Klien pada host dan susun chart

source: Setup DNS for use cluster DNS
id: Setup DNS untuk menggunakan DNS cluster

source: Setup Neutron and Nova
id: Setup Neutron dan Nova

source: Setup OpenStack client
id: Atur klien OpenStack

source: Setup env for apply values_overrides
id: Siapkan env untuk menerapkan values_overrides

source: Setup the gateway to the public network
id: Siapkan gateway ke jaringan publik

source: System Requirements
id: Persyaratan sistem

source: TaaS Architecture
id: Arsitektur TaaS

source: TaaS dashboard plugin can be deployed simply by using custom LOCI images having TaaS Dashboard code installed (as explained in above sections), i.e. override the :code:`images` section parameters for Horizon charts:
id: Plugin dashboard TaaS dapat digunakan hanya dengan menggunakan image LOCI kustom yang memasang kode Dashboard TaaS (seperti dijelaskan di bagian di atas), misal override parameter bagian :code:`images` untuk chart Horizon:

source: TaaS plugin provides a mechanism to mirror certain traffic (for example tagged with specific VLANs) from a source VM to any traffic analyzer VM. When packet will be forwarded, the original value of source and target ip/ports information will not be altered and the system administrator will be able to run, for ex. tcpdump, on the target VM to trace these packets.
id: Plugin TaaS menyediakan mekanisme untuk mencerminkan lalu lintas tertentu (misalnya ditandai dengan VLAN tertentu) dari sumber VM ke VM penganalisa lalu lintas apa pun. Ketika paket akan diteruskan, nilai asli sumber dan informasi target ip/port tidak akan diubah dan administrator sistem akan dapat berjalan, misalnya. tcpdump, pada VM target untuk melacak paket ini.

source: Test this by ssh'ing to a node and then executing a command with 'sudo'. Neither operation should require a password.
id: Uji ini dengan ssh'ing ke node dan kemudian jalankan perintah dengan 'sudo'. Operasi tidak harus menggunakan kata sandi.

source: The NUMA socket a given NIC is connected to can be found in the ovs-vswitchd log:
id: Soket NUMA yang terhubung dengan NIC dapat ditemukan di log ovs-vswitchd:

source: The OpenStack clients and Kubernetes RBAC rules, along with assembly of the charts can be performed by running the following commands:
id: Klien OpenStack dan aturan Kubernetes RBAC, bersama dengan perakitan chart dapat dilakukan dengan menjalankan perintah berikut:

source: The `./tools/deployment/multinode/kube-node-subnet.sh` script requires docker to run.
id: Script `./tools/deployment/multinode/kube-node-subnet.sh` membutuhkan docker untuk menjalankan.

source: The ``.svc.cluster.local`` address is required to allow the OpenStack client to communicate without being routed through proxy servers. The IP address ``172.17.0.1`` is the advertised IP address for the Kubernetes API server. Replace the addresses if your configuration does not match the one defined above.
id: Alamat ``.svc.cluster.local`` diperlukan untuk memungkinkan klien OpenStack berkomunikasi tanpa diarahkan melalui server proxy. Alamat IP ``172.17.0.1`` adalah alamat IP yang diiklankan (advertised) untuk server API Kubernetes. Ganti alamat jika konfigurasi Anda tidak sesuai dengan yang didefinisikan di atas.

source: The default FQDN's for OpenStack-Helm are
id: Default FQDN untuk OpenStack-Helm adalah

source: The example above uses the default values used by ``openstack-helm-infra``.
id: Contoh di atas menggunakan nilai default yang digunakan oleh ``openstack-helm-infra``.

source: The following commands all assume that they are run from the ``/opt/openstack-helm`` directory.
id: Perintah berikut semua menganggap bahwa mereka dijalankan dari direktori ``/opt/openstack-helm``.

source: The following commands all assume that they are run from the ``openstack-helm`` directory and the repos have been cloned as above.
id: Perintah berikut semua berasumsi bahwa mereka dijalankan dari direktori ``openstack-helm`` dan repo telah dikloning seperti di atas.

source: The following steps serve as a guide to clean-up the client environment by deleting stacks and respective artifacts created during the **900-use-it.sh** script:
id: Langkah-langkah berikut berfungsi sebagai panduan untuk membersihkan lingkungan klien dengan menghapus stacks dan artefak masing-masing yang dibuat selama skrip **900-use-it.sh **:

source: The installation procedures below, will take an administrator from a new ``kubeadm`` installation to OpenStack-Helm deployment.
id: Prosedur instalasi di bawah ini, akan mengambil administrator dari instalasi ``kubeadm`` baru ke penyebaran OpenStack-Helm.

source: The mapping of CPU cores to NUMA sockets can be determined by means of ``lspci``, for instance:
id: Pemetaan cores CPU ke soket NUMA dapat ditentukan dengan menggunakan ``lspci``, misalnya:

source: The recommended minimum system requirements for a full deployment are:
id: Persyaratan sistem minimum yang disarankan untuk penyebaran lengkap adalah:

source: The script below configures Ceph to use loopback devices created in previous step as backend for ceph osds. To configure a custom block device-based backend, please refer to the ``ceph-osd`` `values.yaml <https://github.com/openstack/openstack-helm/blob/master/ceph-osd/values.yaml>`_.
id: Script di bawah mengkonfigurasi Ceph untuk menggunakan perangkat loopback yang dibuat pada langkah sebelumnya sebagai backend untuk ceph osds. Untuk mengonfigurasi backend berbasis perangkat khusus blokir, silakan merujuk ke ``ceph-osd`` `values.yaml <https://github.com/openstack/openstack-helm/blob/master/ceph-osd/values.yaml>`_.

source: The upstream Ceph image repository does not currently pin tags to specific Ceph point releases. This can lead to unpredictable results in long-lived deployments. In production scenarios, we strongly recommend overriding the Ceph images to use either custom built images or controlled, cached images.
id: Repositori image Ceph hulu saat ini tidak pin tag untuk rilis Ceph point tertentu. Hal ini dapat menyebabkan hasil yang tak terduga dalam penempatan jangka panjang. Dalam skenario produksi, kami sangat menyarankan untuk mengganti image Ceph untuk menggunakan apakah image yang dibuat khusus ataupun image yang dikontrol dan di-cache.

source: These commands will restore the environment back to a clean Kubernetes deployment, that can either be manually removed or over-written by restarting the deployment process. It is recommended to restart the host before doing so to ensure any residual state, eg. Network interfaces are removed.
id: Perintah ini akan memulihkan lingkungan kembali ke penyebaran Kubernetes bersih, yang dapat dihapus secara manual atau ditulis berlebihan dengan memulai kembali proses penerapan. Dianjurkan untuk me-restart host sebelum melakukannya untuk memastikan setiap status yang tersisa, misalnya Network interfaces dihapus.

source: These values can be retrieved by running:
id: Nilai-nilai ini dapat diambil dengan menjalankan:
