Repository: openstack/openstack-helm
Catalog: doc/source/locale/*/LC_MESSAGES/doc-devref.po
Languages: de, id, ko_kr

source: **Note:** The values defined in a PodDisruptionBudget may conflict with other values that have been provided if an operator chooses to leverage Rolling Updates for deployments. In the case where an operator defines a ``maxUnavailable`` and ``maxSurge`` within an update strategy that is higher than a ``minAvailable`` within a pod disruption budget, a scenario may occur where pods fail to be evicted from a deployment.
de: **Hinweis:** Die in einem PodDisruptionBudget definierten Werte können zu Konflikten mit anderen Werten führen, die bereitgestellt wurden, wenn ein Benutzer sich für die Verwendung von Rolling Updates für Bereitstellungen entscheidet. In dem Fall, in dem ein Operator ein ``maxUnavailable`` und ein ``maxSurge`` innerhalb einer Aktualisierungsstrategie definiert, die höher als ein ``minAvailable`` innerhalb eines Pod-Unterbrechungsbudgets ist, kann ein Szenario auftreten, bei dem die Pods nicht entfernt werden eine Bereitstellung
id: **Note:** Nilai yang ditentukan dalam PodDisruptionBudget mungkin bertentangan dengan nilai lain yang telah disediakan jika operator memilih untuk memanfaatkan Pembaruan Bergulir untuk penyebaran. Dalam kasus di mana operator mendefinisikan `` maksUnavailable`` dan `` MaxSurge`` dalam strategi pembaruan yang lebih tinggi dari `` minimum Tersedia dalam anggaran gangguan pod, skenario dapat terjadi di mana pod gagal digusur dari sebuah penyebaran.
ko_kr: **참고:** PodDisruptionBudget 에 정의된 값들은 운영자가 배포를 위한 롤링 업데이트를 활용하도록 선택한 경우 제공되는 다른 값들과 충돌할 수 있습니다. 운영자가 pod 중단 비용에서의 ``minAvailable`` 보다 큰 ``maxUnavailable`` 과 ``maxSurge`` 를 업데이트 전략으로 정의한 경우, 배포에서 pod가 제거되지 않는 시나리오가 발생할 수 있습니다.

source: :code:`neutron/templates/bin/_neutron-linuxbridge-agent-init.sh.tpl` is configuring the tunnel IP, external bridge and all bridge mappings defined in config. It is done in init container, and the IP for tunneling is shared using file :code:`/tmp/pod-shared/ml2-local-ip.ini` with main linuxbridge container.
de: :code:`neutron/templates/bin/_neutron-linuxbridge-agent-init.sh.tpl` konfiguriert die Tunnel-IP, die externe Bridge und alle in config definierten bridge-Mappings. Es wird im init-Container gemacht, und die IP für das Tunneln wird unter Verwendung der Datei :code:`/tmp/pod-shared/ml2-local-ip.ini` mit dem Haupt-linuxbridge-Container geteilt.
id: :code:`neutron/templates/bin/_neutron-linuxbridge-agent-init.sh.tpl` mengkonfigurasi IP terowongan (tunnel IP), jembatan eksternal dan semua pemetaan jembatan yang didefinisikan dalam konfigurasi. Hal ini dilakukan dalam init container, dan IP untuk tunneling dibagi menggunakan file :code:`/tmp/pod-shared/ml2-local-ip.ini` dengan wadah linuxbridge utama.
ko_kr: :code:`neutron/templates/bin/_neutron-linuxbridge-agent-init.sh.tpl`은 터널 IP, 외부 브리지, 그리고 config에 정의된 모든 브리지 매핑을 구성합니다.그것은 init 컨테이너에서 완료되고, 터널링을 위한 IP는 :code:`/tmp/pod-shared/ml2-local-ip.ini` 파일을 사용하여 linuxbridge 컨테이너와 공유됩니다.

source: A detail worth mentioning is that ovs is configured to use sockets, rather than the default loopback mechanism.
de: Ein erwähnenswertes Detail ist, dass ovs so konfiguriert ist, dass es Sockets anstelle des Standard-Loopback-Mechanismus verwendet.
id: Detail yang perlu disebutkan adalah bahwa ov dikonfigurasi untuk menggunakan soket, daripada mekanisme loopback default.
ko_kr: 언급할 가치가 있는 세부사항은 ovs가 기본 루프백 메커니즘 대신에 소켓을 사용하여 구성된다는 것입니다.

source: A long-term goal, besides being image agnostic, is to also be able to support any of the container runtimes that Kubernetes supports, even those that might not use Docker's own packaging format. This will allow the project to continue to offer maximum flexibility with regard to operator choice.
de: Ein langfristiges Ziel ist es, nicht nur abbildunabhängig zu sein, sondern auch alle Containerlaufzeiten unterstützen zu können, die von Kubernetes unterstützt werden, auch solche, die nicht das eigene Packungsformat von Docker verwenden. Auf diese Weise kann das Projekt weiterhin maximale Flexibilität hinsichtlich der Betreiberauswahl bieten.
id: Sasaran jangka panjang, selain sebagai image agnostik, juga dapat mendukung salah satu dari runtimes kontainer yang didukung Kubernetes, bahkan yang mungkin tidak menggunakan format pengepakan Docker sendiri. Ini akan memungkinkan proyek untuk terus menawarkan fleksibilitas maksimum berkaitan dengan pilihan operator.
ko_kr: 이미지에서 자유로워지는 것 외에도 장기 목표는 Kubernetes가 지원하는 모든 컨테이너 런타임도 지원할 수 있으며, Docker의 자체 패키징 포맷을 사용하지 않는 컨테이너 런타임도 지원할 수 있습니다. 이는 프로젝트에 운영자의 선택과 관련하여 최대한의 유연성을 허용할 것입니다.

source: All ``Deployment`` chart components are outfitted by default with rolling update strategies:
de: Alle ``Deployment``-Chart-Komponenten sind standardmäßig mit rollierenden Update-Strategien ausgestattet:
id: Semua komponen chart ``Deployment`` sudah dilengkapi secara default dengan strategi pembaruan bergulir:
ko_kr: 모든 ``Deployment`` 차트 구성요소는 기본적으로 롤링 업데이트 전략으로 갖춰집니다:

source: All dependencies described in neutron-dhcp-agent are valid here.
de: Alle in neutron-dhcp-agent beschriebenen Abhängigkeiten gelten hier.
id: Semua dependensi yang dijelaskan dalam neutron-dhcp-agent berlaku di sini.
ko_kr: neutron-dhcp-agent에 서술된 모든 의존성은 여기에서 유효합니다.

source: All of the above configs are endpoints or path to the specific class implementing the interface. You can see the endpoints to class mapping in `setup.cfg <https://github.com/openstack/neutron/blob/412c49b3930ce8aecb0a07aec50a9607058e5bc7/setup.cfg#L69>`_.
de: Alle oben genannten Konfigurationen sind Endpunkte oder Pfade zu der spezifischen Klasse, die die Schnittstelle implementiert. Sie können die Endpunkte für die Klassenzuordnung in `setup.cfg sehen <https://github.com/openstack/neutron/blob/412c49b3930ce8aecb0a07aec50a9607058e5bc7/setup.cfg#L69>`_.
id: Semua konfigurasi di atas adalah endpoints atau path ke kelas khusus yang mengimplementasikan antarmuka. Anda dapat melihat endpoints pemetaan kelas di `setup.cfg <https://github.com/openstack/neutron/blob/412c49b3930ce8aecb0a07aec50a9607058e5bc7/setup.cfg#L69>`_.
ko_kr: 위의 모든 구성은 인터페이스를 구현하는 특정 클래스에 대한 endpoints나 경로입니다. `setup.cfg <https://github.com/openstack/neutron/blob/412c49b3930ce8aecb0a07aec50a9607058e5bc7/setup.cfg#L69>`_에서 클래스 매핑에 대한 endpoints를 볼 수 있습니다.

source: Also note that other non-overridden values are inherited by hosts and labels with overrides. The following shows a set of example hosts and the values fed into the configmap for each:
de: Beachten Sie auch, dass andere nicht überschriebene Werte von Hosts und Labels mit Überschreibungen geerbt werden. Im Folgenden sehen Sie eine Reihe von Beispiel-Hosts und die Werte, die in die Konfigurationsdatei für jede eingegeben wurden:
id: Juga perhatikan bahwa nilai non-override lainnya diwarisi oleh host dan label dengan override. Berikut ini menunjukkan satu set contoh hosts dan nilai yang dimasukkan ke dalam configmap untuk masing-masing:
ko_kr: 또한 다른 오버라이드되지 않은 값들은 오버라이드된 호스트와 라벨에 의해 상속됨을 참고하십시오. 다음은 호스트 예시 세트와 각 configmap 에 입력된 값들을 보여줍니다:

source: An illustrative example of an ``images:`` section taken from the heat chart:
de: Ein anschauliches Beispiel für einen ``images:``-Abschnitt aus dem Heat-Chart:
id: Contoh ilustratif dari bagian ``images:``yang diambil dari heat chart:
ko_kr: heat 차트에서 가져온 ``images:`` 섹션의 실제 사례:

source: Another place where the DHCP agent is dependent on L2 agent is the dependency for the L2 agent daemonset:
de: Ein anderer Ort, an dem der DHCP-Agent vom L2-Agenten abhängig ist, ist die Abhängigkeit für den L2-Agent-Daemonset:
ko_kr: DHCP 에이전트가 L2 에이전트에 종속된 위치는 L2 에이전트 deamonset에 대한 종속성입니다:

source: As Helm stands today, several issues exist when you update images within charts that might have been used by jobs that already ran to completion or are still in flight. OpenStack-Helm developers will continue to work with the Helm community or develop charts that will support job removal prior to an upgrade, which will recreate services with updated images. An example of where this behavior would be desirable is when an updated db\_sync image has updated to point from a Mitaka image to a Newton image. In this case, the operator will likely want a db\_sync job, which was already run and completed during site installation, to run again with the updated image to bring the schema inline with the Newton release.
de: Wie Helm heute steht, gibt es mehrere Probleme, wenn Sie Abbilder in Charts aktualisieren, die möglicherweise von Aufträgen verwendet wurden, die bereits ausgeführt wurden oder sich noch im Umlauf befinden. OpenStack-Helm-Entwickler werden weiterhin mit der Helm-Community arbeiten oder Charts entwickeln, die die Entfernung von Aufgaben vor einem Upgrade unterstützen, wodurch Dienste mit aktualisierten Abbildern neu erstellt werden. Ein Beispiel dafür, wo dieses Verhalten wünschenswert wäre, ist, wenn ein aktualisiertes db\ _sync-Abbild aktualisiert wurde, um von einem Mitaka-Abbild auf ein Newton-Abbild zu zeigen. In diesem Fall möchte der Operator wahrscheinlich einen db\ _sync-Job, der bereits während der Site-Installation ausgeführt und abgeschlossen wurde, erneut mit dem aktualisierten Abbild ausführen, um das Schema mit der Newton-Version in Einklang zu bringen.
id: Saat Helm berdiri hari ini, ada beberapa masalah ketika Anda memperbarui image dalam chart yang mungkin telah digunakan oleh pekerjaan yang sudah berjalan hingga selesai atau masih dalam penerbangan (in flight). Pengembang OpenStack-Helm akan terus bekerja dengan komunitas Helm atau mengembangkan chart yang akan mendukung penghapusan pekerjaan sebelum peningkatan, yang akan menciptakan layanan dengan image yang diperbarui. Contoh di mana perilaku ini akan diinginkan adalah ketika image db\_sync yang diperbarui telah diperbarui untuk menunjuk dari image Mitaka ke citra Newton. Dalam hal ini, operator kemungkinan akan menginginkan pekerjaan db\_sync, yang sudah dijalankan dan diselesaikan selama instalasi situs, untuk dijalankan kembali dengan image yang diperbarui untuk membawa skema inline dengan rilis Newton.
ko_kr: Helm이 현재 존재하기 때문에, 이미 완료되었거나 진행 중인 작업에서 사용되었을지 모르는 차트에서 이미지 업데이트를 수행할 때 몇 가지 문제가 발생합니다. OpenStack-Helm 개발자는 Helm 커뮤니티와 계속 협력하거나 업그레이드 전에 작업 제거를 지원하는 차트를 개발하여, 업데이트된 이미지로 서비스를 다시 만들 것입니다. 이 동작이 바람직한 예는 업데이트된 db_sync 이미지가 Mitaka 이미지에서 Neuton 이미지를 가리키도록 업데이트 된 경우입니다. 이 경우, 운영자는 사이트 설치 중에 이미 실행되고 완료된 db_sync 작업으로 Newton 릴리즈의 스키마를 가져와 업데이트된 이미지로 다시 실행하기를 원할 수 있습니다.

source: As an example, this line uses the ``endpoint_type_lookup_addr`` macro in the ``helm-toolkit`` chart (since it is used by all charts). Note that there is a second convention here. All ``{{ define }}`` macros in charts should be pre-fixed with the chart that is defining them. This allows developers to easily identify the source of a Helm macro and also avoid namespace collisions. In the example above, the macro ``endpoint_type_look_addr`` is defined in the ``helm-toolkit`` chart. This macro is passing three parameters (aided by the ``tuple`` method built into the go/sprig templating library used by Helm):
de: Als Beispiel verwendet diese Zeile das `endpoint_type_lookup_addr`-Makro im` `helm-toolkit``-Chart (da es von allen Charts verwendet wird). Beachten Sie, dass es hier eine zweite Konvention gibt. Alle ``{{define}}`` `Makros in Charts sollten mit dem Chart vordefiniert sein, das sie definiert. Dies ermöglicht Entwicklern, die Quelle eines Helm-Makros leicht zu identifizieren und auch Namensraum-Kollisionen zu vermeiden. Im obigen Beispiel ist das Makro ``endpoint_type_look_addr`` im Chart ``helm-toolkit`` definiert. Dieses Makro übergibt drei Parameter (unterstützt durch die ``tuple`` Methode, die in die von Helm verwendete go/sprig Templating-Bibliothek eingebaut ist):
id: Sebagai contoh, baris ini menggunakan makro ``endpoint_type_lookup_addr`` dalam chart ``helm-toolkit``` (karena ini digunakan oleh semua charts). Perhatikan bahwa ada konvensi kedua di sini. Semua `` {{define}} `` macro dalam charts harus be pre-fixed dengan chart yang mendefinisikannya. Ini memungkinkan pengembang untuk dengan mudah mengidentifikasi sumber makro Helm dan juga menghindari tabrakan namespace. Dalam contoh di atas, makro ``endpoint_type_look_addr`` ditentukan dalam chart ``helm-toolkit``. Makro ini melewati tiga parameter (dibantu oleh metode ``tuple`` yang dibangun di dalam go/sprig templating library yang digunakan oleh Helm):
ko_kr: 한 예로, 이 명령줄은 ``endpoint_type_lookup_addr`` 매크로를 ``helm-toolkit`` 차트에 사용합니다(모든 차트에서 사용되기 때문에). 여기서 두 번째 규칙이 있음을 참고하십시오. 차트의 모든 ``{{ define }}`` 매크로는 그들을 정의하는 차트로 미리 수정되어야 합니다. 이는 개발자들이 Helm 매크로의 소스를 쉽게 식별하고 네임스페이스 충돌을 피할 수 있습니다. 위의 예시에서, ``endpoint_type_look_addr`` 매크로는 ``helm-toolkit`` 차트에 정의되어 있습니다. 이 매크로는 3개의 매개 변수를 전달합니다(Helm이 사용하는 go/sprig templating 라이브러리에 내장 된 ``tuple`` 메소드에 의해 지원됩니다):

source: As part of Neutron chart, this daemonset is running Neutron OVS agent. It is dependent on having :code:`openvswitch-db` and :code:`openvswitch-vswitchd` deployed and ready. Since its the default choice of the networking backend, all configuration is in place in `neutron/values.yaml`. :code:`neutron-ovs-agent` should not be deployed when another SDN is used in `network.backend`.
de: Als Teil des Neutron-Charts wird in diesem Daemonset der Neutronen-OVS-Agent ausgeführt. Es ist abhängig von :code:`openvswitch-db` und :code:`openvswitch-vswitchd` bereitgestellt und bereit. Da es die Standardauswahl des Netzwerk-Backends ist, ist die gesamte Konfiguration in `neutron/values.yaml` vorhanden. :code:`neutron-ovs-agent` sollte nicht eingesetzt werden, wenn ein anderes SDN in` network.backend` verwendet wird.
id: Sebagai bagian dari Neutron chart, daemon ini menjalankan agen Neutron OVS. Ini tergantung pada pemilikan :code:`openvswitch-db` dan :code:`openvswitch-vswitchd` disebarkan dan siap. Karena ini adalah pilihan default dari backend jaringan, semua konfigurasi sudah ada di `neutron/values.yaml`. :code:`neutron-ovs-agent` tidak boleh digunakan ketika SDN lain digunakan dalam` network.backend`.
ko_kr: Neutron 차트의 일부로서, 이 데몬세트는 Neutron OVS 에이전트를 실행 중입니다. 그것은 :code:`openvswitch-db`와 :code:`openvswitch-vswitchd`를 배포하고 준비하는데 의존합니다. 네트워킹 백엔드 기본 선택이기 때문에, 모든 구성은 `neutron/values.yaml`에 위치합니다. 다른 SDN이 `network.backend`에서 사용될 때 :code:`neutron-ovs-agent`를 배포해서는 안됩니다.

source: By default, each endpoint is located in the same namespace as the current service's helm chart. To connect to a service which is running in a different Kubernetes namespace, a ``namespace`` can be provided for each individual endpoint.
de: Standardmäßig befindet sich jeder Endpunkt im selben Namespace wie das Steuerdiagramm des aktuellen Dienstes. Um eine Verbindung zu einem Dienst herzustellen, der in einem anderen Kubernetes-Namespace ausgeführt wird, kann für jeden einzelnen Endpunkt ein ``Namespace`` bereitgestellt werden.
ko_kr: 기본적으로, 각 endpoint는 현재 서비스의 helm 차트와 같은 네임스페이스에 위치합니다. 다른 Kubernetes 네임 스페이스에서 실행중인 서비스에 연결하여 각 endpoint에 ``namespace`` 를 제공할 수 있습니다.

source: Charts should not use hard coded values such as ``http://keystone-api:5000`` because these are not compatible with operator overrides and do not support spreading components out over various namespaces.
de: Charts sollten keine fest codierten Werte wie ``http://keystone-api:5000`` verwenden, da diese nicht mit Operator-Überschreibungen kompatibel sind und keine Verteilung von Komponenten über verschiedene Namespaces unterstützen.
id: Charts tidak boleh menggunakan nilai berkode keras (hard coded values) seperti ``http://keystone-api:5000`` karena ini tidak kompatibel dengan penggantian operator dan tidak mendukung penyebaran komponen di berbagai namespaces.
ko_kr: 차트는 ``http://keystone-api:5000`` 과 같은 하드 코딩된 값을 사용하면 안됩니다. 왜냐하면 이 값들은 운영자의 오버라이드와 호환되지 않으며 다양한 네임스페이스로 확장되는 구성요소들을 지원하지 않기 때문입니다.

source: Configuration of OVS bridges can be done via `neutron/templates/bin/_neutron-openvswitch-agent-init.sh.tpl`. The script is configuring the external network bridge and sets up any bridge mappings defined in :code:`network.auto_bridge_add`. These values should align with :code:`conf.plugins.openvswitch_agent.ovs.bridge_mappings`.
de: Die Konfiguration von OVS-Bridges kann über `neutron/templates/bin/_neutron-openvswitch-agent-init.sh.tpl` erfolgen. Das Skript konfiguriert die externe Netzwerkbrücke und richtet alle in :code:`network.auto_bridge_add` definierten Brückenzuordnungen ein. Diese Werte sollten übereinstimmen mit :code:`conf.plugins.openvswitch_agent.ovs.bridge_mappings`.
ko_kr: OVS 브리지의 구성은 `neutron/templates/bin/_neutron-openvswitch-agent-init.sh.tpl`을 통해 완료될 수 있습니다. 이 스크립트는 외부 네트워크 브리지를 구성하고 :code:`network.auto_bridge_add`에 정의된 브리지 매핑을 설정합니다. 이 값들은 :code:`conf.plugins.openvswitch_agent.ovs.bridge_mappings`에 맞추어야 합니다.

source: Configure neutron-server with SDN specific core_plugin/mechanism_drivers.
de: Konfigurieren Sie den Neutronenserver mit SDN-spezifischen core_plugin/mechanism_drivers.
id: Konfigurasikan neutron-server dengan SDN specific core_plugin/mechanism_drivers.
ko_kr: SDN 특정 core_plugin/mechanism_drivers를 사용하여 neutron-server를 구성하십시오.

source: Configuring network plugin
de: Netzwerk-Plugin konfigurieren
id: Mengonfigurasi plugin jaringan
ko_kr: 네트워크 플러그인 구성

source: Contents:
de: Inhalt:
id: Contents (isi):
ko_kr: 목차:

source: Create separate chart with new SDN deployment method.
de: Erstellen Sie ein separates Chart mit der neuen SDN-Bereitstellungsmethode.
id: Buat chart terpisah dengan metode penerapan SDN baru.
ko_kr: 새로운 SDN 배포 방법으로 별도의 차트를 생성하십시오.

source: Currently OpenStack-Helm supports OpenVSwitch and LinuxBridge as a network virtualization engines. In order to support many possible backends (SDNs), modular architecture of Neutron chart was developed. OpenStack-Helm can support every SDN solution that has Neutron plugin, either core_plugin or mechanism_driver.
de: Derzeit unterstützt OpenStack-Helm OpenVSwitch und LinuxBridge als Netzwerk-Virtualisierungs-Engines. Um viele mögliche Backends (SDNs) zu unterstützen, wurde die modulare Architektur des Neutronendiagramms entwickelt. OpenStack-Helm kann jede SDN-Lösung unterstützen, die über das Neutron-Plugin core_plugin oder mechanism_driver verfügt.
id: Saat ini OpenStack-Helm mendukung OpenVSwitch dan LinuxBridge sebagai mesin virtualisasi jaringan. Untuk mendukung banyak kemungkinan backend (SDNs), arsitektur modular Neutron chart dikembangkan. OpenStack-Helm dapat mendukung setiap solusi SDN yang memiliki plugin Neutron, baik core_plugin atau mechanism_driver.
ko_kr: 현재 OpenStack-Helm은 OpenVSwitch 및 LinuxBridge를 네트워크 가상화 엔진으로 지원합니다. 가능한 많은 backend(SDNs)들을 지원하기 위해, Neutron 차트의 모듈식 구조가 개발되었습니다. OpenStack-Helm은 core_plugin 또는 mechanism_driver인 Neutron 플러그인이 있는 모든 SDN 솔루션을 지원할 수 있습니다.

source: DHCP - auto-assign IP address and DNS info
de: DHCP - Automatische Zuweisung von IP-Adresse und DNS-Informationen
id: DHCP - auto-assign IP address dan info DNS
ko_kr: DHCP - IP 주소와 DNS 정보 자동 할당

source: DHCP agent is running dnsmasq process which is serving the IP assignment and DNS info. DHCP agent is dependent on the L2 agent wiring the interface. So one should be aware that when changing the L2 agent, it also needs to be changed in the DHCP agent. The configuration of the DHCP agent includes option `interface_driver`, which will instruct how the tap interface created for serving the request should be wired.
de: Der DHCP-Agent führt den dnsmasq-Prozess aus, der die IP-Zuweisung und DNS-Informationen bereitstellt. Der DHCP-Agent ist abhängig vom L2-Agenten, der die Schnittstelle verkabelt. Daher sollte man sich bewusst sein, dass beim Ändern des L2-Agenten auch der DHCP-Agent geändert werden muss. Die Konfiguration des DHCP-Agenten enthält die Option `interface_driver`, die anweist, wie die Tap-Schnittstelle, die zum Versorgen der Anfrage erstellt wurde, verdrahtet sein sollte.
id: Agen DHCP menjalankan proses dnsmasq yang melayani penugasan IP (IP assignment) dan info DNS. Agen DHCP tergantung pada agen L2 yang menghubungkan antar muka. Jadi orang harus menyadari bahwa ketika mengubah agen L2, itu juga perlu diubah dalam agen DHCP. Konfigurasi agen DHCP termasuk opsi `interface_driver`, yang akan menginstruksikan bagaimana antarmuka tap yang dibuat untuk melayani permintaan harus ditransfer.
ko_kr: DHCP 에이전트가 IP 할당 및 DNS 정보를 제공하는 dnsmasq 프로세스를 실행 중입니다. DHCP 에이전트는 인터페이스를 연결하는 L2 에이전트에 의존합니다. 그래서 L2 에이전트를 변경할 때 DHCP 에이전트에서 알고 있어야 하고, 또한 DHCP 에이전트에서 변경될 필요가 있습니다. DHCP 에이전트 구성은 요청을 제공하기 위해 생성된 탭 인터페이스가 어떻게 연결되어야 할지 지시할 interface_driver 옵션을 포함합니다.

source: Developer References
de: Entwicklerreferenzen
id: Referensi Pengembang
ko_kr: 개발자 참고자료

source: EFK (Elasticsearch, Fluent-bit & Fluentd, Kibana) based Logging Mechanism
de: EFK (Elasticsearch, Fluent-Bit & Fluentd, Kibana) basierte Logging Mechanismus
id: EFK (Elasticsearch, Fluent-bit & Fluentd, Kibana) berdasarkan Logging Mechanism
ko_kr: EFK (Elasticsearch, Fluent-bit & Fluentd, Kibana) 기반 로깅 매커니즘

source: Endpoints
de: Endpunkte
id: Endpoints (titik akhir)
