Repository: openstack/openstack-helm
Catalog: doc/source/locale/*/LC_MESSAGES/doc-testing.po
Languages: de, id

source: 3 Node (VM based) env.
de: 3 Knoten (VM-basiert) env.

source: 6 Nodes (VM based) env
de: 6 Knoten (VM-basiert) Env.

source: A Ceph Monitor running on voyager3 (whose Monitor database is destroyed) becomes out of quorum, and the mon-pod's status stays in ``Running`` -> ``Error`` -> ``CrashLoopBackOff`` while keeps restarting.
de: Ein Ceph-Monitor, der auf voyager3 läuft (dessen Monitor-Datenbank zerstört ist), wird aus dem Quorum und der Status des Mon-Pods bleibt in ``Running`` -> ``Error`` -> ``CrashLoopBackOff``, während der Neustart fortgesetzt wird.
id: Monitor Ceph yang berjalan di voyager3 (yang database Monitor-nya dimatikan) menjadi tidak di quorum, dan status mon-pod tetap dalam ``Running`` -> ``Error`` -> ``CrashLoopBackOff`` sementara terus restart.

source: Adding Tests
de: Hinzufügen von Tests
id: Menambahkan Tes

source: Additional information on Helm tests for OpenStack-Helm and how to execute these tests locally via the scripts used in the gate can be found in the gates_ directory.
de: Weitere Informationen zu Helm-Tests für OpenStack-Helm und wie diese Tests lokal über die im Gate verwendeten Skripte ausgeführt werden, finden Sie im Verzeichnis gates_.
id: Informasi tambahan tentang tes Helm untuk OpenStack-Helm dan cara melakukan tes ini secara lokal melalui skrip yang digunakan di gate dapat ditemukan di direktori gates_.

source: After 10+ miniutes, Ceph starts rebalancing with one node lost (i.e., 6 osds down) and the status stablizes with 18 osds.
de: Nach 10+ Minuten beginnt Ceph mit einem verlorenen Knoten (d.h. 6 OSDs nach unten) und der Status stabilisiert sich mit 18 OSDs.
id: Setelah 10+ menit, Ceph mulai menyeimbangkan kembali dengan satu node yang hilang (yaitu, 6 osds turun) dan statusnya stabil dengan 18 osds.

source: After reboot (node voyager3), the node status changes to ``NotReady``.
de: Nach dem Neustart (Knoten voyager3) ändert sich der Knotenstatus in ``NotReady``.
id: Setelah reboot (node voyager3), status node berubah menjadi ``NotReady``.

source: After the host is down (node voyager3), the node status changes to ``NotReady``.
de: Nachdem der Host ausgefallen ist (Knoten voyager3), ändert sich der Knotenstatus in ``NotReady``.
id: Setelah host mati (node voyager3), status node berubah menjadi ``NotReady``.

source: All tests should be added to the gates during development, and are required for any new service charts prior to merging. All Helm tests should be included as part of the deployment script. An example of this can be seen in this script_.
de: Alle Tests sollten während der Entwicklung zu den Gates hinzugefügt werden und sind für alle neuen Dienst-Charts vor dem Zusammenführen erforderlich. Alle Helm-Tests sollten als Teil des Bereitstellungsskripts enthalten sein. Ein Beispiel dafür ist in diesem Skript zu sehen.
id: Semua tes harus ditambahkan ke gate selama pengembangan, dan diperlukan untuk chart layanan baru sebelum penggabungan. Semua tes Helm harus dimasukkan sebagai bagian dari skrip pemasangan. Contoh ini dapat dilihat dalam skrip ini_.

source: Also, the pod status of ceph-mon and ceph-osd changes from ``NodeLost`` back to ``Running``.
de: Außerdem ändert sich der Pod-Status von ceph-mon und ceph-osd von ``NodeLost`` zurück zu ``Running``.
id: Juga, status pod ceph-mon dan ceph-osd berubah dari ``NodeLost`` kembali ke ``Running``.

source: Any Helm tests associated with a chart can be run by executing:
de: Alle Helm-Tests, die mit einem Chart verknüpft sind, können ausgeführt werden, indem Sie Folgendes ausführen:
id: Tes Helm apa pun yang terkait dengan chart dapat dijalankan dengan mengeksekusi:

source: Any templates for Helm tests submitted should follow the philosophies applied in the other templates. These include: use of overrides where appropriate, use of endpoint lookups and other common functionality in helm-toolkit, and mounting any required scripting templates via the configmap-bin template for the service chart. If Rally tests are not appropriate or adequate for a service chart, any additional tests should be documented appropriately and adhere to the same expectations.
de: Alle Vorlagen für Helm-Tests sollten den Philosophien folgen, die in den anderen Vorlagen angewendet wurden. Dazu gehören: gegebenenfalls die Verwendung von Überschreibungen, die Verwendung von Endpunkt-Suchvorgängen und anderen allgemeinen Funktionen in helm-toolkit sowie das Bereitstellen aller erforderlichen Skriptvorlagen über die Vorlage configmap-bin für das Dienstdiagramm. Wenn Rally-Tests für ein Dienst-Chart nicht angemessen oder angemessen sind, sollten alle zusätzlichen Tests angemessen dokumentiert werden und den gleichen Erwartungen entsprechen.
id: Setiap template untuk tes Helm yang diajukan harus mengikuti filosofi yang diterapkan dalam template lain. Ini termasuk: penggunaan menimpa di mana yang sesuai, penggunaan pencarian endpoint dan fungsi umum lainnya dalam helm-toolkit, dan pemasangan semua scripting template yang diperlukan melalui template configmap-bin untuk chart layanan. Jika pengujian Rally tidak sesuai atau memadai untuk chart layanan, pengujian tambahan apa pun harus didokumentasikan dengan tepat dan mematuhi harapan yang sama.

source: Capture Ceph pods statuses.
de: Capture Ceph Pods Status.

source: Capture Openstack pods statuses.
de: Capture Openstack Pods Status.

source: Capture final Ceph pod statuses:
de: Erfassen Sie die endgültigen Ceph-Pod-Status:

source: Capture final Openstack pod statuses:
de: Erfassen Sie die letzten Openstack-Pod-Status:

source: Case: 1 out of 3 Monitor Processes is Down
de: Fall: 1 von 3 Überwachungsprozesse ist inaktiv
id: Kasus: 1 dari 3 Proses Monitor Sedang Turun

source: Case: 2 out of 3 Monitor Processes are Down
de: Fall: 2 von 3 Monitor-Prozesse sind inaktiv
id: Kasus: 2 dari 3 Proses Monitor Sedang Turun

source: Case: 3 out of 3 Monitor Processes are Down
de: Fall: 3 von 3 Monitor-Prozesse sind inaktiv
id: Kasus: 3 dari 3 Proses Monitor Sedang Turun

source: Case: A OSD pod is deleted
de: Fall: Ein OSD-Pod wurde gelöscht
id: Kasus: Pod OSD dihapus

source: Case: A disk fails
de: Fall: Eine Festplatte geht kaputt
id: Kasus: Disk gagal

source: Case: A host machine where ceph-mon is running is down
de: Fall: Ein Host-Computer, auf dem ceph-mon läuft, ist inaktiv
id: Kasus: Mesin host di mana ceph-mon sedang bekerja sedang mati

source: Case: Monitor database is destroyed
de: Fall: Die Monitor-Datenbank ist zerstört
id: Kasus: Database monitor dimusnahkan

source: Case: OSD processes are killed
de: Fall: OSD-Prozesse werden abgebrochen
id: Kasus: Proses OSD dimatikan

source: Case: One host machine where ceph-mon is running is rebooted
de: Fall: Ein Host-Rechner, auf dem ceph-mon läuft, wird neu gestartet
id: Kasus: Satu mesin host di mana ceph-mon sedang dijalankan di-reboot

source: Caveats:
de: Vorbehalte:

source: Ceph Cephfs provisioner docker images.
de: Ceph Cephfs Provisioner Docker Abbilder.

source: Ceph Luminous point release images for Ceph components
de: Ceph Luminous Point Release Abbilder für Ceph-Komponenten
id: Ceph Luminous point melepaskan image untuk komponen Ceph

source: Ceph RBD provisioner docker images.
de: Ceph-RBD-Provisioner-Docker-Abbilder.

source: Ceph Resiliency
de: Ceph-Ausfallsicherheit

source: Ceph status shows that ceph-mon running on ``voyager3`` becomes out of quorum. Also, 6 osds running on ``voyager3`` are down (i.e., 18 out of 24 osds are up). Some placement groups become degraded and undersized.
de: Der Ceph-Status zeigt, dass Ceph-mon, das auf ``voyager3`` läuft, das Quorum verlässt. Außerdem sind 6 osds, die auf ``voyager3`` laufen, heruntergefahren (d.h. 18 von 24 ods sind oben). Einige Placement-Gruppen werden degradiert und zu klein.
id: Status Ceph menunjukkan bahwa ceph-mon yang berjalan pada ``voyager3`` menjadi tidak dapat digunakan. Juga, 6 osds yang berjalan pada ``voyager3`` sedang down (yaitu, 18 dari 24 osds naik). Beberapa kelompok penempatan menjadi terdegradasi dan berukuran kecil.

source: Ceph status shows that ceph-mon running on ``voyager3`` becomes out of quorum. Also, six osds running on ``voyager3`` are down; i.e., 18 osds are up out of 24 osds.
de: Der Ceph-Status zeigt, dass Ceph-mon, das auf ``voyager3`` läuft, das Quorum verlässt. Sechs osds, die auf `` voyager3`` laufen, sind ebenfalls nicht erreichbar. Das heißt, 18 Osts sind aus 24 Osts heraus.
id: Status Ceph menunjukkan bahwa ceph-mon yang berjalan pada ``voyager3`` menjadi tidak dapat digunakan. Juga, enam osds yang berjalan di ``voyager3`` turun; yaitu, 18 osds naik dari 24 osds.

source: Check Ceph Pods
de: Überprüfen Sie Ceph Pods
id: Periksa Ceph Pods

source: Check version of each Ceph components.
de: Überprüfen Sie die Version der einzelnen Ceph-Komponenten.
id: Periksa versi setiap komponen Ceph.

source: Check which images Provisionors and Mon-Check PODs are using
de: Überprüfen Sie, welche Abbilder Provisioner und Mon-Check-PODs verwenden
id: Periksa image mana yang digunakan Provisionors dan Mon-Check PODs

source: Cluster size: 4 host machines
de: Clustergröße: 4 Host-Maschinen
id: Ukuran cluster: 4 mesin host

source: Conclusion:
de: Fazit:
id: Kesimpulan:

source: Confirm Ceph component's version.
de: Bestätigen Sie die Version der Ceph-Komponente.
id: Konfirmasi versi komponen Ceph.

source: Continue with OSH multinode guide to install other Openstack charts.
de: Fahren Sie mit OSH multinode guide fort, um weitere Openstack-Charts zu installieren.
id: Lanjutkan dengan panduan multinode OSH untuk menginstal chart Openstack lainnya.

source: Deploy and Validate Ceph
de: Bereitstellen und Validieren von Ceph
id: Menyebarkan dan Memvalidasi Ceph

source: Disk Failure
de: Festplattenfehler
id: Kegagalan Disk

source: Docker Images:
de: Docker Abbilder:

source: Every OpenStack-Helm chart should include any required Helm tests necessary to provide a sanity check for the OpenStack service. Information on using the Helm testing framework can be found in the Helm repository_. Currently, the Rally testing framework is used to provide these checks for the core services. The Keystone Helm test template can be used as a reference, and can be found here_.
de: Jedes OpenStack-Helm-Chart sollte alle erforderlichen Helm-Tests enthalten, die für eine Plausibilitätsprüfung des OpenStack-Dienstes erforderlich sind. Informationen zur Verwendung des Helm-Test-Frameworks finden Sie im Helm-Repository. Momentan wird das Rallyetest-Framework verwendet, um diese Überprüfungen für die Kerndienste bereitzustellen. Die Keystone Helm Testvorlage kann als Referenz verwendet werden und kann hier gefunden werden.
id: Setiap OpenStack-Helm chart harus menyertakan tes Helm yang diperlukan untuk memberikan pemeriksaan (sanity check) kewarasan untuk layanan OpenStack. Informasi tentang menggunakan kerangka pengujian Helm dapat ditemukan di repositori Helm. Saat ini, kerangka pengujian Rally digunakan untuk menyediakan pemeriksaan ini untuk layanan inti. Kerangka uji Keystone Helm dapat digunakan sebagai referensi, dan dapat ditemukan di sini_.

source: Find that Ceph is healthy with a lost OSD (i.e., a total of 23 OSDs):
de: Finde heraus, dass Ceph gesund ist mit einem verlorenen OSD (d.h. insgesamt 23 OSDs):
id: Temukan bahwa Ceph sehat dengan OSD yang hilang (yaitu, total 23 OSD):

source: Follow all steps from OSH multinode guide with below changes.
de: Befolgen Sie alle Schritte des OSH-Multinode-Handbuchs mit den folgenden Änderungen.
id: Ikuti semua langkah dari panduan multinode OSH dengan perubahan di bawah ini.

source: Followed OSH multinode guide steps to setup nodes and install K8s cluster
de: Gefolgt OSH Multinode Guide Schritte zum Einrichten von Knoten und installieren K8s-Cluster

source: Followed OSH multinode guide steps upto Ceph install
de: Gefolgt OSH Multinode Guide Schritte bis Ceph Installation
id: Mengikuti panduan multinode OSH langkah-langkah upto Ceph menginstal

source: Following is a partial part from script to show changes.
de: Es folgt ein Teil des Skripts, um Änderungen anzuzeigen.
id: Berikut ini adalah bagian parsial dari skrip untuk menunjukkan perubahan.

source: From the Kubernetes cluster, remove the failed OSD pod, which is running on ``voyager4``:
de: Entfernen Sie im Kubernetes-Cluster den fehlerhaften OSD-Pod, der auf ``voyager4`` läuft:
id: Dari kluster Kubernetes, hapus pod OSD yang gagal, yang berjalan di ``voyager4``:

source: Hardware Failure
de: Hardwarefehler
id: Kegagalan perangkat keras

source: Host Failure
de: Hostfehler

source: In the mean time, we monitor the status of Ceph and noted that it takes about 30 seconds for the 6 OSDs to recover from ``down`` to ``up``. The reason is that Kubernetes automatically restarts OSD pods whenever they are killed.
de: In der Zwischenzeit überwachen wir den Status von Ceph und stellen fest, dass es etwa 30 Sekunden dauert, bis die 6 OSDs von ``down`` nach ``up`` zurückkehren. Der Grund dafür ist, dass Kubernetes OSD-Pods automatisch neu startet, wenn sie getötet werden.
id: Sementara itu, kami memantau status Ceph dan mencatat bahwa dibutuhkan sekitar 30 detik untuk 6 OSD untuk memulihkan dari ``down`` ke ``up``. Alasannya adalah Kubernetes secara otomatis merestart pod OSD setiap kali mereka dimatikan.

source: In the mean time, we monitored the status of Ceph and noted that it takes about 24 seconds for the killed Monitor process to recover from ``down`` to ``up``. The reason is that Kubernetes automatically restarts pods whenever they are killed.
de: In der Zwischenzeit haben wir den Status von Ceph überwacht und festgestellt, dass es etwa 24 Sekunden dauert, bis sich der getötete Monitor-Prozess von ``down`` nach ``up`` zurückholt. Der Grund ist, dass Kubernetes automatisch Pods neu startet, wenn sie getötet werden.
id: Sementara itu, kami memantau status Ceph dan mencatat bahwa dibutuhkan sekitar 24 detik untuk proses Monitor yang mati untuk memulihkan dari ``down`` ke ``up``. Alasannya adalah Kubernetes secara otomatis me-restart pod setiap kali mereka dimatikan.

source: Install Ceph charts (12.2.4) by updating Docker images in overrides.
de: Installieren Sie Ceph-Diagramme (12.2.4), indem Sie Docker-Abbilder in Overrides aktualisieren.
id: Instal Ceph charts (12.2.4) dengan memperbarui Docker images di overrides.

source: Install Ceph charts (version 12.2.4)
de: Installieren Sie Ceph-Diagramme (Version 12.2.4)
id: Pasang chart Ceph (versi 12.2.4)

source: Install OSH components as per OSH multinode guide.
de: Installieren Sie die Arbeitsschutzkomponenten gemäß dem OSH multinode guide.
id: Instal komponen OSH sesuai panduan multinode OSH.

source: Install Openstack charts
de: Installieren Sie Openstack-Charts
id: Pasang chart Openstack

source: It takes longer (about 1 minute) for the killed Monitor processes to recover from ``down`` to ``up``.
de: Es dauert länger (etwa 1 Minute), bis die getöteten Monitor-Prozesse von ``down`` nach ``up`` zurückkehren.
id: Diperlukan waktu lebih lama (sekitar 1 menit) untuk proses Monitor yang mati untuk memulihkan dari ``down`` ke ``up``.

source: Monitor Failure
de: Fehler beim Überwachen
id: Memantau Kegagalan

source: Note: To find the daemonset associated with a failed OSD, check out the followings:
de: Hinweis: Um den mit einem fehlgeschlagenen OSD verbundenen Daemonset zu finden, überprüfen Sie Folgendes:
id: Catatan: Untuk menemukan daemon yang terkait dengan OSD yang gagal, periksa yang berikut:

source: Number of disks: 24 (= 6 disks per host * 4 hosts)
de: Anzahl der Festplatten: 24 (= 6 Festplatten pro Host * 4 Hosts)
id: Jumlah disk: 24 (= 6 disk per host * 4 host)

source: OSD Failure
de: OSD-Fehler
id: Kegagalan OSD

source: OSD count is set to 3 based on env setup.
de: Die OSD-Anzahl wird basierend auf dem env-Setup auf 3 festgelegt.
id: Penghitungan OSD diatur ke 3 berdasarkan pada env setup.

source: Our focus lies on resiliency for various failure scenarios but not on performance or stress testing.
de: Unser Fokus liegt auf der Ausfallsicherheit für verschiedene Fehlerszenarien, jedoch nicht auf der Leistung oder dem Stresstest.
id: Fokus kami terletak pada ketahanan untuk berbagai skenario kegagalan tetapi tidak pada kinerja atau stress testing.

source: Plan:
de: Planen:
id: Rencana:

source: Recovery:
de: Wiederherstellung:
id: Pemulihan:

source: Remove the entire ceph-mon directory on voyager3, and then Ceph will automatically recreate the database by using the other ceph-mons' database.
de: Entfernen Sie das gesamte Verzeichnis ceph-mon auf voyager3, und Ceph erstellt dann automatisch die Datenbank neu, indem es die Datenbank der anderen ceph-mons verwendet.
id: Hapus seluruh direktori ceph-mon di voyager3, dan kemudian Ceph akan secara otomatis membuat ulang database dengan menggunakan database ceph-mons lainnya.

source: Remove the failed OSD (OSD ID = 2 in this example) from the Ceph cluster:
de: Entfernen Sie das fehlerhafte OSD (OSD ID = 2 in diesem Beispiel) vom Ceph-Cluster:
id: Hapus OSD yang gagal (OSD ID = 2 dalam contoh ini) dari kluster Ceph:

source: Resiliency Tests for OpenStack-Helm/Ceph
de: Resiliency Tests für OpenStack-Helm/Ceph
id: Tes Ketahanan untuk OpenStack-Helm/Ceph

source: Running Tests
de: Tests ausführen
id: Menjalankan Tes

source: Setup:
de: Konfiguration:
id: Mempersiapkan:

source: Showing partial output from kubectl describe command to show which image is Docker container is using
de: Teilausgabe von kubectl anzeigen Befehl beschreiben, welches Abbild der Docker-Container verwendet
id: Menampilkan sebagian output dari kubectl menggambarkan perintah untuk menunjukkan image mana yang digunakan oleh container Docker

source: Software Failure
de: Softwarefehler
id: Kegagalan Perangkat Lunak

source: Solution:
de: Lösung:
id: Solusi:

source: Start a new OSD pod on ``voyager4``:
de: Starten Sie einen neuen OSD-Pod auf ``voyager4``:
id: Mulai pod LED baru pada ``voyager 4``:

source: Step 1: Initial Ceph and OpenStack deployment
de: Schritt 1: Initiales Ceph und OpenStack Deployment

source: Steps:
de: Schritte:
id: Langkah:

source: Test Environment
de: Testumgebung
id: Uji Lingkungan

source: Test Scenario:
de: Testszenario:

source: Test Scenarios:
de: Testszenarien:

source: Testing
de: Testen
id: Pengujian

source: Testing Expectations
de: Erwartungen testen
id: Menguji Ekspektasi

source: The goal of our resiliency tests for `OpenStack-Helm/Ceph <https://github.com/openstack/openstack-helm/tree/master/ceph>`_ is to show symptoms of software/hardware failure and provide the solutions.
de: Das Ziel unserer Elastizitätstests für `OpenStack-Helm/Ceph <https://github.com/openstack/openstack-helm/tree/master/ceph>`_ soll Symptome von Software/Hardware-Versagen zeigen und die Lösungen bereitstellen.
id: Tujuan dari uji ketahanan kami untuk `OpenStack-Helm/Ceph <https://github.com/openstack/openstack-helm/tree/master/ceph>`_ adalah untuk menunjukkan gejala kegagalan perangkat lunak/perangkat keras dan memberikan solusi.

source: The logs of the failed mon-pod shows the ceph-mon process cannot run as ``/var/lib/ceph/mon/ceph-voyager3/store.db`` does not exist.
de: Die Protokolle des fehlgeschlagenen Mon-Pods zeigen, dass der Ceph-Mon-Prozess nicht ausgeführt werden kann, da ``/var/lib/ceph/mon/ceph-voyager3/store.db``` nicht existiert.
id: Log dari mon-pod gagal menunjukkan proses ceph-mon tidak dapat berjalan karena ``/var/lib/ceph/mon/ceph-voyager3/store.db`` tidak ada.

source: The node status of ``voyager3`` changes to ``Ready`` after the node is up again. Also, Ceph pods are restarted automatically. Ceph status shows that the monitor running on ``voyager3`` is now in quorum.
de: Der Knotenstatus von ``voyager3`` ändert sich in ``Ready``, nachdem der Knoten wieder geöffnet wurde. Außerdem werden Ceph-Pods automatisch neu gestartet. Der Ceph-Status zeigt an, dass der Monitor, der auf ``voyager3`` läuft, jetzt im Quorum ist.
id: Status node ``voyager3`` berubah menjadi ``Ready`` setelah node naik lagi. Juga, Ceph pod di-restart secara otomatis. Status Ceph menunjukkan bahwa monitor yang dijalankan pada ``voyager3`` sekarang dalam kuorum.

source: The node status of ``voyager3`` changes to ``Ready`` after the node is up again. Also, Ceph pods are restarted automatically. The Ceph status shows that the monitor running on ``voyager3`` is now in quorum and 6 osds gets back up (i.e., a total of 24 osds are up).
de: Der Knotenstatus von ``voyager3`` ändert sich in ``Ready``, nachdem der Knoten wieder geöffnet wurde. Außerdem werden Ceph-Pods automatisch neu gestartet. Der Ceph-Status zeigt an, dass der Monitor, der auf ``voyager3`` läuft, jetzt im Quorum ist und 6 ods zurück geht (d.h. insgesamt 24 ods sind aktiv).
id: Status node ``voyager3`` berubah menjadi ``Ready`` setelah node naik lagi. Juga, Ceph pod di-restart secara otomatis. Status Ceph menunjukkan bahwa monitor yang berjalan pada ``voyager3`` sekarang berada di kuorum dan 6 osds akan kembali (yaitu, total 24 osds naik).

source: The output of the Helm tests can be seen by looking at the logs of the pod created by the Helm tests. These logs can be viewed with:
de: Die Ergebnisse der Helm-Tests können Sie sehen, wenn Sie sich die Logs des Pods ansehen, die mit den Helm-Tests erstellt wurden. Diese Protokolle können angezeigt werden mit:
id: Output dari tes Helm dapat dilihat dengan melihat log dari pod yang dibuat oleh tes Helm. Log ini dapat dilihat dengan:

source: The pod status of ceph-mon and ceph-osd shows as ``NodeLost``.
de: Der Pod-Status von ceph-mon und ceph-osd wird als ``NodeLost`` angezeigt.
id: Status pod ceph-mon dan ceph-osd ditampilkan sebagai ``NodeLost``.

source: The status of the pods (where the three Monitor processes are killed) changed as follows: ``Running`` -> ``Error`` -> ``CrashLoopBackOff`` -> ``Running`` and this recovery process takes about 1 minute.
de: Der Status der Pods (wo die drei Monitor-Prozesse beendet werden) hat sich wie folgt geändert: ``Running`` -> ``Error`` -> ``CrashLoopBackOff`` -> ``Running`` und dieser Wiederherstellungsprozess dauert ungefähr 1 Minute.
id: Status pod (di mana ketiga proses Monitor dimatikan) diubah sebagai berikut: ``Running`` -> ``Error`` -> ``CrashLoopBackOff`` -> ``Running`` dan proses pemulihan ini memakan waktu sekitar 1 menit.

source: The status of the pods (where the two Monitor processes are killed) changed as follows: ``Running`` -> ``Error`` -> ``CrashLoopBackOff`` -> ``Running`` and this recovery process takes about 1 minute.
de: Der Status der Pods (wo die beiden Monitor-Prozesse beendet sind) hat sich wie folgt geändert: ``Running`` -> ``Error`` -> ``CrashLoopBackOff`` -> ``Running`` und dieser Wiederherstellungsprozess dauert ungefähr 1 Minute.
id: Status pod (di mana kedua proses Monitor mati) diubah sebagai berikut: ``Running`` -> ``Error`` -> ``CrashLoopBackOff`` -> ``Running`` dan proses pemulihan ini memakan waktu sekitar 1 menit.

source: This guide documents steps showing Ceph version upgrade. The main goal of this document is to demostrate Ceph chart update without downtime for OSH components.
de: Dieser Leitfaden dokumentiert Schritte, die das Upgrade der Ceph-Version zeigen. Das Hauptziel dieses Dokuments besteht darin, das Ceph-Diagramm-Update ohne Ausfallzeiten für Arbeitsschutzkomponenten zu demonstrieren.
id: Panduan ini mendokumentasikan langkah-langkah yang menunjukkan upgrade versi Ceph. Tujuan utama dari dokumen ini adalah untuk mendemonstrasikan pembaruan Ceph chart tanpa downtime untuk komponen OSH.

source: This is for the case when a host machine (where ceph-mon is running) is down.
de: Dies ist der Fall, wenn eine Host-Maschine (auf der ceph-mon läuft) nicht läuft.
id: Ini untuk kasus ketika mesin host (di mana ceph-mon sedang berjalan) sedang mati.
