Repository: openstack/openstack-helm
Catalog: doc/source/locale/*/LC_MESSAGES/doc-testing.po
Languages: de, id

source: This is to test a scenario when 1 out of 3 Monitor processes is down.
de: Dies dient zum Testen eines Szenarios, wenn 1 von 3 Überwachungsprozessen ausfällt.
id: Ini untuk menguji skenario ketika 1 dari 3 proses Monitor mati.

source: This is to test a scenario when 2 out of 3 Monitor processes are down. To bring down 2 Monitor processes (out of 3), we identify two Monitor processes and kill them from the 2 monitor hosts (not a pod).
de: Dies dient dazu, ein Szenario zu testen, wenn 2 von 3 Monitor-Prozessen ausgefallen sind. Um 2 Monitor-Prozesse (von 3) zu reduzieren, identifizieren wir zwei Monitor-Prozesse und töten sie von den 2 Monitor-Hosts (kein Pod).
id: Ini untuk menguji skenario ketika 2 dari 3 proses Monitor sedang down. Untuk menurunkan 2 proses Monitor (dari 3), kami mengidentifikasi dua proses Monitor dan mematikannya dari 2 monitor host (bukan pod).

source: This is to test a scenario when 3 out of 3 Monitor processes are down. To bring down 3 Monitor processes (out of 3), we identify all 3 Monitor processes and kill them from the 3 monitor hosts (not pods).
de: Dies dient zum Testen eines Szenarios, wenn 3 von 3 Monitor-Prozessen nicht verfügbar sind. Um 3 Monitor-Prozesse (von 3) zu reduzieren, identifizieren wir alle 3 Monitor-Prozesse und töten sie von den 3 Monitor-Hosts (nicht Pods).
id: Ini untuk menguji skenario ketika 3 dari 3 proses Monitor sedang down. Untuk menurunkan 3 proses Monitor (dari 3), kami mengidentifikasi semua 3 proses Monitor dan mematikannya dari 3 monitor host (bukan pod).

source: This is to test a scenario when a disk failure happens. We monitor the ceph status and notice one OSD (osd.2) on voyager4 which has ``/dev/sdh`` as a backend is down.
de: Dies dient zum Testen eines Szenarios, wenn ein Festplattenfehler auftritt. Wir überwachen den Ceph-Status und bemerken ein OSD (osd.2) auf voyager4, das ``/dev/sdh`` hat, da ein Backend nicht läuft.
id: Ini untuk menguji skenario ketika terjadi kegagalan disk. Kami memonitor status ceph dan melihat satu OSD (osd.2) di voyager4 yang memiliki ``/dev/sdh`` sebagai backend sedang down (mati).

source: This is to test a scenario when some of the OSDs are down.
de: Dies dient dazu, ein Szenario zu testen, wenn einige der OSDs nicht verfügbar sind.
id: Ini untuk menguji skenario ketika beberapa OSD turun.

source: To bring down 1 Monitor process (out of 3), we identify a Monitor process and kill it from the monitor host (not a pod).
de: Um einen Monitor-Prozess (von 3) zu reduzieren, identifizieren wir einen Monitor-Prozess und töten ihn vom Monitor-Host (kein Pod).
id: Untuk menurunkan 1 proses Monitor (dari 3), kami mengidentifikasi proses Monitor dan mematikannya dari host monitor (bukan pod).

source: To bring down 6 OSDs (out of 24), we identify the OSD processes and kill them from a storage host (not a pod).
de: Um 6 OSDs (von 24) zu reduzieren, identifizieren wir die OSD-Prozesse und löschen sie von einem Storage-Host (nicht einem Pod).
id: Untuk menurunkan 6 OSD (dari 24), kami mengidentifikasi proses OSD dan mematikannya dari host penyimpanan (bukan pod).

source: To replace the failed OSD, excecute the following procedure:
de: Um das fehlerhafte OSD zu ersetzen, führen Sie die folgenden Schritte aus:
id: Untuk mengganti OSD yang gagal, jalankan prosedur berikut:

source: Update Ceph Client chart with new overrides:
de: Aktualisieren Sie das Ceph-Client-Diagramm mit neuen Überschreibungen:
id: Perbarui Ceph Client chart dengan override baru:

source: Update Ceph Mon chart with new overrides
de: Aktualisieren Sie das Ceph Mon-Chart mit neuen Überschreibungen
id: Perbarui Ceph Mon chart dengan override baru

source: Update Ceph OSD chart with new overrides:
de: Aktualisieren Sie das Ceph-OSD-Diagramm mit neuen Überschreibungen:
id: Perbarui Ceph OSD chart dengan override baru:

source: Update Ceph Provisioners chart with new overrides:
de: Aktualisieren Sie das Ceph Provisioners-Chart mit neuen Überschreibungen:
id: Perbarui Ceph Provisioners chart dengan override baru:

source: Update ceph install script ``./tools/deployment/multinode/030-ceph.sh`` to add ``images:`` section in overrides as shown below.
de: Aktualisieren Sie ceph install script ``./tools/deployment/multinode/ 030-ceph.sh``, um ``images:`` in Überschreibungen hinzuzufügen, wie unten gezeigt.
id: Perbarui ceph install script ``./tools/deployment/multinode/030-ceph.sh`` untuk menambahkan bagian ``images:`` di override seperti yang ditunjukkan di bawah ini.

source: Update, image section in new overrides ``ceph-update.yaml`` as shown below
de: Update, Abbildausschnitt in neuen überschreibt ``ceph-update.yaml`` wie unten gezeigt
id: Pembaruan, bagian image di overrides baru ``ceph-update.yaml`` seperti yang ditunjukkan di bawah ini

source: Upgrade Ceph charts to update version
de: Aktualisieren Sie Ceph-Charts, um die Version zu aktualisieren
id: Tingkatkan Ceph charts untuk memperbarui versi

source: Upgrade Ceph charts to version 12.2.5 by updating docker images in overrides.
de: Aktualisieren Sie Ceph-Diagramme auf Version 12.2.5, indem Sie Docker-Abbilder in Overrides aktualisieren.
id: Tingkatkan Ceph chart ke versi 12.2.5 dengan memperbarui image docker di overrides.

source: Upgrade Ceph component version from ``12.2.4`` to ``12.2.5`` without downtime to OSH components.
de: Aktualisieren Sie die Ceph-Komponentenversion von ``12.2.4`` nach ``12.2.5`` ohne Ausfallzeiten für die OSH Komponenten.
id: Upgrade versi komponen Ceph dari ``12.2.4`` ke ``12.2.5`` tanpa waktu henti ke komponen OSH.

source: Use Ceph override file ``ceph.yaml`` that was generated previously and update images section as below
de: Verwenden Sie die zuvor generierte Ceph Override-Datei ``ceph.yaml`` und aktualisieren Sie den Abbildbereich wie folgt
id: Gunakan Ceph override file ``ceph.yaml`` yang telah dibuat sebelumnya dan perbarui bagian image seperti di bawah ini

source: Validate the Ceph status (i.e., one OSD is added, so the total number of OSDs becomes 24):
de: Überprüfen Sie den Ceph-Status (d.h., ein OSD wird hinzugefügt, so dass die Gesamtzahl der OSDs 24 wird):
id: Validasi status Ceph (yaitu satu OSD ditambahkan, sehingga jumlah total OSD menjadi 24):

source: We also monitored the status of the Monitor pod through ``kubectl get pods -n ceph``, and the status of the pod (where a Monitor process is killed) changed as follows: ``Running`` -> ``Error`` -> ``Running`` and this recovery process takes about 24 seconds.
de: Wir haben auch den Status des Monitor-Pods über ``kubectl get pods -n ceph`` überwacht, und der Status des Pods (wo ein Monitor-Prozess beendet wird) hat sich wie folgt geändert: ``Running`` -> ``Error`` -> ``Running`` und dieser Wiederherstellungsprozess dauert ungefähr 24 Sekunden.
id: Kami juga memantau status pod Monitor melalui ``kubectl get pods -n ceph``, dan status pod (di mana proses Monitor mati) berubah sebagai berikut: ``Running`` -> ``Error`` -> ``Running`` dan proses pemulihan ini membutuhkan waktu sekitar 24 detik.

source: We have 3 Monitors in this Ceph cluster, one on each of the 3 Monitor hosts.
de: Wir haben 3 Monitore in diesem Ceph-Cluster, einen auf jedem der 3 Monitor-Hosts.
id: Kami memiliki 3 Monitor di cluster Ceph ini, satu di masing-masing dari 3 host Monitor.

source: We intentionlly destroy a Monitor database by removing ``/var/lib/openstack-helm/ceph/mon/mon/ceph-voyager3/store.db``.
de: Wir zerstören absichtlich eine Monitor-Datenbank, indem wir ``/var/lib/openstack-helm/ceph/mon/mon/ceph-voyager3/store.db`` entfernen.
id: Kami bermaksud menghancurkan database Monitor dengan menghapus ``/var/lib/openstack-helm/ceph/mon/mon/ceph-voyager3/store.db``.

source: We monitored the status of Ceph Monitor pods and noted that the symptoms are similar to when 1 or 2 Monitor processes are killed:
de: Wir haben den Status von Ceph Monitor-Pods überwacht und festgestellt, dass die Symptome ähnlich sind, wenn 1 oder 2 Monitor-Prozesse beendet werden:
id: Kami memantau status pod Ceph Monitor dan mencatat bahwa gejalanya mirip dengan ketika 1 atau 2 proses Monitor dimatikan:

source: We monitored the status of Ceph when the Monitor processes are killed and noted that the symptoms are similar to when 1 Monitor process is killed:
de: Wir haben den Status von Ceph überwacht, als die Überwachungsprozesse beendet wurden, und festgestellt, dass die Symptome ähnlich sind, wenn 1 Überwachungsprozess beendet wird:
id: Kami memantau status Ceph ketika proses Monitor dimatikan dan mencatat bahwa gejala mirip dengan ketika 1 Proses monitor dimatikan:

source: `Disk failure <./disk-failure.html>`_
de: `Festplattenfehler <./disk-failure.html>`_

source: `Host failure <./host-failure.html>`_
de: `Hostfehler <./host-failure.html>`_

source: `Monitor failure <./monitor-failure.html>`_
de: `Monitorfehler <./monitor-failure.html>`_

source: `OSD failure <./osd-failure.html>`_
de: `OSD Fehler <./osd-failure.html>`_

source: ``Result/Observation:``
de: ``Resultat/Observation:``

source: ``Results:`` All provisioner pods got terminated at once (same time). Other ceph pods are running. No interruption to OSH pods.
de: ``Results: ``Alle Provisioner-Pods wurden gleichzeitig beendet (gleiche Zeit). Andere Ceph-Kapseln laufen. Keine Unterbrechung der OSH-Pods.
id: ``Results:`` Semua pod penyedia dihentikan sekaligus (saat yang sama). Ceph pod lainnya sedang berjalan. Tidak ada gangguan pada pod OSH.

source: ``Results:`` Mon pods got updated one by one (rolling updates). Each Mon pod got respawn and was in 1/1 running state before next Mon pod got updated. Each Mon pod got restarted. Other ceph pods were not affected with this update. No interruption to OSH pods.
de: `` Ergebnisse: ``Mon-Pods wurden nacheinander aktualisiert (rollende Updates). Jeder Mon-Pod wurde respawn und war im 1/1 Laufstatus, bevor der nächste Mon-Pod aktualisiert wurde. Jeder Mon-Pod wurde neu gestartet. Andere Ceph-Pods waren von diesem Update nicht betroffen. Keine Unterbrechung der OSH-Pods.
id: ``Results:`` Mon pod mendapat pembaruan satu per satu (pembaruan bergulir). Setiap Mon pod mendapat respawn dan berada dalam 1/1 keadaan sebelum Mon pod berikutnya diperbarui. Setiap Mon pod mulai dihidupkan ulang. Ceph pod lainnya tidak terpengaruh dengan pembaruan ini. Tidak ada gangguan pada pod OSH.

source: ``Results:`` Rolling updates (one pod at a time). Other ceph pods are running. No interruption to OSH pods.
de: `` Ergebnisse: ``Rollende Updates (jeweils ein Pod). Andere Ceph-Kapseln laufen. Keine Unterbrechung der OSH-Pods.
id: ``Results:`` Bergulir pembaruan (satu pod dalam satu waktu). Ceph pod lainnya sedang berjalan. Tidak ada gangguan pada pod OSH.

source: ``ceph_bootstrap``, ``ceph-config_helper`` and ``ceph_rbs_pool`` images are used for jobs. ``ceph_mon_check`` has one script that is stable so no need to upgrade.
de: `ceph_bootstrap``, ``ceph-config_helper`` und ``ceph_rbs_pool`` Abbilder werden für Jobs verwendet. ``ceph_mon_check`` hat ein Skript, das stabil ist, also kein Upgrade nötig ist.
id: Image ``ceph_bootstrap``, ``ceph-config_helper`` and ``ceph_rbs_pool`` digunakan untuk pekerjaan. ``ceph_mon_check`` memiliki satu skrip yang stabil sehingga tidak perlu melakukan upgrade.

source: ``series of console outputs:``
de: ``Reihe der Konsolenausgaben:``

source: Ceph version: 12.2.3
id: Ceph versi: 12.2.3

source: Helm Tests
id: Tes Helm

source: Kubernetes version: 1.10.5
id: Kubernetes versi: 1.10.5

source: Mission
id: Misi

source: Symptom:
id: Gejala:
