Repository: openstack/openstack-helm
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id, ko_kr

source: The dry-runs directory contains the rendered output of Helm dry-run installs on each of the OpenStack service charts. This gives visibility into the manifests created by the templates with the supplied values. When the dry-run gate fails, the reason should be apparent in the dry-runs output. The logs found here are helpful in identifying issues resulting from using helm-toolkit functions incorrectly or other rendering issues with gotpl.
de: Das Dry-runs-Verzeichnis enthält die gerenderte Ausgabe von Helm-Dry-Run-Installationen auf jedem der OpenStack-Dienstchart. Dadurch erhalten Sie Einblick in die Manifeste, die von den Vorlagen mit den angegebenen Werten erstellt wurden. Wenn das Dry-run-Gate versagt, sollte der Grund in der Dry-Run-Ausgabe offensichtlich sein. Die hier gefundenen Logs sind hilfreich, um Probleme zu identifizieren, die sich aus der falschen Verwendung von Helm-Toolkit-Funktionen oder anderen Rendering-Problemen mit gotpl ergeben.
id: Direktori dry-run berisi output yang diberikan dari pemasangan Helm dry-run pada masing-masing chart layanan OpenStack. Ini memberikan visibilitas ke manifes yang dibuat oleh template dengan nilai yang disediakan. Ketika gate dry-run gagal, alasannya harus jelas dalam output dry-run. Log ditemukan di sini sangat membantu dalam mengidentifikasi masalah yang dihasilkan dari penggunaan fungsi-fungsi helm-toolkit yang salah atau masalah rendering lainnya dengan gotpl.
ko_kr: dry-runs 디렉터리는 각 OpenStack 서비스 차트의 Helm 모의 설치들에서 만들어진 출력을 포함하고 있습니다. 이렇게하면 제공된 값으로 템플릿들이 만든 매니페스트를 볼 수 있습니다. 모의 게이트가 실패하면, 모의 출력에서 그 이유가 분명해야 합니다. 이곳에서 발견할 수 있는 로그는 helm-toolkit 기능들의 오용이나 gotpl로 만들어진 다른 문제들의 결과에 따른 문제들을 확인하는데 도움이 됩니다.

source: The goal of OpenStack-Helm is to provide a collection of Helm charts that simply, resiliently, and flexibly deploy OpenStack and related services on Kubernetes.
de: Das Ziel von OpenStack-Helm ist es, eine Sammlung von Helm-Charts zur Verfügung zu stellen, die OpenStack und zugehörige Dienste auf Kubernetes einfach, flexibel und flexibel bereitstellen.
id: Tujuan OpenStack-Helm adalah untuk menyediakan koleksi grafik Helm yang sederhana, tangguh, dan secara fleksibel menggunakan OpenStack dan layanan terkait di Kubernetes.
ko_kr: OpenStack-Helm 목표는 Kubernetes 위에 OpenStack 및 관련 서비스들을 단순하고, 탄력적이며, 유연하게 배포하는 Helm 차트에 대한 집합을 제공하는 데 있습니다.

source: The nodes directory contains information about the node the gate tests are running on in openstack-infra. This includes: the network interfaces, the contents of iptables, the host's resolv.conf, and the kernel IP routing table. These logs can be helpful when trying to identify issues with host networking or other issues at the node level.
de: Das Knotenverzeichnis enthält Informationen zu dem Knoten, auf dem die Gate-Tests in openstack-infra ausgeführt werden. Dazu gehören: die Netzwerkschnittstellen, der Inhalt von iptables, die resolv.conf des Hosts und die Kernel-IP-Routingtabelle. Diese Protokolle können hilfreich sein, wenn Sie versuchen, Probleme mit dem Hostnetzwerk oder andere Probleme auf Knotenebene zu identifizieren.
id: Direktori node berisi informasi tentang node dimana gate test sedang berjalan di openstack-infra. Ini termasuk: antarmuka jaringan, isi iptables, resolv.conf host, dan tabel routing IP kernel. Log ini dapat membantu ketika mencoba mengidentifikasi masalah dengan jaringan host atau masalah lain di tingkat node.
ko_kr: 노드의 디렉터리는 해당 노드에 대한 정보를 포함합니다. 게이트 테스트는 openstack-infra 내에서 동작합니다. 이것은 포함합니다: 네트워크 인터페이스, iptables 내용, 호스트의 resolv.conf, 그리고 커널 IP 라우팅 테이블. 이 로그들은 노드 레벨에서 호스트 네트워킹이나 다른 문제들을 확인하고자 할 때 도움이 됩니다.

source: This project is under active development. We encourage anyone interested in OpenStack-Helm to review our `Installation <https://docs.openstack.org/openstack-helm/latest/install/index.html>`_ documentation. Feel free to ask questions or check out our current `Storyboard backlog <https://storyboard.openstack.org/#!/project_group/64>`_.
de: Dieses Projekt wird aktiv weiterentwickelt. Wir empfehlen jedem, der an OpenStack-Helm interessiert ist, unsere `Installation` zu überprüfen <https://docs.openstack.org/openstack-helm/latest/install/index.html>`_ Dokumentation. Sie können Fragen stellen oder unseren aktuellen Storyboard-Backlog lesen <https://storyboard.openstack.org/#!/project_group/64>`_.
id: Proyek ini sedang dalam pengembangan aktif. Kami mendorong siapa pun yang tertarik dengan OpenStack-Helm untuk meninjau dokumentasi kami `Installation <https://docs.openstack.org/openstack-helm/latest/install/index.html>`_. Jangan ragu untuk bertanya atau memeriksa saat ini `Storyboard backlog <https://storyboard.openstack.org/#!/project_group/64>`_.
ko_kr: 이 프로젝트는 적극적으로 개발 중인 상태입니다. OpenStack-Helm에 대해 관심있는 분들은 `Installation <https://docs.openstack.org/openstack-helm/latest/install/index.html>`_ 문서를 살펴 보십시오. 자유롭게 질문하거나 현재 `Storyboard 백로그 <https://storyboard.openstack.org/#!/project_group/64>`_ 를 살펴봅니다.

source: This results in the gate running the following:
de: Dies führt dazu, dass das Gate folgendes ausführt:
id: Ini menghasilkan gate menjalankan berikut:
ko_kr: 게이트 실행 결과는 다음과 같습니다.

source: To evaluate a multinode installation, follow the `Bare Metal <https://docs.openstack.org/openstack-helm/latest/install/multinode.html>`_ install guide.
de: Um eine Multinode-Installation zu evaluieren, folgen Sie dem Bare Metal <https://docs.openstack.org/openstack-helm/latest/install/multinode.html>`_ Installationsanleitung.
id: Untuk mengevaluasi instalasi multinode, ikuti panduan pemasangan `Bare Metal <https://docs.openstack.org/openstack-helm/latest/install/multinode.html>` _.
ko_kr: 멀티노드 설치를 평가해 보려면 `Bare Metal <https://docs.openstack.org/openstack-helm/latest/install/multinode.html>`_ 설치 가이드를 따릅니다.

source: To facilitate ease of testing and debugging, information regarding gates and their functionality can be found here.
de: Um das Testen und Debuggen zu erleichtern, finden Sie hier Informationen zu Gates und deren Funktionalität.
id: Untuk memfasilitasi kemudahan pengujian dan debugging, informasi mengenai gate dan fungsinya dapat ditemukan di sini.
ko_kr: 테스팅 및 디버깅을 보다 쉽게 해 주는, 게이트 및 해당 기능에 대한 정보를 여기에서 찾을 수 있습니다.

source: To provide meaningful output from the gates, all information pertaining to the components of the cluster and workflow are output to the logs directory inside each gate. The contents of the log directory are as follows:
de: Um eine sinnvolle Ausgabe von den Gates bereitzustellen, werden alle Informationen bezüglich der Komponenten des Clusters und des Arbeitsablaufs in das Protokollverzeichnis innerhalb jedes Gates ausgegeben. Der Inhalt des Protokollverzeichnisses ist wie folgt:
id: Untuk memberikan output yang berarti dari gate, semua informasi yang berkaitan dengan komponen cluster dan alur kerja adalah output ke direktori log di dalam setiap gate. Isi dari direktori log adalah sebagai berikut:
ko_kr: 게이트로부터 의미 있는 출력을 제공하기 위해서는, 클러스터와 워크 플로우의 구성요소와 관련된 모든 정보가 각 게이트 내부의 logs 디렉터리에 출력됩니다. 로그 디렉터리의 내용들은 다음과 같습니다:

source: To provide reusable components for gate functionality, functions have been provided in the gates/funcs directory. These functions include:
de: Um wiederverwendbare Komponenten für die Gate-Funktionalität bereitzustellen, wurden Funktionen im Verzeichnis gates/funcs bereitgestellt. Diese Funktionen umfassen:
id: Untuk menyediakan komponen yang dapat digunakan kembali untuk fungsi gate, fungsi telah disediakan di direktori gates/funcs. Fungsi-fungsi ini termasuk:
ko_kr: 게이트의 기능을 위한 재사용 가능한 구성요소들을 제공하기 위해, gates/funcs 디렉터리 내에 기능들을 제공합니다. 이 기능들은 포함합니다:

source: Welcome to OpenStack-Helm's documentation!
de: Willkommen zur Dokumentation von OpenStack-Helm!
id: Selamat datang di dokumentasi OpenStack-Helm!
ko_kr: OpenStack-Helm의 문서에 오신 것을 환영합니다!

source: `OpenStack-Helm git repository <https://git.openstack.org/cgit/openstack/openstack-helm/>`_
ko_kr: `OpenStack-Helm git 저장소 <https://git.openstack.org/cgit/openstack/openstack-helm/>`_

source: :ref:`search`
de: :ref: `suchen`

source: https://storyboard.openstack.org/#!/project/886
de: https://storycard.openstack.org/#!/project/886

source: Storyboard
id: Storyboard (papan cerita)
