Repository: openstack/openstack-helm
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id, ko_kr

source: Adding Services
de: Hinzufügen von Diensten
id: Menambahkan Layanan
ko_kr: 서비스 추가

source: Adding Tests
de: Hinzufügen von Tests
id: Menambahkan Tes
ko_kr: 테스트 추가

source: Any additional functions required for testing new charts or improving the gate workflow should be placed in the appropriate location.
de: Alle zusätzlichen Funktionen, die zum Testen neuer Diagramme oder zum Verbessern des Gate-Workflows erforderlich sind, sollten an der entsprechenden Stelle platziert werden.
id: Setiap fungsi tambahan yang diperlukan untuk menguji chart baru atau meningkatkan gate workflow harus ditempatkan di lokasi yang tepat.
ko_kr: 새로운 차트들을 테스트하거나 게이트 워크 플로우를 개선하기 위한 추가적인 기능들은 적절한 장소에 위치해야 합니다.

source: Any tests that do not use the Rally testing framework would need to be handled in the appropriate manner in launch script. This would ideally result in new functions that could be reused, or expansion of the gate scripts to include scenarios beyond basic service launches.
de: Alle Tests, die das Rally-Test-Framework nicht verwenden, müssen im Start-Skript entsprechend behandelt werden. Dies würde idealerweise zu neuen Funktionen führen, die wiederverwendet werden könnten, oder eine Erweiterung der Gate-Scripts um Szenarien, die über die Einführung von Basisdiensten hinausgehen.
id: Setiap tes yang tidak menggunakan kerangka pengujian Rally harus ditangani dengan cara yang sesuai dalam skrip peluncuran. Ini idealnya menghasilkan fungsi baru yang dapat digunakan kembali, atau perluasan skrip gate untuk memasukkan skenario di luar peluncuran layanan dasar.
ko_kr: Rally 테스팅 프레임워크를 사용하지 않은 테스트는 시작 스크립트에서 적절한 방식으로 처리해야 합니다. 이는 재사용 될 수 있는 새로운 기능이나, 기본 서비스 시작 이상의 시나리오들을 포함하기 위한 게이트 스크립트들의 확장이라는 이상적인 결과를 가져올 것입니다.

source: As charts for additional services are added to OpenStack-Helm, they should be included in the gates. Adding new services to the gates allows a chart developer and the review team to identify any potential issues associated with a new service. All services are currently launched in the gate via a series of launch scripts of the format ``NNN-service-name.sh`` where ``NNN`` dictates the order these scripts are launched. The script should contain an installation command like:
de: Da Charts für zusätzliche Dienste zu OpenStack-Helm hinzugefügt werden, sollten sie in den Gates enthalten sein. Durch Hinzufügen neuer Dienste zu den Gates können ein Charts-Entwickler und das Überprüfungsteam potenzielle Probleme identifizieren, die mit einem neuen Dienst verbunden sind. Alle Dienste werden derzeit über eine Reihe von Start-Skripts im Format ``NNN-service-name.sh`` gestartet, wobei ``NNN`` die Reihenfolge angibt, in der diese Skripte gestartet werden. Das Skript sollte einen Installationsbefehl enthalten wie:
id: Karena chart untuk layanan tambahan ditambahkan ke OpenStack-Helm, mereka harus dimasukkan ke dalam gate. Menambahkan layanan baru ke gate memungkinkan pengembang chart dan tim peninjau untuk mengidentifikasi setiap potensi masalah yang terkait dengan layanan baru. Semua layanan saat ini diluncurkan di gate melalui serangkaian skrip peluncuran format ``NNN-service-name.sh`` dimana ``NNN`` mendikte perintah skrip ini diluncurkan. Skrip harus berisi perintah pemasangan seperti:
ko_kr: 추가적인 서비스들을 위한 차트로서 OpenStack-Helm에 추가되기 위해, 그들은 그 게이트에 포함되어야만 합니다. 새로운 서비스들을 게이트에 추가하는 것은 차트 개발자와 검토 팀에게 새로운 서비스와 연관된 잠재적인 문제를 확인하는 것을 허락합니다. 모든 서비스는 현재 게이트 내에서 ``NNN``이 이 스크립트들이 시작되는 순서를 지정하는 ``NNN-service-name.sh``라는 일련의 시작 스크립트 형식을 통해 시작됩니다.

source: As new charts are developed and the services are added to the gate, an associated Helm test should be introduced to the gates. The appropriate place for executing these tests is in the respective service's launch script, and must be placed after the entry for installing the service and any associated overrides. Any tests that use the Rally testing framework should leverage the helm_test_deployment function in the aforementioned funcs/helm.sh file. For example, a Helm test for Mistral might look like:
de: Wenn neue Charts entwickelt werden und die Dienste dem gate hinzugefügt werden, sollte ein zugehöriger Helm-Test zu den Gates eingeführt werden. Der entsprechende Ort zum Ausführen dieser Tests befindet sich im Startskript des jeweiligen Diensts und muss nach dem Eintrag für die Installation des Diensts und den zugehörigen Überschreibungen platziert werden. Alle Tests, die das Rally-Test-Framework verwenden, sollten die Funktion helm_test_deployment in der oben genannten Datei funcs/helm.sh nutzen. Zum Beispiel könnte ein Helm-Test für Mistral wie folgt aussehen:
id: Ketika chart baru dikembangkan dan layanan ditambahkan ke gate, tes Helm yang terkait harus diperkenalkan ke gate. Tempat yang tepat untuk mengeksekusi tes ini adalah di skrip peluncuran layanan masing-masing, dan harus ditempatkan setelah entri untuk menginstal layanan dan menimpa yang terkait. Setiap tes yang menggunakan kerangka pengujian Rally harus memanfaatkan fungsi helm_test_deployment di file funcs/helm.sh yang disebutkan di atas. Misalnya, tes Helm untuk Mistral mungkin terlihat seperti:
ko_kr: 새 차트들이 개발되고 서비스가 게이트에 추가되기 위해서, 연관된 Helm 테스트가 게이트에 도입되어야 합니다. 이러한 테스트들을 실행하기 위한 최적 위치는 각 서비스의 시작 스크립트에 있으며, 서비스와 관련 오버라이드들을 설치하기 위한 엔트리 뒤에 있어야 합니다. Rally 테스팅 프레임워크를 사용하는 테스트들은 앞서 언급한 funcs/helm.sh 파일의 helm_test_deployment 기능을 활용해야 합니다. 예를 들어, Mistral을 위한 Helm 테스트는 아래와 같이 보일 것입니다:

source: Bugs and enhancements are tracked via OpenStack-Helm's `Storyboard <https://storyboard.openstack.org/#!/project_group/64>`_.
de: Bugs und Verbesserungen werden über das Storyboard von OpenStack-Helm verfolgt <https://storyboard.openstack.org/#!/project_group/64>`_.
id: Bug dan perangkat tambahan dilacak via OpenStack-Helm's `Storyboard <https://storyboard.openstack.org/#!/project_group/64>`_.
ko_kr: 버그 및 개선사항은 OpenStack-Helm의 `Storyboard <https://storyboard.openstack.org/#!/project_group/64>`_ 에서 추적이 이루어집니다.

source: Bugs should be filed as stories in Storyboard, not GitHub:
de: Bugs sollten als Story im Storyboard abgelegt werden, nicht GitHub:
id: Bug harus diajukan sebagai cerita di Storyboard, bukan GitHub:
ko_kr: 버그는 GitHub가 아닌 Storyboard에 스토리 단위로 제출되어야 합니다:

source: Communication
de: Kommunikation
id: Komunikasi
ko_kr: 의사소통

source: Community IRC Meetings: [Every Tuesday @ 3PM UTC], #openstack-meeting-5 on freenode
de: Community IRC Meetings: [Jeden Dienstag um 15:00 UTC], #openstack-meeting-5 auf freenode
id: Rapat IRC Komunitas: [Setiap Selasa @ 3PM UTC], #openstack-meeting-5 di freenode
ko_kr: Community IRC Meetings: [매주 화요일 @ 3PM UTC], freenode 내 #openstack-meeting-5

source: Contents:
de: Inhalt:
id: Isi:
ko_kr: 목차:

source: Contributing
de: Beitragend
id: Berkontribusi
ko_kr: 기여하기

source: Developers wishing to work on the OpenStack-Helm project should always base their work on the latest code, available from the OpenStack-Helm git repository.
de: Entwickler, welche am OpenStack-Helm Projekt mitarbeiten wollen, sollen immer ihre Arbeit auf den aktuellen Code basieren, welcher im OpenStack-Helm Git Repository verfügbar ist.
ko_kr: OpenStack-Helm 프로젝트에서 작업하고자 하는 개발자는 OpenStack-Helm git 저장소에서 제공하는 최신 코드를 가지고서 작업하여야 합니다.

source: Functions for Helm specific operations, found in helm.sh. These functions include: installing Helm, serving a Helm repository locally, linting and building all Helm charts, running Helm tests on a release, installing the helm template plugin, and running the helm template plugin against a chart.
de: Funktionen für helmspezifische Operationen, gefunden in helm.sh. Zu diesen Funktionen gehören: Helm installieren, ein Helm-Repository lokal bereitstellen, alle Helm-Diagramme filtern und erstellen, Helm-Tests für ein Release ausführen, das Helm-Vorlagen-Plugin installieren und das Helm-Vorlagen-Plugin gegen ein Diagramm ausführen.
id: Fungsi untuk operasi khusus Helm, ditemukan di helm.sh. Fungsi-fungsi ini meliputi: memasang Helm, melayani repositori Helm secara lokal, membuat linting dan membangun semua Helm chart, menjalankan tes Helm pada rilis, menginstal plugin template kemudi, dan menjalankan plugin template helm terhadap chart.
ko_kr: Helm 특정 작업들을 위한 기능들은, helm.sh에서 찾을 수 있습니다. 이 기능들은 포함합니다: Helm 설치, 로컬의 Helm 저장소 제공, 모든 Helm 차트에 대한 linting과 building, 배포 상에서 Helm 테스트를 수행, Helm 템플릿 플러그인 설치, 그리고 차트에 대한 Helm 템플릿 플러그인을 실행합니다.

source: Functions for Kubernetes specific operations, found in kube.sh. These functions include: waiting for pods in a specific namespace to register as ready, waiting for all nodes to register as ready, install the requirements for the kubeadm-aio container used in the gates, building the kubeadm-aio container, launching the kubeadm-aio container, and replacing the kube-controller-manager with a specific image necessary for ceph functionality.
de: Funktionen für Kubernetes-spezifische Operationen, gefunden in kube.sh. Zu diesen Funktionen gehören: Warten auf Pods in einem bestimmten Namespace, um sich als bereit zu registrieren, Warten auf die Registrierung aller Knoten als bereit, Installieren der Anforderungen für den in den Gates verwendeten kubeadm-aio-Container, Erstellen des kubeadm-aio-Containers, Starten des kubeadm-aio-Containers aio container, und ersetzen Sie den kube-controller-manager durch ein spezielles Abbild, das für die ceph-Funktionalität benötigt wird.
id: Fungsi untuk Kubernetes operasi spesifik, ditemukan di kube.sh. Fungsi-fungsi ini meliputi: menunggu pod dalam namespace tertentu untuk mendaftar sebagai siap (ready), menunggu semua node untuk mendaftar sebagai siap, menginstal persyaratan untuk kontainer kubeadm-aio yang digunakan di gate, membangun kontainer kubeadm-aio, meluncurkan kontainer kubeadm- aio, dan mengganti kube-controller-manager dengan image spesifik yang diperlukan untuk fungsi ceph.
ko_kr: Kubernetes 특정 작업들을 위한 기능들은, kube.sh에서 찾을 수 있습니다. 이 기능들은 포함합니다: 준비 상태로 등록하기 위해 특정 namespace 내의 pod들을 대기, 준비 상태로 등록하기 위해 모든 node를 대기, 게이트들에서 사용되는 kubeadm-aio 컨테이너를 위한 요구사항들을 설치, kubeadm-aio 컨테이너 빌드, kubeadm-aio 컨테이너 시작, 그리고 kube-controller-manager를 ceph 기능을 위해 필요한 특정 이미지로 대체.

source: Functions for OpenStack specific operations, found in openstack.sh. These functions include: waiting for a successful ping, and waiting for a booted virtual machine's status to return as ACTIVE.
de: Funktionen für OpenStack-spezifische Operationen, die in openstack.sh enthalten sind. Zu diesen Funktionen gehören: Warten auf einen erfolgreichen Ping und Warten auf den Status einer gestarteten virtuellen Maschine als ACTIVE.
id: Fungsi untuk operasi spesifik OpenStack, ditemukan di openstack.sh. Fungsi-fungsi ini meliputi: menunggu ping yang berhasil, dan menunggu status mesin virtual boot untuk kembali sebagai AKTIF.
ko_kr: OpenStack 특정 작업들을 위한 기능들은, openstack.sh에서 찾을 수 있습니다. 이 기능들은 포함합니다: 성공적인 ping을 대기, 그리고 부팅된 가상머신의 상태를 ACTIVE로 반환하기 위해 대기.

source: Functions for common host preparation operations, found in common.sh
de: Funktionen für allgemeine Hostvorbereitungsoperationen, die unter common.sh zu finden sind
id: Fungsi untuk operasi persiapan host umum, ditemukan di common.sh
ko_kr: 일반 호스트 작업 준비 기능은, common.sh에서 찾을 수 있습니다.

source: Functions for network specific operations, found in network.sh. These functions include: creating a backup of the host's resolv.conf file before deploying the kubeadm environments, restoring the original resolv.conf settings, creating a backup of the host's /etc/hosts file before adding the hosts interface and address, and restoring the original /etc/hosts file.
de: Funktionen für netzwerkspezifische Operationen, gefunden in network.sh. Zu diesen Funktionen gehören: Erstellen einer Sicherungskopie der resolv.conf-Datei des Hosts vor dem Bereitstellen der kubeadm-Umgebungen, Wiederherstellen der ursprünglichen resolv.conf-Einstellungen, Erstellen einer Sicherungskopie der Datei /etc/hosts des Hosts vor dem Hinzufügen der Hostschnittstelle und -adresse und Wiederherstellen der Original /etc/hosts Datei.
id: Fungsi untuk operasi spesifik jaringan, ditemukan di network.sh. Fungsi-fungsi ini meliputi: membuat cadangan file resolv.conf host sebelum menyebarkan lingkungan kubeadm, memulihkan pengaturan resolv.conf asli, membuat cadangan file /etc/hosts milik host sebelum menambahkan antarmuka dan alamat host, dan memulihkan file /etc/hosts asli.
ko_kr: 네트워크 특정 작업들을 위한 기능들은, network.sh에서 찾을 수 있습니다. 이 기능들은 포함합니다: kubeadm 환경들에 배포하기 전에 호스트의 resolv.conf 파일의 백업을 생성, 원본 resolv.conf 설정들을 복구, hosts의 인터페이스와 주소를 추가하기 전에 호스트의 /etc/hosts 파일의 백업을 생성, 그리고 원본 /etc/hosts 파일을 복구.

source: Gate Checks
id: Gate Checks (pemeriksaan gate)
ko_kr: 게이트 점검 사항

source: Gate Functions
de: Gate-Funktionen
id: Gate Functions (fungsi gate)
ko_kr: 게이트 기능

source: Gate Output
de: Gate-Ausgang
ko_kr: 게이트 출력

source: If you would like to contribute to the development of OpenStack, you must follow the steps in this page:
de: Wenn Sie zur Entwicklung von OpenStack beitragen möchten, müssen Sie die Schritte auf dieser Seite befolgen:
id: Jika Anda ingin berkontribusi pada pengembangan OpenStack, Anda harus mengikuti langkah-langkah di halaman ini:
ko_kr: OpenStack 개발에 기여하고자 한다면, 이 페이지에 있는 다음 단계를 따라야 합니다:

source: Indices and Tables
de: Indizes und Tabellen
id: Indeks dan Tabel
ko_kr: 색인 및 표

source: Installation and Development
de: Installation und Entwicklung
id: Instalasi dan Pengembangan
ko_kr: 설치 및 배포

source: Join us on `IRC <irc://chat.freenode.net:6697/openstack-helm>`_: #openstack-helm on freenode
de: Begleiten Sie uns auf `IRC <irc://chat.freenode.net:6697/openstack-helm>`_: #openstack-helm auf freenode
id: Bergabunglah dengan kami `IRC <irc://chat.freenode.net:6697/openstack-helm>`_: #openstack-helm di freenode
ko_kr: `IRC <irc://chat.freenode.net:6697/openstack-helm>`_: freenode 내 #openstack-helm 에 가입합니다

source: Join us on `Slack <https://kubernetes.slack.com/messages/C3WERB7DE/>`_ - #openstack-helm
de: Begleiten Sie uns auf `Slack <https://kubernetes.slack.com/messages/C3WERB7DE/>`_ - #openstack-helm
id: Bergabunglah dengan kami `Slack <https://kubernetes.slack.com/messages/C3WERB7DE/>`_ - #openstack-helm
ko_kr: `Slack <https://kubernetes.slack.com/messages/C3WERB7DE/>`_ - #openstack-helm 에 가입합니다

source: Meeting Agenda Items: `Agenda <https://etherpad.openstack.org/p/openstack-helm-meeting-agenda>`_
de: Tagesordnungspunkte: `Agenda <https://etherpad.openstack.org/p/openstack-helm-meeting-agenda>`_
id: Item Agenda Rapat: `Agenda <https://etherpad.openstack.org/p/openstack-helm-meeting-agenda>`_
ko_kr: 미팅 아젠다 항목: `Agenda <https://etherpad.openstack.org/p/openstack-helm-meeting-agenda>`_

source: Mission
id: Misi
ko_kr: 임무

source: Once those steps have been completed, changes to OpenStack should be submitted for review via the Gerrit tool, following the workflow documented at:
de: Sobald diese Schritte abgeschlossen sind, sollten Änderungen an OpenStack zur Überprüfung mit dem Gerrit-Tool gemäß dem dokumentierten Workflow gesendet werden:
id: Setelah langkah-langkah tersebut selesai, perubahan OpenStack harus dikirim untuk ditinjau melalui alat Gerrit, mengikuti alur kerja yang didokumentasikan di:
ko_kr: 해당 단계를 완료한 이후에는, OpenStack 변경 사항이 Gerrit 도구를 통해 리뷰 제출이 이루어집니다. 이후 워크 플로우는 아래에 문서화되어 있습니다:

source: OpenStack-Helm Gates
ko_kr: OpenStack-Helm 게이트

source: OpenStack-Helm currently checks the following scenarios:
de: OpenStack-Helm überprüft derzeit die folgenden Szenarien:
id: OpenStack-Helm saat ini memeriksa skenario berikut:
ko_kr: OpenStack-Helm은 현재 다음의 시나리오들을 점검합니다:

source: OpenStack-Helm's single node and multinode gates leverage the kubeadm-aio environment created and maintained for use as a development environment. All information regarding the kubeadm-aio environment can be found here_.
de: Die Single-Node- und Multinode-Gates von OpenStack-Helm nutzen die kubeadm-aio-Umgebung, die zur Verwendung als Entwicklungsumgebung erstellt und verwaltet wird. Alle Informationen zur kubeadm-aio-Umgebung finden Sie hier.
id: Node tunggal OpenStack-Helm dan gate multinode memanfaatkan lingkungan kubeadm-aio yang dibuat dan dipelihara untuk digunakan sebagai lingkungan pengembangan. Semua informasi mengenai lingkungan kubeadm-aio dapat ditemukan di sini_.
ko_kr: OpenStack-Helm의 단일 노드와 다중 노드 게이트를 개발환경으로 사용하기 위해 생성되고 유지되는 kubeadm-aio 환경을 활용합니다. kubeadm-aio 환경에 관한 모든 정보는 여기에서 찾을 수 있습니다.

source: Please review our `documentation <https://docs.openstack.org/openstack-helm/latest/>`_. For quick installation, evaluation, and convenience, we have a kubeadm based all-in-one solution that runs in a Docker container. The Kubeadm-AIO set up can be found `here <https://docs.openstack.org/openstack-helm/latest/install/developer/index.html>`_.
de: Bitte lesen Sie unsere `Dokumentation <https://docs.openstack.org/openstack-helm/latest/>`_. Für schnelle Installation, Evaluierung und Komfort haben wir eine kubeadm-basierte All-in-One-Lösung, die in einem Docker-Container ausgeführt wird. Das Kubeadm-AIO-Setup finden Sie hier <https://docs.openstack.org/openstack-helm/latest/install/developer/index.html>`_.
id: Harap tinjau kami `documentation <https://docs.openstack.org/openstack-helm/latest/>`_. Untuk instalasi cepat, evaluasi, dan kenyamanan, kami memiliki solusi all-in-one berbasis kubeadm yang berjalan dalam kontainer Docker. Pengaturan Kubeadm-AIO dapat ditemukan `here <https://docs.openstack.org/openstack-helm/latest/install/developer/index.html>`_.
ko_kr: 우리의 `문서 <https://docs.openstack.org/openstack-helm/latest/>`_ 를 검토해주세요. 빠른 설치, 평가, 그리고 편의를 위해서, 우리는 kubeadm 기반의 Docker 컨테이너에서 실행되는 올인원 솔루션을 갖고 있습니다. Kubeadm-AIO 설치는 `여기 <https://docs.openstack.org/openstack-helm/latest/install/developer/index.html>`_ 에서 찾을 수 있습니다.

source: Provisioning a multi-node Ubuntu-1604 cluster and deploying the OpenStack services. This check is provided for both a two node cluster and a three node cluster.
de: Bereitstellung eines Ubuntu-1604-Clusters mit mehreren Knoten und Bereitstellung der OpenStack-Dienste. Diese Überprüfung wird sowohl für einen Cluster mit zwei Knoten als auch für einen Cluster mit drei Knoten bereitgestellt.
id: Menyediakan multi-node klaster Ubuntu-1604 dan menyebarkan layanan OpenStack. Pemeriksaan ini disediakan untuk dua klaster node dan tiga klaster node.
ko_kr: 다중 노드의 Ubuntu-1604 클러스터를 프로비저닝하고 OpenStack 서비스에 배포합니다. 두 노드와 세 노드의 클러스터 모두 이를 제공합니다.

source: Provisioning a single node cluster and deploying the OpenStack services. This check is provided for: Ubuntu-1604, CentOS-7, and Fedora-25.
de: Bereitstellen eines einzelnen Knotenclusters und Bereitstellen der OpenStack-Dienste. Dieser Check ist vorgesehen für: Ubuntu-1604, CentOS-7 und Fedora-25.
id: Menyediakan satu klaster node dan menyebarkan layanan OpenStack. Pemeriksaan ini disediakan untuk: Ubuntu-1604, CentOS-7, dan Fedora-25.
ko_kr: 단일 노드를 프로비저닝하고 OpenStack 서비스에 배포합니다. Ubuntu-1604, CentOS-7, 그리고 Fedora-25가 이를 제공합니다.

source: Pull requests submitted through GitHub will be ignored.
de: Pull-Anfragen, die über GitHub gesendet werden, werden ignoriert.
id: Permintaan tarik (pull request) yang dikirimkan melalui GitHub akan diabaikan.
ko_kr: GitHub를 통한 풀 리퀘스트는 다루어지지 않을 것입니다.

source: Repository
ko_kr: 저장소

source: Running Make on each chart, which lints and packages the charts. This gate does not stand up a Kubernetes cluster.
de: Starte Make für jedes Chart, welches Charts mit Lint überprüft und packt. Dieses Gate startet keinen Kubernetes-Cluster.
id: Menjalankan Make pada setiap chart, yang lint dan package chart. Gate ini tidak memiliki kluster Kubernetes.
ko_kr: lint하고 package한 각 chart마다 make를 실행합니다. 이 게이트는 Kubernes 클러스터를 유지하지 않습니다.

source: Some services in the gate require specific overrides to the default values in the chart's values.yaml file. If a service requires multiple overrides to function in the gate, the service should include a separate values.yaml file placed in the tools/overrides/mvp directory. The <service>.yaml MVP files provide a configuration file to use for overriding default configuration values in the chart's values.yaml as an alternative to overriding individual values during installation. A chart that requires a MVP overrides file requires the following format:
de: Einige Dienste im Gate erfordern bestimmte Überschreibungen zu den Standardwerten in der values.yaml-Datei des Charts. Wenn ein Dienst mehrere Überschreibungen benötigt, um im Gate zu funktionieren, sollte der Dienst eine separate Datei values.yaml enthalten, die im Verzeichnis tools/overrides/mvp abgelegt ist. Die <service>.yaml MVP-Dateien bieten eine Konfigurationsdatei, die zum Überschreiben von Standardkonfigurationswerten in den values.yaml des Diagramms als Alternative zum Überschreiben einzelner Werte während der Installation verwendet werden kann. Ein Diagramm, für das eine MVP-Überschreibungsdatei erforderlich ist, muss das folgende Format aufweisen:
id: Beberapa layanan di gate memerlukan pengunggahan spesifik ke nilai default di file values.yaml chart. Jika suatu layanan memerlukan beberapa override untuk berfungsi di gate, layanan harus menyertakan file values.yaml yang terpisah yang ditempatkan di direktori tools/overrides/mvp. File MVP <service>.yaml menyediakan file konfigurasi yang digunakan untuk mengesampingkan nilai konfigurasi default di values.yaml milik chart sebagai alternatif untuk menimpa nilai individual selama instalasi. Sebuah chart yang membutuhkan file menimpa MVP membutuhkan format berikut:
ko_kr: 게이트의 어떤 서비스는 차트의 value.yaml 파일의 기본값에 대한 특정 오버라이드들을 요구합니다. 서비스가 게이트에서 기능하기 위한 다수의 오버라이드를 요구한다면, 그 서비스는 tools/overrides/mvp 디렉터리 내 별도의 values.yaml 파일을 포함해야 합니다. <service>.yaml MVP 파일들은 설치 중에 오버라이딩한 개개의 값들에 대한 대안으로 차트의 values.yaml의 기본 구성 값들을 오버라이딩 하여 사용하기 위한 구성 파일을 제공합니다. MVP 오버라이드 파일이 요구한 차트는 다음의 포맷을 요구로 합니다:

source: Testing any documentation changes and impacts.
de: Testen von Änderungen und Auswirkungen der Dokumentation
id: Menguji perubahan dan dampak dokumentasi apa pun.
ko_kr: 문서 변경과 영향 테스트

source: The K8s directory contains the logs and output of the Kubernetes objects. It includes: pods, nodes, secrets, services, namespaces, configmaps, deployments, daemonsets, and statefulsets. Descriptions for the state of all resources during execution are found here, and this information can prove valuable when debugging issues raised during a check. When a single node or multi-node check fails, this is the first place to look. The logs found here are helpful when the templates render correctly, but the services are not functioning correctly, whether due to service configuration issues or issues with the pods themselves.
de: Das Verzeichnis K8s enthält die Protokolle und die Ausgabe der Kubernetes-Objekte. Dazu gehören: Pods, Knoten, Secrets, Services, Namespaces, Configmaps, Bereitstellungen, Daemonsets und Statefulsets. Beschreibungen für den Status aller Ressourcen während der Ausführung finden Sie hier. Diese Informationen können sich beim Debuggen von Problemen während einer Prüfung als nützlich erweisen. Wenn eine Prüfung mit einem einzelnen Knoten oder mehreren Knoten fehlschlägt, sollten Sie zuerst nachsehen. Die hier gefundenen Protokolle sind hilfreich, wenn die Vorlagen korrekt gerendert werden, die Dienste jedoch nicht ordnungsgemäß funktionieren, unabhängig davon, ob Probleme mit der Dienstkonfiguration oder Probleme mit den Pods auftreten.
ko_kr: K8s 디렉터리는 Kubernetes 오즈젝트에 대한 로그와 출력물이 저장됩니다. 여기에는 pods, nodes, secrets, services, namespaces, configmaps, deployments, daemonsets, statefulsets 들이 포함됩니다. 실행 중인 모든 자원의 상태를 확인할 수 있는 설명들이 여기에 있으며, 이 정보는 검사 중 발생하는 문제를 디버깅할때 유용합니다. 단일 노드 또는 다중 노드 검사가 실패했을 때, 여기를 가장 먼저 확인합니다. 이곳에 있는 로그는 템플릿으로 올바르게 렌더링되지만 서비스 구성 문제나 pods 자체 관련된 문제로 인해 제대로 작동하지 않을때 유용합니다.
